[
 {
 	"hero_name":"Anti-Mage",
 	"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/antimage_full.png",
 	"hero_role":"Melee - Carry - Escape - Nuker",
	"hero_detail":"တကယ္လုိ႔ သင္က Carry ကစားသမားတစ္ေယာက္ဆုိရင္ ေရွာင္လႊဲလုိ႔ မရတဲ့ Hard Carry တစ္ေကာင္ရွိပါတယ္။ ေယဘုယ်အားျဖင့္ Hard Carry ေတြဟာ Item လုိအပ္တဲ့ Agility Hero မ်ား ျဖစ္ေလ့ရွိျပီး အခ်ိန္အတုိင္းအတာ တစ္ခုထိ Team Fight ကုိ ေရွာင္ရေလ့ရွိပါတယ္။ ဒါေၾကာင့္ Escape Ability ပါဝင္တဲ့ Hard Carry မ်ားဟာ လူၾကဳိက္မ်ားေလ့ရွိျပီး ကစားသမားတုိင္းနဲ႕လည္း မကင္းကြာပါဘူး။ ဒီလုိ အေျခခံက်တဲ့ Hard Carry တစ္ေကာင္ျဖစ္တဲ့ Anti-Mage ဟာ လူၾကဳိက္မ်ားတဲ့ Hero တစ္ေကာင္ျဖစ္ျပီး Dota 2 သမုိင္းေၾကာင္းတစ္ေလွ်ာက္ ပြဲေပါင္း ၁၃၁ သန္း ေက်ာ္ ေရြးခ်ယ္ ကစားခံရတဲ့ ၂၂ ေကာင္ေျမာက္ လူၾကဳိက္အမ်ားဆုံး Hero တစ္ေကာင္လည္းျဖစ္ပါတယ္။ တစ္ဖက္အသင္းမွာ Manapool ၾကီးတဲ့ Caster ေတြ ပါခဲ့ရင္၊ ပြဲက RAT တဲ့ ပုံစံနဲ႕ ေဆာ့မွ ရမယ့္ အေျခအေနမ်ဴိးဆုိရင္၊ မိမိအသင္းမွာ Ganker ေတြ မ်ားေနတဲ့ အေျခအေနမ်ဴိးဆုိရင္၊ တစ္ဖက္အသင္းမွာ ပြဲေနာက္ပုိင္းအထိ သတိထားရမယ့္ Carry တစ္ေကာင္ေကာင္ ပါေနခဲ့ရင္၊ စတဲ့ အေျခအေနမ်ဴိးစုံေပၚကုိ မူတည္ျပီး Anti-Mage ကို ေရြးခ်ယ္ႏုိင္တဲ့အတြက္ သင္က Last Hit ပုိင္းမွာ မိမိကုိယ္ကုိ ယုံၾကည္မႈရွိမယ္ဆုိရင္ ေရြးခ်ယ္ ႏုိင္တဲ့ Hero ေကာင္းတစ္ေကာင္ဆုိတာ ျငင္းလုိ႔ မရပါဘူး။
	 Abilities
	 Mana Break
	 Anti-Mage ဆုိတဲ့ နာမည္အတုိင္း Mana အသုံးျပဳတဲ့ Mage ေတြကုိ ဆန္႔က်င္ေသာ အဓိက Ability တစ္ခုျဖစ္တဲ့ Mana Break ဟာ Unique Attack modifier Ability တစ္ခုျဖစ္ပါတယ္။ Dota အေခၚအရ Orb Effect ျဖစ္ျပီး Dominator, Satanic, Skadi, Desolator စတဲ့ Item ေတြ ေရြးခ်ယ္ခဲ့မယ္ဆုိရင္ Mana Break Passive ရပ္တန္႔သြားမွာျဖစ္ပါတယ္။ Maelstrom နဲ႕ Mjollnir တုိ႔ကုိ ဆက္ခဲ့မယ္ဆုိရင္ေတာ့ Chain Lightning ထြက္တဲ့အခ်ိန္မွာ Mana Break သတ္ေရာက္မွာ မဟုတ္ပါဘူး။ Diffusal Blade ဟာ Unit Attack Modifier မဟုတ္ေပမယ့္ Mana Break နဲ႕ တြဲဖက္ သတ္ေရာက္ႏုိင္ျခင္း မရွိတဲ့ ခြ်င္းခ်က္တစ္ခု ရွိပါတယ္။ Mana Break ဟာ 28/ 40/ 58/ 64 ဆုိတဲ့ Mana ပမာဏကုိ Burn ပစ္လုိက္မွာျဖစ္ျပီး အဆုိပါ ပမာဏရဲ႕ 60% ဟာ Physical Damage အျဖစ္ အပုိေဆာင္း ထိမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Mana ရွိတဲ့ Hero တစ္ေကာင္ကုိ တုိက္ခုိက္တဲ့အခါမွာ မိမိမူလ Physical attack damage အျပင္ ဒီ 60% ကေန ရရွိမယ့္ အပုိ 19/ 24/ 31/ 38 ဆုိတဲ့ Bonus Damage ကုိ ရရွိမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ မိမိတုိက္ခုိက္ေနတဲ့ Unit က Mana မရွိတဲ့အေျခအေန၊ Mana ကုန္ေနတဲ့ အေျခအေနမ်ဴိးမွာ ဒီ Bonus Damage ကုိ ရရွိမွာ မဟုတ္ပါဘူး။
	 Blink
	 ေထြေထြထူးထူးေျပာစရာ မရွိတဲ့ Blink ကေတာ့ Anti-Mage ရဲ႕ Escape Ability တစ္ခုပဲျဖစ္ပါတယ္။ ပုံေသ Mana Cost 60 ပဲ ရွိျပီး ေနာက္ဆုံးအဆင့္မွာ Cooldown ဟာ 5 seconds အထိ ေလ်ာ့က်သြားမွာျဖစ္ပါတယ္။ Anti-Mage ရဲ႕ Farming နဲ႕ Escape ဟာ ဒီ Blink ေပၚမွာ မ်ားစြာ မူတည္ေနတဲ့အတြက္ မရွိမျဖစ္ လုိအပ္တဲ့ Ability တစ္ခုဆုိလည္း မမွားပါဘူး။ ပထမဆုံးအဆင့္မွာ 925 Range အကြာအေဝးထိ ခုန္ႏုိင္ျပီး ေနာက္ဆုံးအဆင့္ေရာက္မွသာ 1150 Range အထိ ခုန္ႏုိင္မွာျဖစ္ပါတယ္။ အားနည္းခ်က္ကေတာ့ Frostbite, Searing Chain, Entangling Claw, Ensnare, Overgrowth နဲ႕ Earthbind ကဲ့သုိ႔ Root Ability ေတြ သက္ေရာက္ခံထားရခ်ိန္မွာေတာ့ Disable ျဖစ္မေနသည့္တုိင္ေအာင္ Blink ကုိ အသုံးျပဳႏုိင္မွာ မဟုတ္ဘဲ အားသာခ်က္ကေတာ့ Global Cast Range ရွိျခင္းျဖစ္ျပီး မိမိ အသုံးျပဳလုိက္တဲ့ အရပ္ကုိ လက္ရွိယူထားတဲ့ အဆင့္အကြာအေဝးအတုိင္း ေရာက္ရွိသြားမွာျဖစ္ပါတယ္။ (Faceless Void ရဲ႕ Timewalk, QoP ရဲ႕ Blink, PA ရဲ႕ Blink Strike တုိ႔မွာ ဒီလုိ အားသာခ်က္ မရွိပါဘူး)
	 Spell Shield
	 Anti-Mage ရဲ႕ Basic Magic Resistance ဟာ 25% ရွိပါတယ္။ Spell Shield ကုိ တင္လုိက္တဲ့အခါမွာ Magic Resistance မရွိတဲ့ 75% ေပၚမွာတြက္ခ်က္ျပီး Overall Magic Resistance ေတြ ဟာ တုိးလာမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ တတိယအဆင့္မွာ ရရွိမယ့္ 42% Magic Resistance ဆုိတာေၾကာင့္ Anti-Mage ဟာ 25%+42%=64% Magic Resistance ကုိ ရရွိမွာ မဟုတ္ဘဲ က်န္ရွိေနတဲ့ 75% ရဲ႕ 42% ျဖစ္တဲ့ 31.5% Magic Resistance ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ ေနာက္ဆုံးအဆင့္မွာ Anti-Mage ဟာ စုစုေပါင္း 62.5% Magic Resistance ေတာင္ ရရွိေနေစမွာျဖစ္ပါတယ္။
	 Ultimate Mana Void
	 မိမိ Target ေထာက္အသုံးျပဳမယ့္ Unit ရဲ႕ Mana Pool ထဲမွာ ေလ်ာ့ေနတဲ့ Mana ပမာဏကုိ 0.6/ 0.85/ 1.1 နဲ႕ ေျမွာက္ျပီး AoE 500 အတြင္းက Unit ေတြကုိ Magic Damage သတ္ေရာက္မွာျဖစ္ပါတယ္။ ဥပမာ Mana 3000 ရွိတဲ့ Leshrac ဟာ Team Fight တစ္ခုမွာ တုိက္ခုိက္ေနရင္း Mana 453 ခန္႔သာ က်န္တယ္ဆုိပါစုိ႔။ Leshrac ဟာ စုစုေပါင္း Mana 3000-453= 2547 Mana ေလ်ာ့ေနပါတယ္။ ဒီ ေလ်ာ့ေနတဲ့ ပမာဏကုိ ေနာက္ဆုံးအဆင့္ ရဲ႕ေျမွာက္လဒ္ 1.1 နဲ႕ ေျမွာက္ၾကည့္တဲ့အခါမွာ 1.1 x 2547 = 2801 Damage ဟာ အသုံးျပဳခံရတဲ့ Leshrac ရဲ႕ 500 AoE အတြင္းက Unit ေတြ အကုန္လုံးကုိ ထိသြားမွာျဖစ္ပါတယ္။",
 	"hero_overview":"လက္ရွိ Meta အရေတာ့ Anti-Mage ဟာ Battle Fury ကုိ ဦးစြာ Farm ျပီး Battle ေရွာင္ကာ Farm တဲ့ ပုံစံနဲ႕ ကစားလ်က္ရွိပါတယ္။ Anti-Mage ဟာ BAT (Base Attack Time) 1.45 ရွိတဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ ပုံမွန္ Agility Carry ေတြနဲ႕ ယွဥ္ရင္ မ်ားစြာ အားသာခ်က္ ရွိပါတယ္။ BAT ဟာ Attack Speed Increase Amount ကုိ စားျပီး တြက္ခ်က္ ရတဲ့ ကိန္းဂဏန္းျဖစ္လုိ႔ ဂဏန္းေသးေလ ပုိေကာင္းေလျဖစ္ပါတယ္။ (ေယဘုယ် Hero တစ္ေကာင္ရဲ႕ BAT ဟာ 1.7 ခန္႔ရွိပါတယ္။) ဒါေၾကာင့္ ပုံမွန္ Hero ေတြက Attack Speed Item ထည့္ျပီး ျမန္လာတဲ့ Attack Speed ထက္ Anti-Mage က ပုိမ်ားတဲ့ Attack Speed ကုိ ရရွိေနရျခင္းျဖစ္ပါတယ္။ ဒါေၾကာင့္ပဲ Anti-Mage ကုိ Attribute Item ေတြ ျဖစ္တဲ့ Manta-Style, Butterfly စတဲ့ Agility ကုိ တုိးေစတဲ့ Item ေတြကုိ ေရြးခ်ယ္ရျခင္းပဲျဖစ္ပါတယ္။ Attack Speed ျမန္တဲ့အျပင္ Agility ဟာ Anti-Mage ရဲ႕ Base Armor ကုိ တုိးေစတဲ့အျပင္ Illusion Unit ေတြရဲ႕ Damage Output ကုိပါတုိးေစမွာျဖစ္ပါတယ္။ ယခင္ Frozen Throne Dota တုန္းက Anti-Mage ကုိ Power Tread + Vanguard + Offering + Sange and Yasha ပုံစံနဲ႕ အေစာပိုင္း Team Fight ဝင္တဲ့ ပုံစံဟာ ျမင္ေနရၾက ျဖစ္ခဲ့ေပမယ့္ တရုတ္ႏုိင္ငံရဲ႕ သက္ရွိထင္ရွား Legendary Carry Player BurNIng ရဲ႕ ေသသပ္လြန္းတဲ့ Last Hit ေတြကေန ရရွိလာတဲ့ Battle Fury တစ္လက္ဟာ ပြဲအေျပာင္းအလဲ မည္မွ် ျဖစ္သြားေစသလဲဆုိတာကုိ အားလုံးသိရွိျပီးခဲ့တဲ့ ေနာက္မွာေတာ့ Anti-Mage ရဲ႕ လက္ရွိ Meta ဟာ Battle Fury, Offering, Manta Style, Fly, Bkb, Heart ဆုိတဲ့ ေယဘုယ် Build မွာ လည္ပတ္သြားခဲ့ပါတယ္။
	 Anti-Mage အတြက္ေတာ့ တျခား Hero ေတြထက္ အားသာတဲ့ အခ်က္က သူ႔ရဲ႕ Blink ပဲ ျဖစ္ပါတယ္။ Anti-Mage ဟာ မိမိ အသင္းသားေတြနဲ႕အတူ Smoke ကုိ အသုံးျပဳကာ တစ္ဖက္အသင္းရဲ႕ Jungle ကုိ ထုိးေဖာက္ျပီးေနာက္ က်န္ရွိတဲ့ မိမိအသင္းသားမ်ားက Battle ဖန္တီးျပီး အာရုံလႊဲေနခ်ိန္မွာ လြတ္ေနတဲ့ လမ္းကုိ RAT တဲ့ ကစားကြက္ကုိလည္း အေျခအေနအရ အသုံးျပဳႏုိင္ပါေသးတယ္။ ဒီလုိတုိက္ခုိက္ဖုိ႔အတြက္ ျဖစ္ႏုိင္ရင္ မိမိအသင္းသားေတြထဲမွာ Ganker ေတြ မ်ားမ်ား ရွိေနဖုိ႔ လုိအပ္ပါတယ္။ Manta Style ဟာ Antimage ရဲ႕ တတိယေျမာက္ အေရးအၾကီးဆုံး Item ထဲမွာ ပါဝင္ပါတယ္။ Enemy အသင္းက တုိက္ခုိက္မယ့္ Debuff (Silence, Slow, etc..) ေတြကုိ ဖယ္ရွားႏုိင္တဲ့အျပင္ Enemy ကုိ တုိက္ခုိက္တဲ့အခါမွာလည္း Mana Break ကုိလည္း ၃ ဆ ျဖစ္ေစဖုိ႔ အေထာက္အကူေပးတဲ့အတြက္ ျဖစ္ပါတယ္။ မိမိတုိ္က္ခုိက္မယ့္ Enemy Unit ေပၚကုိ Blink ခုန္ျပီးမွ Manta Style ကုိ အသုံးျပဳေပးဖုိ႔ေတာ့ လုိပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
 	"hero_spell":[
 		{
 			"spell_name":"Mana Break",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/antimage_mana_break_hp1.png",
 			"spell_overview":"Burns an opponent's mana on each attack. Mana Break deals 60% of the mana burned as damage to the target. Mana Break is a Unique Attack Modifier, and does not stack with other Unique Attack Modifiers."
 		},
 		{
 			"spell_name":"Blink",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/antimage_blink_hp1.png",
 			"spell_overview":"Short distance teleportation that allows Anti-Mage to move in and out of combat."
 		},
 		{
 			"spell_name":"Spell Shield",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/antimage_spell_shield_hp1.png",
 			"spell_overview":"Increases Anti-Mage's resistance to magic damage."
 		},
 		{
 			"spell_name":"Mana Void",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/antimage_mana_void_hp1.png",
 			"spell_overview":"For each point of mana missing by the target unit, damage is dealt to it and surrounding enemies. The main target is also mini-stunned."
 		}
 	]
 }
]