[
 {
	 	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/647760752041463",
		"hero_intellgience":"20 + 3.40",
	 	"hero_agility":"14 + 1.00",
	 	"hero_strength":"17 + 2.10",
	 	"hero_damage":"22 - 28",
	 	"hero_movement_speed":"300",
	 	"hero_armor":"3.96",
		"hero_name":"ENIGMA",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/enigma_vert.jpg",
		"hero_role":"Ranged - Disabler - Jungler - Initiator - Pusher",
		"hero_detail":"Dota ဟာ သူမတူတဲ႕ Role ေပါင္းမ်ားစြာရွိေသာ Hero မ်ားနဲ႕ ဖြဲ႕စည္းထားသည့္ MOBA (Massive Online Battle Arena) Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ ကစားပြဲတစ္ပြဲမွာ ပါဝင္လာမယ့္ Hero ေတြရဲ႕ အသုံး ဝင္ပုံဟာလည္း မ်ဴိးစုံကြဲျပားလ်က္ရွိပါတယ္။ Battle ကုိ ဦးစားေပး ကစားရတဲ့ Strategy Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ Team Fight ေတြဟာ Dota ရဲ႕ အသက္ပဲ ျဖစ္ပါတယ္။ ဒီလုိ Team Fight တစ္ခုကေန ကစားပြဲတစ္ခုလုံးရဲ႕ ရလာဒ္ကုိ ေျပာင္းလဲသြားေစႏုိင္တဲ့ Ganker, Initiator အခ်ဴိ႕ရွိျပီး ၄င္းတုိ႔ထဲမွာမွ Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Enigma ကေတာ့ Dota တစ္ခုလုံးရဲ႕ Strongest AoE Disable တစ္ခုကုိ ပုိင္ဆုိင္ထားတဲ့ Initiator Hero တစ္ေကာင္ပဲျဖစ္ပါတယ္။ Disable, Jungle, Push, Nuke စေသာ Ability ေကာင္းမ်ားစြာကုိ ပုိင္ဆုိင္ထားတဲ့ Enigma ရဲ႕ Black Hole တစ္လုံးဟာ ကစားပြဲတစ္ခုရဲ႕ အေျပာင္းအလဲကုိ မ်ားစြာ ျဖစ္သြားေစႏုိင္တဲ့အခ်က္က ျငင္းလုိ႔ မရတဲ့အတြက္ မိမိရဲ႕ Black Hole တစ္ခုစီတုိင္းကုိ အက်ဴိးရွိေစဖုိ႔ ပြဲစကတည္းက မိမိ BH ကုိ ဖ်က္ႏုိင္မယ့္ Disable ေတြကုိ ၾကဳိတင္ မွတ္သားထားျပီး Black Hole သုံးခါနီးတုိင္း မိမိကုိ ဖ်က္မယ့္ Disable ဘယ္ႏွစ္ခုကုန္သြားျပီလဲဆုိတာကုိ Overview ၾကည့္ႏုိင္ျပီး စိတ္ရွည္ဖုိ႔ အဓိက လုိအပ္ပါလိမ့္မယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
		"hero_overview":"Enigma ဟာ Demonic Conversion ေၾကာင့္ Jungler ေတြထဲမွာ အားသာခ်က္ အရွိဆုံးနဲ႕ အလြယ္ဆုံး Jungle Farm ႏုိင္တဲ့ Hero တစ္ေကာင္ျဖစ္ေနပါတယ္။ 170 Mana Cost ရွိတဲ့ Demonic Coversion ကုိ 35 seconds ၾကာတုိင္း တစ္ခါသုံးႏုိင္ဖုိ႔ 30 seconds Cooldown သာရွိျပီး 150 Mana ကုိ ေထာက္ပ့ံေပးမယ့္ Soul Ring ဟာ Jungle Enigma တုိင္းအတြက္ မရွိမျဖစ္လုိအပ္ပါလိမ့္မယ္။ Enigma ဟာ ၇ မိနစ္ ဝန္းက်င္မွာ Net Worth 3000 gold ေလာက္ကုိ အလြယ္တကူ ရွာႏုိင္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ အေစာပုိင္း Team Fight တုိင္းကုိ အားသာခ်က္ျဖစ္ေစမယ့္ Mekansm ကုိ ဦးစားေပး ေရြးခ်ယ္ေလ့ရွိပါတယ္။ Hp Pool ေရာ Armor ပါ နည္းပါးတဲ့ Enigma အတြက္ Mekansm ေရြးခ်ယ္မႈဟာ အေကာင္းဆုံးဆုိတာ မွန္ေပမယ့္ ပြဲအေျခအေနကုိၾကည့္ျပီး အေစာပုိင္း Aggressive ေဆာ့ဖုိ႔ Blink Dagger ကုိလည္း ေရြးခ်ယ္ႏုိင္ပါတယ္။ Blink Dagger ကုိ ေရြးခ်ယ္မယ့္ Enigma အေနနဲ႕ Midnight ကုိ တစ္ဆင့္ထက္ ပုိမယူဘဲ Malefice ကုိ တက္နုိင္သေလာက္ ျမန္ျမန္ ဂိတ္ဆုံးေအာင္ ယူသင့္ပါတယ္။ lvl 8 Enigma အေနနဲ႕ Malefice ၃ ဆင့္ေလာက္ တင္ထားျပီးသား ျဖစ္ေနမယ္ဆုိရင္ အေစာပုိင္း aggressive ganker ပုံစံျဖင့္ တစ္ဖက္အသင္းရဲ႕ Farmer ေတြကုိ Ganking လုပ္ဖုိ႔ အေကာင္းမြန္ဆုံး ပုံစံကုိ ပုိင္ဆုိင္ပါလိမ့္မယ္။ Demonic Conversion ဟာ 300 MS, 220 Hp, 4 armor နဲ႕ 41 Avg Damage ေလာက္ရွိျပီျဖစ္လုိ႔ lvl 5 အေရာက္မွာ ၃ ဆင့္ေလာက္ တင္ထားႏုိင္ရင္ လုံေလာက္ သေလာက္ရွိသြားပါျပီ။ ဒါေၾကာင့္ lvl 9 အေရာက္မွာ Malefice ၄ ဆင့္၊ Midnight ၁ ဆင့္ နဲ႕ Demonic Conversion ၃ ဆင့္ေလာက္ တင္ထားျခင္းက Enigma ကုိ ျပည့္စုံေစတဲ့ Hero တစ္ေကာင္ျဖစ္ေစပါလိမ့္မယ္။Blackhole ဟာ 275 Cast Range ပဲ ရွိတဲ့အျပင္ Enigma ကုိယ္တုိင္ကလည္း Mana Cost မ်ားတဲ့ Ability ေတြကုိ ပုိင္ဆုိင္ထားတဲ့အတြက္ သင္က Arcane Boots ကုိ ေရြးခ်ယ္မယ္ဆုိရင္ေတာင္ Aether Lens ကုိ ေျပာင္းလဲ ေပးသင့္ပါတယ္။ Aether Lens ကေန ရရွိမယ့္ +200 Cast Range ဟာ Malefice, Eidolon, Midnight, Black Hole အျပင္ အေရးအၾကီးဆုံး Blink Dagger ကုိပါ ေဝးေဝးခုန္ႏုိင္ေအာင္ အေထာက္အကူ ေပးမွာျဖစ္ပါတယ္။ တကယ္လုိ႔ Guardian Greaves ကုိ ေရြးခ်ယ္ခဲ့မယ္ဆုိရင္ေတာင္ Aether Lens ကုိ ပြဲအေျခအေနအရ ထည့္သြင္းဖုိ႔ စဥ္းစားသင့္ပါတယ္။ +40 Game တုိင္းအတြက္ Bkb, Refresher Orb, Aghanim’s Scepter တုိ႔ကုိ ေရြးခ်ယ္သင့္သလုိ ပြဲအေျခအေနေပၚကုိလုိက္ျပီး Eul Staff, Linken, Glimmer Cape တုိ႔ကုိလည္း ထည့္သြင္း စဥ္းစားေပးရပါမယ္။ ဥပမာ - Long Range Target Disable Hero ေတြျဖစ္တဲ့ Rubick, Vengiful, Disruptor တုိ႔က သင့္ရဲ႕ Black Hole ကုိ အေႏွာက္အယွက္ေပးႏုိင္တဲ့အတြက္ ကစားပြဲအေစာပုိင္းမွာ Glimmer Cape, ကစားပြဲေနာက္ပုိင္းမွာ Linken Sphere တုိ႔ကို ေရြးခ်ယ္ႏုိင္သလုိ Earthshaker, Kunkka တုိ႔လုိ Point Ability ေတြ အတြက္ Bkb နဲ႕ ျပန္လည္ ကာကြယ္ႏုိင္ပါတယ္။ တကယ္လုိ႔ Silencer လုိ႔ Target ေရာ၊ Point ေရာ မဟုတ္တဲ့ Hero ေတြ နဲ႕ ရင္ဆုိင္ရတဲ့အခါမွာေတာ့ Eul Scepter နဲ႕ မိမိေပၚသက္ေရာက္ေနတဲ့ Debuff ကုိ အရင္ ဖယ္ရွားျပီး ျပန္လည္တုိက္ခုိက္ႏုိင္တဲ့ အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။",
		"hero_spell":[
			{
				"spell_name":"Malefice",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_malefice_hp1.png",
				"spell_overview":"Enigma ရဲ႕ Malefice ကေတာ့ Enemy Hero တစ္ေကာင္ကုိ ေသေစဖုိ႔ လုံေလာက္ေစတဲ့ Single Target Disable Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Hero ဟာ Malefice Debuff 4 seconds ကုိ ခံစားရမွာျဖစ္ျပီး တင္တင္ခ်င္း တစ္ခ်က္၊ 2 seconds အၾကာမွာ တစ္ခ်က္၊ 4 seconds အၾကာမွာ တစ္ခ်က္ အားလုံးေပါင္း ၃ ခ်က္ရွိတဲ့ Disable တစ္ခုကုိ ခံစားရမွာျဖစ္ပါတယ္။ ဒီလုိ Stun မယ့္ Duration ကေတာ့ 0.25/ 0.5/ 0.75/ 1 second ဆုိျပီး ယူတဲ့အဆင့္အလုိက္ တုိးလာမွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Demonic Conversion",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_demonic_conversion_hp1.png",
				"spell_overview":"Enigma ကုိ Jungler တစ္ေကာင္အျဖစ္အျပင္ Pusher Hero တစ္ေကာင္အျဖစ္ပါ အသုံးျပဳလုိ႔ရေစတဲ့ Demonic Conversion ကေတာ့ ပုံေသ Mana Cost 170 ရွိတဲ့ Summon Units Ability ျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Unit ဟာ 100% Hp Removal ျဖင့္ Hp အားလုံး ဖယ္ရွားခံလုိက္ရမွာျဖစ္ျပီး Eidolon ၃ ေကာင္ ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ Duration နဲ႕ Cooldown ဟာ ပုံေသ 35 seconds ရွိမွာျဖစ္ျပီး မ်ားမ်ားတင္ေလ Eidolon မ်ားရဲ႕ Hp, MS, Armor နဲ႕ Damage တုိ႔ အသီးသီးတက္လာမွာျဖစ္ပါတယ္။ Attack Range 450 ရွိတဲ့ အဆုိပါ Eidolon ေလး တစ္ေကာင္ခ်င္းစီက Physical Attack ၆ ခ်က္ ျပဳလုပ္ျပီးတာနဲ႕ Hp အျပည့္ျပန္ျဖစ္ျပီး ေနာက္ထပ္ကုိယ္ပြား Eidolon မ်ား ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ အဆုိပါ အသစ္ထြက္ေပၚလာတဲ့ Eidolon မ်ားဟာလည္း ပထမ Eidolon ေတြရဲ႕ Duration 35 seconds ရဲ႕ လက္က်န္အခ်ိန္အတုိင္းသာ အသက္ရွင္မွာ ျဖစ္လုိ႔ Eidolon တုိင္းဟာ Duration ျပီးဆုံးခ်ိန္ဟာ အတူတူ ျဖစ္ေနပါလိမ့္မယ္။ High Lvl Neutral Creep ေတြနဲ႕ Ancient Creep ေတြ အေပၚကို Demonic Conversion အသုံးျပဳႏုိင္ျခင္း မရွိသည့္အျပင္ Building Unit ကုိ တုိက္ခုိက္ျခင္းကလည္း Eidolon ပြားေစမယ့္ ၆ ခ်က္ပစ္ကုိ ထည့္သြင္းမေရတြက္ပါဘူး။"
			},
			{
				"spell_name":"Midnight Pulse",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_midnight_pulse_hp1.png",
				"spell_overview":"AoE Nuke Ability တစ္ခုလုိ႔ ေျပာလုိ႔ရတဲ့ Midnight Pulse ကေတာ့ အဆုိပါ AoE ကုိ တက္နင္းထားတဲ့ Enemy ရဲ႕ Max Hp ပမာဏေပၚ မူတည္ျပီး တြက္ခ်က္မယ့္ Pure Damage အမ်ဴိးအစားပဲျဖစ္ပါတယ္။ 3%/3.75%/4.5%/5.25% ဆုိတဲ့ ပမာဏအတုိင္း Enemy Units ေတြရဲ႕ Max Hp နဲ႕တြက္ခ်က္ျပီး ေသြးေလ်ာ့ေစမွာျဖစ္လုိ႔ ေယဘုယ်အားျဖင့္ အေစာပုိင္းတစ္ဆင့္ေလာက္ တင္ထားလည္း လုံေလာက္မွာျဖစ္ပါတယ္။ ဥပမာ - 1000 Hp ရွိတဲ့ Enemy Hero တစ္ေကာင္ဟာ lvl 1 Midnight အေပၚမွာ 4 seconds ခန္႔ တက္နင္းထားတယ္ဆုိပါစုိ႔။ 1 second ကုိ ၄င္း Hp ရဲ႕3% နဲ႕ ညီမွ်တဲ့ 30 Pure Damage ကုိ 4 seconds သက္ေရာက္မွာျဖစ္လုိ႔ 30 x 4 = 120 pure damage ကုိ ခံစားရပါလိမ့္မယ္။ အဆုိပါအေျခအေနကုိ lvl 4 Midnight အျဖစ္ တြက္ခ်က္ၾကည့္တဲ့အခါ 1000 Hp ရဲ႕ 5.25% = 52.5 Pure Damage ဟာ စုစုေပါင္း 4 seconds အတြက္ 210 Pure Damage ကုိ သတ္ေရာက္ေစမွာပါ။ Max Hp ပမာဏေပၚ မူတည္ျပီး တြက္ခ်က္တာျဖစ္လုိ႔ Hp အလြန္နည္းတဲ့ Lane Creep, Jungle Creep တုိ႔အျပင္ အေစာပုိင္း Hp နည္းေသးတဲ့ Hero ေတြ အေပၚ အသုံးျပဳျခင္းက ထိေရာက္မႈ အားနည္းပါတယ္။ ဒါေၾကာင့္ မ်ားမ်ားတင္ေလ Mana Cost တစ္ခုပဲ တက္လာေလျဖစ္တဲ့ Midnight ကုိ ပြဲအေစာပုိင္းမွာ သစ္ပင္ခ်ဴိးဖုိ႔နဲ႕ ဟန္မပ်က္ အသုံးျပဳဖုိ႔အတြက္ တစ္ဆင့္ေလာက္ တင္ထားရင္ လုံေလာက္ပါတယ္။"
			},
			{
				"spell_name":"Black Hole",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_black_hole_hp1.png",
				"spell_overview":"လက္ရွိ Patch v6.88 မွာ Enigma ရဲ႕ Black Hole ကုိ Pure Damage အျဖစ္ေျပာင္းလဲ ေပးလုိက္ျခင္းက ယခင္ကတည္းက Over ျဖစ္ေနတဲ့ AoE Disable Ability ကေန AoE Killing Disable အျဖစ္ ေျပာင္းလဲေပးလုိက္သလုိ ျဖစ္သြားပါတယ္။ 420 AoE ရွိတဲ့ Black Hole အတြင္းမွာ ယူထားတဲ့အဆင့္အလုိက္ 50/ 100/ 150 Pure Damage ကုိ သတ္ေရာက္ေစမွာျဖစ္ျပီး 4 seconds Duration အတြင္းမွာ အဆုိပါ AoE အတြင္းက Units မ်ားအားလုံးကုိ Complete Disable ျဖစ္ေနေစမွာျဖစ္ပါတယ္။ Magic Immune Units ေတြကုိ ဖမ္းထားနုိင္တဲ့ အားသာခ်က္ရွိလုိ႔ Black Hole ဟာ Super Late Game အထိ တန္ဖုိးျဖတ္မရတဲ့ Ability တစ္ခုလည္းျဖစ္ပါတယ္။ Black Hole မိေနတဲ့ Hero ကုိ Force Staff, Geomagnetic Grip စတဲ့ အသုံးျပဳမႈေတြ နဲ႕ အလြယ္တကူ ဖယ္ထုတ္လုိ႔ မရေပမယ့္ Nether Swap, Meat Hook လုိ Ability မ်ားကုိ အသုံးျပဳျပီးေတာ့ ကယ္ထုတ္လုိ႔ရပါတယ္။ Aghanim’s Scepter ကုိ ေရြးခ်ယ္ႏုိင္စြမ္းရွိတဲ့ Ultimate ျဖစ္ျပီး Black Hole ကုိ နဂုိ 50/ 100/ 150 Pure Damage အျပင္ ယူထားတဲ့ Midnight အဆင့္နဲ႕ ညီမွ်တဲ့ Damage ကုိ ပါ ေပါင္းစပ္ေပးသြားမွာျဖစ္ပါတယ္။"
			}
		]
 },
 {
	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/631344273683111",
	"hero_intellgience":"22 + 2.50",
	"hero_agility":"15 + 1.70",
	"hero_strength":"16 + 2.00",
	"hero_damage":"22 - 26",
	"hero_movement_speed":"290",
	"hero_armor":"3.1",
 	"hero_name":"Necrohpos",
 	"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/necrolyte_vert.jpg",
 	"hero_role":"Ranged - Carry - Nuker - Durable - Disabler",
	"hero_detail":"",
 	"hero_overview":"Necrophos ကုိ Offlaner နဲ႕ Mid Laner အျဖစ္ အျမင္ရမ်ားေလ့ရွိျပီး Death Pulse ကုိ ဦးစားေပး တင္ေလ့ရွိတာကို ေတြ႕ရပါတယ္။ တစ္ခါတစ္ရံမွာ Offlaner Necrophos ေတြ အေနနဲ႕ Heartstopper ကုိ ဒုတိယ ဦးစားေပး တင္ေလ့ရွိေပမယ့္ ကစားပြဲအေစာပုိင္းမွာ Sadist ကုိ ဦးစြာတင္ဖုိ႔ အၾကံျပဳခ်င္ပါတယ္။ Sadist ဟာ Last Hit တစ္ခုလုပ္လုိက္တုိင္း HP MP ကုိ Regen ရေစမယ့္ အခ်က္က Necrophos ကုိ အေစာပုိင္းမွာ Mana Regen Item ေတြ ထည့္မစဥ္းစားဖုိ႔ အခြင့္အေရးရေစပါတယ္။ တကယ္လုိ႔ သင္က lvl 9 မွာ Sadist ကုိ Max ျဖစ္ေအာင္ တင္ခဲ့မယ္ဆုိရင္ မိနစ္ ၂ဝ မတုိင္ခင္ Team Fight ေတြမွာ Hero တစ္ေကာင္ Kill ႏုိင္တာနဲ႕ 360 Heal + 720 Mana Restore ဆုိတဲ့ မ်ားျပားေသာ Effective HP, MP ကုိ ရရွိေစမယ့္ အတြက္ျဖစ္ပါတယ္။ Heartstopper ဟာ အလြန္ထိေရာက္တဲ့ Aura တစ္ခုျဖစ္ေပမယ့္ ၄င္းဟာ % Calculation ျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္း Enemy Hero ေတြ ေသြးနည္းေနခ်ိန္မွာလည္း Dps နည္းနည္းပဲ ထိဦးမွာျဖစ္လုိ႔ AFK Jungle ေဆာ့တဲ့ (သုိ႔မဟုတ္) Aggressive Tri Offlane ေဆာ့တဲ့ Necrophos မဟုတ္ရင္ အေစာပုိင္းမွာ မ်ားမ်ား တင္ထားလည္း သိပ္ေတာ့ မထိေရာက္ပါဘူး။ (သုိ႔ေပမယ့္ ရံဖန္ရံခါမွာ Aggressive Mid Laner ေတြနဲ႕ ေဆာ့ရတဲ့အခါမ်ဴိး (ဥပမာ Outworld Devourer, TA) မွာ Heartstopper ကုိ မ်ားမ်ားယူျပီး ထိန္းရတဲ့ အေျခအေနမ်ဴိးရွိပါတယ္။) Sadist ကုိ ေရြးခ်ယ္ထားျခင္းေၾကာင့္ Dagon, Dagger, Force Staff, Blade Mail အစရွိတဲ့ Situational Item ေတြကုိ အေစာပုိင္းကတည္းက ေရြးခ်ယ္ႏုိင္ပါလိမ့္မယ္။Reaper’s Scythe ရဲ႕ အဓိက အားနည္းခ်က္ဟာ 600 သာရွိတဲ့ Cast Range ပဲျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္းမွာ Force Staff, Dagger တစ္ခုခုကို ေရြးခ်ယ္ႏုိင္ျပီး Aether Lens ဟာလည္း Situational Item တစ္ခု ျဖစ္ပါလိမ့္မယ္။ Reaper’s Scythe အသုံးျပဳျပီး 1.5 seconds ၾကာမွ Damage တြက္ခ်က္သက္ေရာက္မွာျဖစ္လုိ႔ Dagon နဲ႕ တြဲဖက္ျပီး အသုံးျပဳတာကေတာ့ အျမင္ရအမ်ားဆုံး ကစားပုံျဖစ္ပါတယ္။ ဒီလုိ Reaper’s Scythe အသုံးျပဳထားတဲ့ 1.5 seconds မွာမွ အဆုိပါ Hero ကုိ Lotus Orb တင္ေပးမယ္ဆုိရင္ Damage ဟာ Necrophos ကုိ ျပန္လည္ သတ္ေရာက္ေစမွာ မဟုတ္ပါဘူး။ (Lotus Orb သုံးထားျပီးသား Unit ေပၚကုိ Reaper’s Scythe သုံးမွသာ ျပန္ထိမွာျဖစ္ပါတယ္။) မိမိ Ally Hero တစ္ေကာင္ေကာင္ကုိ Reaper’s Scythe အသုံးျပဳခံေနရတဲ့အခ်ိန္မွာ Glimmer Cape တင္ေပးျခင္းက အေကာင္းဆုံး Counter ျဖစ္ပါတယ္။ အေၾကာင္းက Glimmer Cape မွာ 45% Magic Resistance ပါဝင္တဲ့အတြက္ Reaper’s Scythe ရဲ႕ Damage Output ကုိ သိသာစြာ ေလွ်ာ့ခ်ေပးမွာျဖစ္ပါတယ္။ မ်ားေသာအားျဖင့္ ကစားပြဲၾကာျမင့္လာေလေလ Necrophos ပါဝင္တဲ့အသင္းက ႏုိင္ဖုိ႔ အခြင့္အေရးရွိေလ ျဖစ္ပါတယ္။ အေၾကာင္းက Aghanim’s Scepter + Refresher Orb ကုိ အသုံးျပဳျပီး Enemy Team က Hero ၂ ေကာင္ေလာက္ကုိ လုံးဝ Buyback ထြက္လုိ႔ မရေအာင္ လုပ္ပစ္ႏုိင္တဲ့ Overpower အေျခအေန တစ္ရပ္ကုိ ပုိင္ဆုိင္ထားတဲ့အတြက္ပဲျဖစ္ပါတယ္။ Item အေနနဲ႕လည္း မ်ားစြာ ေရြးခ်ယ္ႏုိင္ပါတယ္။ ဖိနပ္ျပီးတာနဲ႕ Bloodstone တန္းထည့္တဲ့ Aggressive Durable Style, Blade Mail + Force Staff နဲ႕ Battle လုိက္တဲ့ Aggressive Initiator Style, Dagon + Aghanim’s နဲ႕ Carry Style, Guardian Greaves + Pipe နဲ႕ Support Style စ သျဖင့္ မရုိးႏုိင္ေသာ Play Style ေပါင္းမ်ားစြာ၊ ေရြးခ်ယ္စရာ Item ေပါင္းမ်ားစြာနဲ႕ ျပီးျပည့္စုံတဲ့ Flexible Intelligence Hero တစ္ေကာင္ပဲ ျဖစ္ပါေတာ့တယ္။ဒီလုိ အေၾကာင္းျပခ်က္ေပါင္း မ်ားစြာေၾကာင့္ပဲ Rotund’Jere The Necrophos ဟာ Pub Stomper တစ္ေကာင္အျဖစ္ အခ်ိန္ၾကာျမင့္စြာ ရပ္တည္ေနႏုိင္တဲ့ Hero တစ္ေကာင္ဆုိတာ ျငင္းလုိ႔မရပါဘူး။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
 	"hero_spell":[
 		{
 			"spell_name":"Death Pulse",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_death_pulse_hp1.png",
 			"spell_overview":"Necrophos releases a wave of death around him, dealing damage to enemy units and healing allied units."
 		},
 		{
 			"spell_name":"Heartstopper Aura",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_heartstopper_aura_hp1.png",
 			"spell_overview":"Necrophos stills the hearts of his opponents, causing nearby enemy units to lose a percentage of their max health over time."
 		},
 		{
 			"spell_name":"Sadist",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_sadist_hp1.png",
 			"spell_overview":"Necrophos gains health and mana regeneration for every unit he kills. Hero kills grant 10 times the regen bonus."
 		},
 		{
 			"spell_name":"Reaper's Scythe",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_reapers_scythe_hp1.png",
 			"spell_overview":"Stuns the target enemy hero, then deals damage based on how much life it is missing. Heroes killed by Reaper's Scythe will have 10 seconds added to their respawn timer. Any kill under this effect is credited to Necrophos. Upgradable by Aghanim's Scepter."
 		}
 	]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/604433353040870",
		"hero_intellgience":"23 + 2.70",
		"hero_agility":"18 + 2.20",
		"hero_strength":"17 + 1.90",
		"hero_damage":"27 - 31",
		"hero_movement_speed":"295",
		"hero_armor":"2.52",
		"hero_name":"Shadow Demon",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/shadow_demon_vert.jpg",
		"hero_role":"Ranged - Support - Disabler - Initiator - Nuker",
		"hero_detail":"လက္ရွိ Meta မွာ Pub Match ေတြမွာ အဆုိးရြားဆုံး ဒုကၡေပးေနတဲ့ Hero တစ္ေကာင္လုိ႔ ေျပာလုိက္ရင္ Spectre ကုိ ဦးစြာ ေျပးျမင္မိမွာ ေသခ်ာပါတယ္။ အျခား Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Outworld Devourer ဟာလည္း Overpower ျဖစ္ေနတယ္ဆုိေပမယ့္ Pub Match ေတြမွာေတာ့ Spectre ေလာက္ ဆုိးဆုိးရြားရြား Pub Stomper တစ္ေကာင္မျဖစ္ေသးပါဘူး။ ဒါေၾကာင့္ Spectre ကုိ Counter လုပ္တဲ့အခါမွာ မ်ားေသာအားျဖင့္ Slow Ability Caster ေတြဟာ အသုံးဝင္ေလ့ရွိျပီး Spectre ရဲ႕ Passive ေတြကုိပါ ရပ္တန္႔ေစမယ့္ Support Hero တစ္ေကာင္ကေတာ့ The Shadow Demon ပဲ ျဖစ္ပါတယ္။ Shadow Demon ဟာ Dota 2 Hero ေပါင္း ၁၁၁ ေကာင္မွာ ေပၚျပဴလာျဖစ္မႈ နံပါတ္စဥ္ ၁ဝ၇ သာ ခ်ိတ္တာကို ေတြ႕ရပါလိမ့္မယ္။ Pubber အမ်ားစုဟာ ရုိးရွင္းတဲ့ Disable, ရုိးရွင္းတဲ့ Nuke, ရုိးရွင္းတဲ့ Carry ေတြကုိ အၾကဳိက္မ်ားေလ့ရွိတဲ့အတြက္ Shadow Demon လုိမ်ဴိး Pure Support Hero တစ္ေကာင္ဟာ လူၾကဳိက္သိပ္မမ်ားဘူးဆုိေပမယ့္ Early Game နဲ႕ Mid Game မွာ Strong ျဖစ္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလုိ႔ မရပါဘူး။ တကယ္လုိ႔ သင္ဟာ Support Player တစ္ေယာက္ ဒါမွမဟုတ္ Mid Player တစ္ေယာက္ျဖစ္ေနခဲ့မယ္ဆုိရင္ေတာ့ Shadow Demon ကုိ သင္ေရြးခ်ယ္ရမယ့္ Hero List ထဲမွာ ထည့္သြင္းစဥ္းစားဖုိ႔ အၾကံျပဳလုိပါတယ္။\nItem Build\nShadow Demon ဟာ ရုတ္တရက္ၾကည့္ရင္ Mana Cost အေျမာက္အမ်ားလုိတယ္လုိ႔ ထင္ရေပမယ့္ သင့္ေတာ္တဲ့ Mana Regeneration သာ ရွိမယ္ဆုိရင္ သူ႔ရဲ႕ Ability ေတြဟာ Battle တစ္ခုအတြက္ လံုေလာက္တဲ့ ပမာဏကုိ ပုိင္ဆုိင္ျပီးသားျဖစ္ပါတယ္။ ဒါေၾကာင့္ ဖိနပ္အတြက္ Tranquil Boots ကုိ ေရြးခ်ယ္ျခင္းက ပုိမုိ အသုံးတည့္ေစျပီး ဒုတိယ Item အျဖစ္ Aether Lens ကုိ အၾကံျပဳခ်င္ပါတယ္။ Urn နဲ႕ Force staff ကေတာ့ Support Hero တစ္ေကာင္အတြက္ Escape နဲ႕ Save အတြက္ အသုံးျပဳဖုိ႔ အေထာက္အကူ ျပဳေစတာကိုပါလိမ့္မယ္။ Dagger, Rod of Atos, Eul Scepter, Mekansm, Pipe, Necronomicon တုိ႔ကေတာ့ ပြဲအေျခအေနေပၚမူတည္၍ ေရြးခ်ယ္ႏုိင္ျပီး Aghanim's ကေတာ့ Late Game Counter အတြက္ လြန္စြာ အေရးၾကီးတဲ့ Item တစ္ခုအျဖစ္ စဥ္းစားႏုိင္ပါတယ္။",
		"hero_overview":"Shadow Demon ရဲ႕ Shadow Poison ကေတာ့ မ်ားျပားတဲ့ Damage ပမာဏကုိ ေပးမယ့္ Nuke Ability ဆုိတာ ေဖာ္ျပျပီးျဖစ္ပါတယ္။ ဒါေၾကာင့္ တစ္ဖက္အသင္းမွာ မိမိအသင္းကုိ ဒုကၡေပးမယ့္ Mid Laner တစ္ေကာင္ေကာင္ (DP, OD, Zeus, etc... ) လာမယ္ဆုိရင္ Shadow Demon ရဲ႕ Long Range Shadow Poison နဲ႕ Counter ျပန္ေထာက္ျပီး Mid Lane ပုံစံနဲ႕ ျပန္ထိန္းႏုိင္ပါတယ္။ ဒါအျပင္ Mid Lane Hero နဲ႕ ေဆာ့တဲ့အခါမွာ Neutral Creep Camp Stack တစ္ခုကုိ စားဖုိ႔ 12.5 Seconds ၾကာျမင့္တဲ့ Shadow Poison 5 Stacks ျဖင့္ အလြယ္တကူ Creep စားႏုိင္ဦးမွာျဖစ္ပါတယ္။ Disruption ရဲ႕ ထူးျခားခ်က္ကေတာ့ Illusion Unit ေတြအေပၚမွာ အသုံးျပဳႏုိင္ျခင္းပဲျဖစ္ပါတယ္။ ျဖစ္ေပၚလာတဲ့ Illusion ၂ ေကာင္ရဲ႕ Damage Output ဟာ Illsion Unit ေပၚတြက္ခ်က္ျခင္းမဟုတ္ဘဲ ပုိင္ရွင္ Hero အစစ္ရဲ႕ Damage ပမာဏအတုိင္း တြက္ခ်က္တာျဖစ္လုိ႔ Spectre ရဲ႕ Ultimate Haunt Illusion လိုမ်ဴိး Illusion ေပၚကုိ အသုံးျပဳေပးတာနဲ႕ မူလ Spectre ရဲ႕ 60% Damage Output ၂ ေကာင္ကို ရရွိေစမွာျဖစ္ပါတယ္။ ဒါ့အျပင္ မိမိအသင္းက Hard Carry ကုိ အသုံးျပဳေပးရင္လည္း Manta Style ထက္ ၇.၅ ဆ ပုိေကာင္းတဲ့ Illusion Unit ႏွစ္ခု ကုိ ရရွိေစမယ့္ အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။Shadow Demon ဟာ Early Game နဲ႕ Aghanim's ထြက္ျပီး Late Game မွာ မ်ားစြာ အသုံးဝင္ပါတယ္။ Damage တစ္ခုကုိ တုိက္ရုိက္မထိဘဲ သြယ္ဝုိက္ကာ အခ်ိန္အတုိင္းအတာ တစ္ခုထိ ေစာင့္ေပးရတဲ့ အားနည္းခ်က္ေၾကာင့္ လူၾကဳိက္နည္းေနရတာ ျဖစ္ေပမယ့္ တကယ္တမ္း အသုံးဝင္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလို႔ မရပါဘူး။ Shadow Demon ရဲ႕ အသုံးဝင္မႈဟာ သူ႔ကို ကုိင္တြယ္ကစားမယ့္ ကစားသမားရဲ႕ ပါးနပ္မႈေပၚကုိ မ်ားစြာ မူတည္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Disruption",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_disruption_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ ဒီ Single Target Ability ဟာ မည္သည့္ Hero Unit ကုိေပၚမဆုိ အသုံးျပဳႏုိင္ျပီး အဆုိပါ Hero ကုိ 2.5 Seconds ခန္႔ ေျမပုံေပၚက ေပ်ာက္သြားေစမွာျဖစ္ပါတယ္။ 2.5 seconds ျပည့္သြားတဲ့အခါမွာေတာ့ အဆုိပါ Hero ဟာ သူ႔ရဲ႕ ပုံစံတူ Hero ၂ ေကာင္နဲ႕ အတူ ျပန္လည္ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ အဆုိပါ Illusion Unit ၂ ခုဟာ Shadow Demon ရဲ႕ ထိန္းခ်ဴပ္မႈေအာက္မွာရွိမွာျဖစ္ျပီး Illusion တစ္ေကာင္ခ်င္းစီဟာ အဆုိပါ Hero ရဲ႕ 30%/ 40%/ 50%/ 60% Damage Output ရွိမွာျဖစ္ျပီး 150% Incoming Damage ရွိမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Illusion Unit ၂ ခုေပါင္းရဲ႕ စုစုေပါင္း Damage ဟာ 120% ရွိလုိ႔ မူလ Hero ထက္ ပုိမ်ားတဲ့ Damage ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ (Late Game မွာ Strong ျဖစ္ေနတဲ့ Enemy Hero တစ္ေကာင္ကုိ အသုံးျပဳေပးျခင္းက အဆုိပါ Hero ထက္ 20% ပုိၾကမ္းေသာ Illusion Unit ၂ခု ကုိ မိမိဘက္မွ ျပန္လည္ ကူညီ တုိက္ခုိက္ေပးေစမယ့္ သေဘာျဖစ္ပါတယ္။ ) မိမိအသင္းဘက္မွ Position လုိအပ္တဲ့ Ability မ်ားျဖစ္တဲ့ Sacred Arrow, Requiem of Souls, Sun Strike, Earth Split, Smoke Screen, စတဲ့ Ability ေတြကုိ တိက်စြာ သက္ေရာက္ေစဖုိ႔ အေထာက္အကူျပဳတဲ့အျပင္ Enemy Team မွာ တုိက္ခုိက္လာမယ့္ Ability မ်ားျဖစ္တဲ့ Duel, Fiend Grip, Mystic Flare, Trick of the Trade, Reaper Scythe စတဲ့ Ultimate မ်ားကို ကာကြယ္ေပးႏုိင္တဲ့အျပင္ Long Range Spell မ်ား ရန္ကလည္း ကာကြယ္ေပးႏုိင္ပါလိမ့္မယ္။ အေရးအၾကီးဆုံးအခ်က္ကေတာ့ အခ်ိန္ကုိက္ အသုံးျပဳဖုိ႔အတြက္ Cast Time 0.3 Second နဲ႕ Cast Range 500 ကုိ တိတိက်က်သိထားဖုိ႔ လုိအပ္ပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Soul Catcher",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_soul_catcher_hp1.png",
				"spell_overview":"တကယ္လုိ႔ သင္က Support Shadow Demon ျဖစ္ေနမယ္ဆုိရင္ ဒီ Ability ကုိ Lvl 7 မွာ ဂိတ္ဆုံးယူဖုိ႔ အၾကံျပဳလုိပါတယ္။ Catch မိသြားတဲ့ Unit အေပၚကုိ က်ေရာက္လာသမွ် Damage (Physical, Magical, Pure) တုိင္းကုိ 20%/ 30%/ 40%/ 50% တုိးေစမွာျဖစ္ပါတယ္။ ဥပမာ - Lvl 7 အေရာက္မွာ Soul Catcher မိသြားတဲ့ Unit ကုိ မိမိအသင္းသား Lion က Ultimate Finger of Death နဲ႕ တိုက္ခုိက္တဲ့အခါ ပုံမွန္ Damage 600 အစား 600 + 50% = 900 Damage ကုိ ထိေစမွာျဖစ္ပါတယ္။ အေစာပုိင္းမွာ Hero တစ္ေကာင္ကို Ganking လုပ္ရာမွာ မ်ားစြာ Overpower ျဖစ္ေနတဲ့ Ability လုိ႔ ေျပာလုိ႔ရပါတယ္။ ဒါေပမယ့္ ဒီေလာက္ ေကာင္းတဲ့ Amplified Ability တစ္ခုအေနနဲ႕ အားနည္းခ်က္ကေတာ့ ၾကီးမားတဲ့ 500 AoE အတြင္းက Random Unit တစ္ခုကိုသာ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ အသုံးျပဳတဲ့အခါမွာ AoE အတြင္းမွာ အျခား Unit ေတြ မရွိေစဘဲ မိမိ Target ထားလုိတဲ့ Hero တစ္ေကာင္တည္း ရွိေအာင္ သုံးေပးရပါမယ္။ (ဥပမာ - မိမိတုိက္ခုိက္လုိတဲ့ Enemy ကုိ Disruption နဲ႕ ဖမ္းထားျပီး Soul Catcher ရဲ႕ AoE တစ္ခုလုံးကုိ Unit မရွိတဲ့ ေတာအုပ္ဘက္ကုိထားျပီး AoE ရဲ႕ အစြန္းတစ္ဘက္နဲ႕ အဖ်ားခက္ရုံေလးသာ အသုံးျပဳေပးမယ္ဆုိရင္ ထိဖုိ႔ေသခ်ာသေလာက္ရွိပါတယ္။)"
			},
			{
				"spell_name":"Shadow Poison",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_shadow_poison_hp1.png",
				"spell_overview":"တကယ္လုိ႔ သင္က Mid Lane Shadow Demon အေနနဲ႕ေဆာ့မယ္ဆုိရင္ေတာ့ Shadow Poison ကုိ Lvl 7 မွာ ဂိတ္ဆုံးယူေပးသင့္ပါတယ္။ Shadow Poison ဟာ Distance 1500 Range အထိသြားႏုိင္တဲ့ AoE 190 ရွိေသာ Stack Nuke Ability ျဖစ္ပါတယ္။ တြက္ခ်က္ပုံကေတာ့ Stack တစ္ခု၊ တစ္ခုစီ တုိးသြားတဲ့အခါတုိင္းမွာ မိမိယူထားတဲ့အဆင့္ရဲ႕ Stack Damage ကုိ 1/ 2/ 4/ 8/ 16 ဆုိတဲ့ ေျမွာက္လဒ္အတုိင္း ေျမွာက္ျပီး ထိမွာျဖစ္ပါတယ္။ ေျမွာက္လဒ္မွာ ေဖာ္ျပထားတဲ့အတုိင္း 5 stack မွာ Damage ပမာဏအမ်ားဆုံး သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ ေနာက္ဆုံးအဆင့္ကုိ ဥပမာထားျပီး တြက္ခ်က္ၾကည့္ရရင္ Stack Damage ပမာဏဟာ 65 Damage ရွိပါလိမ့္မယ္။ သင္က Enemy Hero ကုိ 4 Stacks ရေအာင္ တင္ထားျပီးျပီဆုိရင္ ၄ဆင့္ရဲ႕ ေျမွာက္လဒ္ဟာ ၈ ျဖစ္ပါတယ္။ (1/ 2/ 4/ 8/ 16)။ 65 x 8 = 520 Damage သက္ေရာက္ပါလိမ့္မယ္။ တကယ္လုိ႔ သင္က ေနာက္ထပ္ 2.5 seconds ေစာင့္ျပီး ၅ ခုေျမာက္ Stack ကို တင္လုိက္ရင္ ေျမွာက္လဒ္ တန္ဖုိးက 8 မဟုတ္ေတာ့ဘဲ 16 ျဖစ္သြားပါလိမ့္မယ္။ ဒါေၾကာင့္ 65 x 16 = 1040 Damage ေတာင္ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ 5 stack ထက္ပုိသြားသမွ်ကေတာ့ ထပ္မေျမွာက္ေတာ့ဘဲ 50 Damage ဆီသာ တုိးသြားေတာ့မွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ 5 Stacks မွာ အသုံးျပဳရင္ အေကာင္းဆုံးျဖစ္ပါတယ္။ Enemy Hero ရဲ႕ ဦးေခါင္းေပၚမွာ Stack ပမာဏ ဘယ္ေလာက္ေရာက္ေနျပီလဲဆုိတာ အထင္အရွား သိႏုိင္ပါတယ္။ Cooldown 2.5 Seconds နဲ႕ Mana Cost 40 သာ ကုန္က်မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Demonic Purge",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_demonic_purge_hp1.png",
				"spell_overview":"Single Target Ability ျဖစ္တဲ့ Ultimate ကေတာ့ ရုိးရွင္းတဲ့ Slow Ability တစ္ခုပဲျဖစ္ပါတယ္။ အတင္ခံရတဲ့ Enemy မွာ ရွိသမွ် Normal Positive Buff ေတြ အကုန္လုံးကုိ ဖ်က္စီးေပးမွာျဖစ္ျပီး ၅ စကၠန္႔ၾကာျမင့္တဲ့ MS Slow ကုိ သက္ေရာက္ေစပါမယ္။ သတ္ေရာက္မယ့္ Damage ကေတာ့ Duration 5 Seconds အျပီးမွ ျဖစ္ေပၚလာပါလိမ့္မယ္။ ပုံေသ Cooldown 50 Seconds ရွိေပမယ့္ ပုိယူခဲ့မယ္ဆုိရင္ Slow Calculation က တုိးလာမွာျဖစ္ပါတယ္။ ပထမတစ္ဆင့္မွာ MS Slow ဟာ Second အလုိက္ 100%/80%/60%/40%/20% ဆုိျပီး ျပန္လည္ တက္သြားမွာျဖစ္ေပမယ့္ ေနာက္ဆုံးအဆင့္မွာေတာ့ ပထမ စကၠန္႔မွာ 100% MS Slow ျဖစ္ေစျပီး က်န္တဲ့ ေလးစကၠန္႔စလုံးမွာ 50% MS Slow ျဖစ္ေနမွာျဖစ္ပါတယ္။ Aghanim's Scepter သာ ဆက္လုိက္မယ္ဆုိရင္ Charge ပုံစံ ေျပာင္းသြားမွာျဖစ္ပါတယ္။ Charge Cooldown 40 Seconds နဲ႕ စုစုေပါင္း ၃ ခါ သုံးလုိ႔ ရတဲ့ Charge ပုံစံ ျဖစ္သြားမယ့္အျပင္ Break Debuff ကုိပါ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ Break ဆုိတာကေတာ့ အသုံးခံရတဲ့ Enemy မွာ ရွိသမွ် Passive Ability ေတြအားလုံးကုိ ရပ္တန္႔သြားေစမယ့္ Debuff ျဖစ္ပါတယ္။ လက္ရွိ Pub Stomper ျဖစ္တဲ့ Spectre ရဲ႕ Desolate နဲ႕ Dispersion လုိ Passive မ်ဴိး၊ Blur နဲ႕ Coup De Grace ကုိ ပုိင္ဆုိင္ထားတဲ့ Phantom Assasin လုိမ်ဴိး Hero ေတြကုိ Counter လုပ္ဖုိ႔ အသင့္ေတာ္ဆုံး Item ေရြးခ်ယ္မႈဟာ Aghanim's Scepter ကေန ရရွိပါလိမ့္မယ္။ Spell Immune Unit ေတြအေပၚမွာ အသုံးျပဳလုိ႔ရတဲ့ Demonic Purge ဟာ Enemy Team ရဲ႕ Couier ကုိ Target ထားျပီး အသုံးျပဳဖုိ႔ လြန္စြာမွ သင့္ေတာ္တဲ့ Ultimate တစ္ခုျဖစ္ပါတယ္။"
			}
		]
 },
 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/652719051545633",
		"hero_intellgience":"24 + 2.70",
		"hero_agility":"10 + 1.00",
		"hero_strength":"22 + 2.50",
		"hero_damage":"22 - 32",
		"hero_movement_speed":"295",
		"hero_armor":"2.4",
		"hero_name":"Warlock",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/warlock_vert.jpg",
		"hero_role":"Ranged - Support - Initiator - Disabler",
		"hero_detail":"Summon Unit ေတြအေပၚကုိ 99999 Damage သတ္ေရာက္တဲ့ Diffusal Blade ရဲ႕ Target Ability ကုိလည္း ဖယ္ရွားေပးလုိက္တဲ့ v6.85 Patch ေနာက္မွာေတာ့ Premium တန္းမွာ ေတြ႕ရခဲတဲ့ Warlock ရဲ႕ အစြမ္းအစဟာ ျပန္လည္ ျမင့္တက္လာခဲ့ပါတယ္။ Pub Tier မွာ Win Rate အေကာင္းဆုံး ထိပ္တန္း Hero ေတြထဲမွာ ပါဝင္ေသာ Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Warlock ဟာ ကစားပြဲအေစာပုိင္းကေန ပြဲေနာက္ပုိင္းအထိ အသုံးတည့္တဲ့ Hero အမ်ဴိးအစားထဲမွာလည္း ပါဝင္ပါတယ္။ ဒါ့အျပင္ Team နဲ႕ ေဆာ့တဲ့အခါမွာ Click တစ္ခ်က္တည္း ႏွိပ္ေပးရုံနဲ႕ မ်ားစြာေသာ Damage Output မ်ားျဖစ္ေပၚေစမယ့္ Ability, Healing, AoE Slow နဲ႕ AoE Disable Teamfight Summon Unit တုိ႔နဲ႕ ဖြဲ႕စည္းထားေသာ ရုိးရွင္းတဲ့ Intelligence Hero တစ္ေကာင္ျဖစ္ပါတယ္။",
		"hero_overview":"Fatal Bonds ဟာ လြန္စြာမွာ Overpower ျဖစ္ေနတဲ့ Support Ability တစ္ခုျဖစ္ပါတယ္။ F ခလုတ္တစ္ခ်က္ ႏွိပ္ရုံနဲ႕ အလြန္မ်ားျပားတဲ့ Damage Sharing ေတြ ျဖစ္ေပၚေစမယ့္ Ability ျဖစ္လုိ႔ ကစားပြဲေနာက္ပုိင္းအထိ ဒုကၡေပးမယ့္ Ability တစ္ခုျဖစ္ပါတယ္။ အၾကံျပဳခ်င္တာကေတာ့ Warlock ဟာ Solo Offlane ေဆာ့ဖုိ႔ အေကာင္းဆုံး Hero တစ္ေကာင္ျဖစ္ပါတယ္။ Shadow Word ဟာ ၂ ဆင့္ယူထားတဲ့အခ်ိန္မွာ 300 Hp ကုိ Heal ေစမွာျဖစ္လုိ႔ Attack Range 600 ရွိတဲ့ Hero တစ္ေကာင္အေနနဲ႕ Offlane မွာ အလြယ္တကူ အသက္ရွင္သန္ႏုိင္ပါတယ္။ ဒါေၾကာင့္ Shadow Word ကုိ ၂ ဆင့္ပဲယူျပီး Lvl 7 မွာ Upheaval ကုိ ဂိတ္ဆုံးယူျပီး ေဆာ့ၾကည့္ဖုိ႔ အၾကံျပဳခ်င္ပါတယ္။ Upheaval ကုိ လြန္ဆန္ႏုိင္တဲ့ Ability ဟာ Blink Ability မ်ားနဲ႕ အေပၚမွာေဖာ္ျပခဲ့တဲ့ Ability ၃ ခုသာ ရွိတဲ့အတြက္ lvl 7 မွာ အဆုံးထိ ယူထားမယ္ဆုိရင္ Team Fight တစ္ခုဟာ သိသိသာသာ အားသာခ်က္ ရွိတာကုိ ေတြ႕ရပါတယ္။ မိမိကသာ ဒီ Channeling ကုိ အလြယ္တကူ အဖ်က္မခံရမယ့္ ေနရာကေန အသုံးျပဳတတ္ဖုိ႔ အေလ့အက်င့္ေလး ရွိဖုိ႔သာ လုိပါတယ္။ ဒါေၾကာင့္ Overpower ျဖစ္ေနတဲ့ Fatal Bonds ကုိေတာ့ ပြဲေနာက္ပုိင္းမွာ သုံးဖုိ႔အတြက္ စိတ္ခ်လက္ခ် တင္ႏုိင္ပါတယ္။\nတကယ္လုိ႔ သင္က ကုိယ္တုိင္ တုိက္ခုိက္မယ့္ Mid Laner, Safe Laner Warlock ျဖစ္ခဲ့မယ္ဆုိရင္ေတာ့ Hand of Midas နဲ႕ Fatal Bonds ကုိ ဦးစြာ တင္သင့္ပါတယ္။ ဘယ္ပုံစံနဲ႕ ေဆာ့ေဆာ့ Shadow Word ကုိ ၂ ဆင့္ပဲ ယူတာ လုံေလာက္တယ္ဆုိတဲ့ အခ်က္ကုိေတာ့ ေမ့မထားသင့္ပါဘူး။ ဦးစြာ Boots of Speed ကုိ ရွာေဖြျပီးေနာက္ Aghanim’s Scepter, Refresher Orb, Arcane Boots ဆုိတဲ့ အစဥ္လုိက္အတုိင္း ေရြးခ်ယ္သြားသင့္ျပီး ပြဲအေျခအေနေပၚလုိက္၍ Aether Lens, Blink Dagger, Octarine Core, Shiva Guard စတဲ့ Item မ်ားကုိလည္း အစဥ္လုိက္ ေရြးခ်ယ္သြားသင့္ပါတယ္။ (Warlock ဟာ စာေရးသူရဲ႕ Stats မွာ Rating အေကာင္းဆုံး နံပါတ္ ၁ Hero ျဖစ္လုိ႔ မိမိကစားကြက္ကုိ အၾကံျပဳရျခင္းျဖစ္ပါတယ္။) အဓိကကေတာ့ Warlock ဟာ Lvl လုိအပ္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ Solo Offlane, Solo Mid Lane သာ အေကာင္းဆုံး ဆုိေပမယ့္ ပြဲအေျခအေနေပၚလုိက္ျပီး ေရြးခ်ယ္စရာ ကစားကြက္အစုံအလင္ ရွိတဲ့ Hero တစ္ေကာင္ျဖစ္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Fatal Bonds",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_fatal_bonds_hp1.png",
				"spell_overview":"Cast Range 1000 ရွိတဲ့ Single Target Ability ျဖစ္ျပီး အသုံးျပဳခံရတဲ့ Unit ရဲ႕ 700 AoE အတြင္းက အနီးစပ္ဆုံး Unit ၆ ခုကုိ 25 seconds ၾကာျမင့္တဲ့ Fatal Bonds Debuff ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ အဆုိပါ Debuff သတ္ေရာက္ခံထားရတဲ့ Unit တစ္ခုစီတုိင္းေပၚကုိ Physical, Magical, Pure Damage တစ္မ်ဴိးမ်ဴိး သတ္ေရာက္တုိင္း Fatal Bonds အတူတကြ သတ္ေရာက္ခံထားရတဲ့ အျခား Unit ၅ ခုစလုံးကုိ 25% ေသာ Damage ေတြ မွ်ေဝျပီး သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဥပမာ - Enemy Hero ၂ ေကာင္နဲ႕ Creep Unit ၄ ခုကုိ Fatal Bonds သတ္ေရာက္သြားျပီ ဆုိပါစုိ႔။ သတ္ေရာက္ထားတဲ့ Creep ေတြထဲက တစ္ေကာင္ကုိ Lion ရဲ႕ Finger of Death lvl 3 (850 Magical Damage) ျဖင့္ တုိက္ခုိက္မယ္ဆုိရင္ 850 ရဲ႕ 25% ျဖစ္တဲ့ 213 Magical Damage ဟာ အျခား Creep ၃ ေကာင္နဲ႕ Hero ၂ ေကာင္ကုိပါ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ထူးျခားခ်က္ကေတာ့ အခုလုိ ျပန္လည္ေဝမွ်ျပီး ထိမယ့္ Damage ဟာ Physical ဆုိ Physical, Magical ဆုိ Magical, Pure ဆုိ Pure ဆုိတဲ့အတုိင္း Source Damage အတုိင္း ထိေရာက္မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Shadow Word",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_shadow_word_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ Healing Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Unit ဟာ Ally Unit ျဖစ္မယ္ဆုိရင္ တစ္စကၠန္႔ကုိ 15/ 25/ 35/ 45 Hp ႏႈန္းနဲ႕ 12 seconds ၾကာျမင့္တဲ့ Healing ကုိ ရရွိေစမွာျဖစ္ျပီး Enemy ဆုိရင္ေတာ့ 15/ 25/ 35/ 45 Damage Per Seconds ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ပုံေသ Cooldown 16 seconds ရွိပါတယ္။"
			},
			{
				"spell_name":"Upheaval",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_upheaval_hp1.png",
				"spell_overview":"Cast Range 1200, AoE 650 ရွိတဲ့ Upheaval ကေတာ့ AoE MS Slow Ability တစ္ခုျဖစ္ပါတယ္။ Channeling Ability တစ္ခုျဖစ္ျပီး Warlock အသုံးျပဳထားတာၾကာျမင့္ေလေလ Slow Rate က တုိးေလေလျဖစ္လာမွာျဖစ္ပါတယ္။ 1 second ကုိ 7%/ 14%/ 21%/ 28% ႏႈန္းနဲ႕ MS Slow Rate က တက္လာမွာျဖစ္ျပီး အမ်ားဆုံး 84% Slow Rate အထိ ေရာက္ႏုိင္ေခ်ရွိပါတယ္။ ဒါေၾကာင့္ ေနာက္ဆုံးအဆင့္မွာေတာ့ Warlock အသုံးျပဳျပီးျပီးခ်င္း 3.5 seconds အၾကာမွာ 84% MS Slow ကုိ ေရာက္ရွိသြားမွာျဖစ္ပါတယ္။ Max Movement Speed ကုိေပးတဲ့ Ability မ်ားျဖစ္ေသာ Shukuchi, Surge, Stampede တုိ႔ကုိေတာ့ Slow ႏုိင္စြမ္း မရွိပါဘူး။"
			},
			{
				"spell_name":"Chaotic Offering",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_rain_of_chaos_hp1.png",
				"spell_overview":"Warlock ရဲ႕ Signature Ability ျဖစ္တဲ့ Ultimate Chaotic Offering ကေတာ့ Warlock ဟာ Teamfight အတြက္ Powerful Golem တစ္ေကာင္ကို ဆင့္ေခၚလုိက္မွာျဖစ္ပါတယ္။ အထိေရာက္ဆုံး အားသာခ်က္တစ္ခုကေတာ့ အသုံးျပဳလုိက္တဲ့ 600 AoE အတြင္းက Enemy Unit ေတြအားလုံးကုိ Magic Immune Piercing 1 second Stun ကုိ သတ္ေရာက္ေစမယ့္ အခ်က္ပဲျဖစ္ပါတယ္။ Golem ဟာ 33% Magic Resistance, 6/ 9/ 12 Armor နဲ႕ 75/ 100/ 125 Damage ရွိျပီး Flaming Fist နဲ႕ Permanent Immolation ဆုိတဲ့ Ability ၂ ခုလည္း ပါဝင္ပါေသးတယ္။ Flaming Fist ကေတာ့ 40% Chance ရွိေသာ 80/ 115/ 150 Pure Damage ကုိ အတုိက္ခုိက္ခံရေသာ Unit အပါအဝင္ 300 AoE အတြင္းက Enemy Unit အားလုံးကုိ သတ္ေရာက္ေစမယ့္ Ability ျဖစ္ျပီး Permanent Immolation ကေတာ့ Radiance ကဲ့သုိ႔ Golem ရဲ႕ 300 AoE အတြင္းမွာ 30/ 40/ 50 Magical Damage မ်ား ေလာင္ကြ်မ္းေနေစမယ့္ Ability တုိ႔ျဖစ္ပါတယ္။ Aghanim’s Scepter ဆက္ခြင့္ရွိျပီး Golem ၂ ေကာင္ျဖစ္သြားေစမွာျဖစ္သလုိ Golem တစ္ေကာင္စီဟာ Gold Bounty တစ္ဝက္ဆီ ခြဲေဝသြားမွာျဖစ္ျပီး Physical Damage ကုိေတာ့ 75% စီ (56/ 75/ 94) ခြဲသြားမွာျဖစ္ပါတယ္။"
			}
		]
 }
]