[
 {
	 	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/647760752041463",
		"hero_intellgience":"20 + 3.40",
	 	"hero_agility":"14 + 1.00",
	 	"hero_strength":"17 + 2.10",
	 	"hero_damage":"22 - 28",
	 	"hero_movement_speed":"300",
	 	"hero_armor":"3.96",
		"hero_name":"ENIGMA",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/enigma_vert.jpg",
		"hero_role":"Ranged - Disabler - Jungler - Initiator - Pusher",
		"hero_detail":"Dota ဟာ သူမတူတဲ႕ Role ေပါင္းမ်ားစြာရွိေသာ Hero မ်ားနဲ႕ ဖြဲ႕စည္းထားသည့္ MOBA (Massive Online Battle Arena) Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ ကစားပြဲတစ္ပြဲမွာ ပါဝင္လာမယ့္ Hero ေတြရဲ႕ အသုံး ဝင္ပုံဟာလည္း မ်ဴိးစုံကြဲျပားလ်က္ရွိပါတယ္။ Battle ကုိ ဦးစားေပး ကစားရတဲ့ Strategy Game တစ္ခုျဖစ္သည့္အေလွ်ာက္ Team Fight ေတြဟာ Dota ရဲ႕ အသက္ပဲ ျဖစ္ပါတယ္။ ဒီလုိ Team Fight တစ္ခုကေန ကစားပြဲတစ္ခုလုံးရဲ႕ ရလာဒ္ကုိ ေျပာင္းလဲသြားေစႏုိင္တဲ့ Ganker, Initiator အခ်ဴိ႕ရွိျပီး ၄င္းတုိ႔ထဲမွာမွ Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Enigma ကေတာ့ Dota တစ္ခုလုံးရဲ႕ Strongest AoE Disable တစ္ခုကုိ ပုိင္ဆုိင္ထားတဲ့ Initiator Hero တစ္ေကာင္ပဲျဖစ္ပါတယ္။ Disable, Jungle, Push, Nuke စေသာ Ability ေကာင္းမ်ားစြာကုိ ပုိင္ဆုိင္ထားတဲ့ Enigma ရဲ႕ Black Hole တစ္လုံးဟာ ကစားပြဲတစ္ခုရဲ႕ အေျပာင္းအလဲကုိ မ်ားစြာ ျဖစ္သြားေစႏုိင္တဲ့အခ်က္က ျငင္းလုိ႔ မရတဲ့အတြက္ မိမိရဲ႕ Black Hole တစ္ခုစီတုိင္းကုိ အက်ဴိးရွိေစဖုိ႔ ပြဲစကတည္းက မိမိ BH ကုိ ဖ်က္ႏုိင္မယ့္ Disable ေတြကုိ ၾကဳိတင္ မွတ္သားထားျပီး Black Hole သုံးခါနီးတုိင္း မိမိကုိ ဖ်က္မယ့္ Disable ဘယ္ႏွစ္ခုကုန္သြားျပီလဲဆုိတာကုိ Overview ၾကည့္ႏုိင္ျပီး စိတ္ရွည္ဖုိ႔ အဓိက လုိအပ္ပါလိမ့္မယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
		"hero_overview":"Enigma ဟာ Demonic Conversion ေၾကာင့္ Jungler ေတြထဲမွာ အားသာခ်က္ အရွိဆုံးနဲ႕ အလြယ္ဆုံး Jungle Farm ႏုိင္တဲ့ Hero တစ္ေကာင္ျဖစ္ေနပါတယ္။ 170 Mana Cost ရွိတဲ့ Demonic Coversion ကုိ 35 seconds ၾကာတုိင္း တစ္ခါသုံးႏုိင္ဖုိ႔ 30 seconds Cooldown သာရွိျပီး 150 Mana ကုိ ေထာက္ပ့ံေပးမယ့္ Soul Ring ဟာ Jungle Enigma တုိင္းအတြက္ မရွိမျဖစ္လုိအပ္ပါလိမ့္မယ္။ Enigma ဟာ ၇ မိနစ္ ဝန္းက်င္မွာ Net Worth 3000 gold ေလာက္ကုိ အလြယ္တကူ ရွာႏုိင္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ အေစာပုိင္း Team Fight တုိင္းကုိ အားသာခ်က္ျဖစ္ေစမယ့္ Mekansm ကုိ ဦးစားေပး ေရြးခ်ယ္ေလ့ရွိပါတယ္။ Hp Pool ေရာ Armor ပါ နည္းပါးတဲ့ Enigma အတြက္ Mekansm ေရြးခ်ယ္မႈဟာ အေကာင္းဆုံးဆုိတာ မွန္ေပမယ့္ ပြဲအေျခအေနကုိၾကည့္ျပီး အေစာပုိင္း Aggressive ေဆာ့ဖုိ႔ Blink Dagger ကုိလည္း ေရြးခ်ယ္ႏုိင္ပါတယ္။ Blink Dagger ကုိ ေရြးခ်ယ္မယ့္ Enigma အေနနဲ႕ Midnight ကုိ တစ္ဆင့္ထက္ ပုိမယူဘဲ Malefice ကုိ တက္နုိင္သေလာက္ ျမန္ျမန္ ဂိတ္ဆုံးေအာင္ ယူသင့္ပါတယ္။ lvl 8 Enigma အေနနဲ႕ Malefice ၃ ဆင့္ေလာက္ တင္ထားျပီးသား ျဖစ္ေနမယ္ဆုိရင္ အေစာပုိင္း aggressive ganker ပုံစံျဖင့္ တစ္ဖက္အသင္းရဲ႕ Farmer ေတြကုိ Ganking လုပ္ဖုိ႔ အေကာင္းမြန္ဆုံး ပုံစံကုိ ပုိင္ဆုိင္ပါလိမ့္မယ္။ Demonic Conversion ဟာ 300 MS, 220 Hp, 4 armor နဲ႕ 41 Avg Damage ေလာက္ရွိျပီျဖစ္လုိ႔ lvl 5 အေရာက္မွာ ၃ ဆင့္ေလာက္ တင္ထားႏုိင္ရင္ လုံေလာက္ သေလာက္ရွိသြားပါျပီ။ ဒါေၾကာင့္ lvl 9 အေရာက္မွာ Malefice ၄ ဆင့္၊ Midnight ၁ ဆင့္ နဲ႕ Demonic Conversion ၃ ဆင့္ေလာက္ တင္ထားျခင္းက Enigma ကုိ ျပည့္စုံေစတဲ့ Hero တစ္ေကာင္ျဖစ္ေစပါလိမ့္မယ္။Blackhole ဟာ 275 Cast Range ပဲ ရွိတဲ့အျပင္ Enigma ကုိယ္တုိင္ကလည္း Mana Cost မ်ားတဲ့ Ability ေတြကုိ ပုိင္ဆုိင္ထားတဲ့အတြက္ သင္က Arcane Boots ကုိ ေရြးခ်ယ္မယ္ဆုိရင္ေတာင္ Aether Lens ကုိ ေျပာင္းလဲ ေပးသင့္ပါတယ္။ Aether Lens ကေန ရရွိမယ့္ +200 Cast Range ဟာ Malefice, Eidolon, Midnight, Black Hole အျပင္ အေရးအၾကီးဆုံး Blink Dagger ကုိပါ ေဝးေဝးခုန္ႏုိင္ေအာင္ အေထာက္အကူ ေပးမွာျဖစ္ပါတယ္။ တကယ္လုိ႔ Guardian Greaves ကုိ ေရြးခ်ယ္ခဲ့မယ္ဆုိရင္ေတာင္ Aether Lens ကုိ ပြဲအေျခအေနအရ ထည့္သြင္းဖုိ႔ စဥ္းစားသင့္ပါတယ္။ +40 Game တုိင္းအတြက္ Bkb, Refresher Orb, Aghanim’s Scepter တုိ႔ကုိ ေရြးခ်ယ္သင့္သလုိ ပြဲအေျခအေနေပၚကုိလုိက္ျပီး Eul Staff, Linken, Glimmer Cape တုိ႔ကုိလည္း ထည့္သြင္း စဥ္းစားေပးရပါမယ္။ ဥပမာ - Long Range Target Disable Hero ေတြျဖစ္တဲ့ Rubick, Vengiful, Disruptor တုိ႔က သင့္ရဲ႕ Black Hole ကုိ အေႏွာက္အယွက္ေပးႏုိင္တဲ့အတြက္ ကစားပြဲအေစာပုိင္းမွာ Glimmer Cape, ကစားပြဲေနာက္ပုိင္းမွာ Linken Sphere တုိ႔ကို ေရြးခ်ယ္ႏုိင္သလုိ Earthshaker, Kunkka တုိ႔လုိ Point Ability ေတြ အတြက္ Bkb နဲ႕ ျပန္လည္ ကာကြယ္ႏုိင္ပါတယ္။ တကယ္လုိ႔ Silencer လုိ႔ Target ေရာ၊ Point ေရာ မဟုတ္တဲ့ Hero ေတြ နဲ႕ ရင္ဆုိင္ရတဲ့အခါမွာေတာ့ Eul Scepter နဲ႕ မိမိေပၚသက္ေရာက္ေနတဲ့ Debuff ကုိ အရင္ ဖယ္ရွားျပီး ျပန္လည္တုိက္ခုိက္ႏုိင္တဲ့ အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။",
		"hero_spell":[
			{
				"spell_name":"Malefice",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_malefice_hp1.png",
				"spell_overview":"Enigma ရဲ႕ Malefice ကေတာ့ Enemy Hero တစ္ေကာင္ကုိ ေသေစဖုိ႔ လုံေလာက္ေစတဲ့ Single Target Disable Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Hero ဟာ Malefice Debuff 4 seconds ကုိ ခံစားရမွာျဖစ္ျပီး တင္တင္ခ်င္း တစ္ခ်က္၊ 2 seconds အၾကာမွာ တစ္ခ်က္၊ 4 seconds အၾကာမွာ တစ္ခ်က္ အားလုံးေပါင္း ၃ ခ်က္ရွိတဲ့ Disable တစ္ခုကုိ ခံစားရမွာျဖစ္ပါတယ္။ ဒီလုိ Stun မယ့္ Duration ကေတာ့ 0.25/ 0.5/ 0.75/ 1 second ဆုိျပီး ယူတဲ့အဆင့္အလုိက္ တုိးလာမွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Demonic Conversion",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_demonic_conversion_hp1.png",
				"spell_overview":"Enigma ကုိ Jungler တစ္ေကာင္အျဖစ္အျပင္ Pusher Hero တစ္ေကာင္အျဖစ္ပါ အသုံးျပဳလုိ႔ရေစတဲ့ Demonic Conversion ကေတာ့ ပုံေသ Mana Cost 170 ရွိတဲ့ Summon Units Ability ျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Unit ဟာ 100% Hp Removal ျဖင့္ Hp အားလုံး ဖယ္ရွားခံလုိက္ရမွာျဖစ္ျပီး Eidolon ၃ ေကာင္ ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ Duration နဲ႕ Cooldown ဟာ ပုံေသ 35 seconds ရွိမွာျဖစ္ျပီး မ်ားမ်ားတင္ေလ Eidolon မ်ားရဲ႕ Hp, MS, Armor နဲ႕ Damage တုိ႔ အသီးသီးတက္လာမွာျဖစ္ပါတယ္။ Attack Range 450 ရွိတဲ့ အဆုိပါ Eidolon ေလး တစ္ေကာင္ခ်င္းစီက Physical Attack ၆ ခ်က္ ျပဳလုပ္ျပီးတာနဲ႕ Hp အျပည့္ျပန္ျဖစ္ျပီး ေနာက္ထပ္ကုိယ္ပြား Eidolon မ်ား ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ အဆုိပါ အသစ္ထြက္ေပၚလာတဲ့ Eidolon မ်ားဟာလည္း ပထမ Eidolon ေတြရဲ႕ Duration 35 seconds ရဲ႕ လက္က်န္အခ်ိန္အတုိင္းသာ အသက္ရွင္မွာ ျဖစ္လုိ႔ Eidolon တုိင္းဟာ Duration ျပီးဆုံးခ်ိန္ဟာ အတူတူ ျဖစ္ေနပါလိမ့္မယ္။ High Lvl Neutral Creep ေတြနဲ႕ Ancient Creep ေတြ အေပၚကို Demonic Conversion အသုံးျပဳႏုိင္ျခင္း မရွိသည့္အျပင္ Building Unit ကုိ တုိက္ခုိက္ျခင္းကလည္း Eidolon ပြားေစမယ့္ ၆ ခ်က္ပစ္ကုိ ထည့္သြင္းမေရတြက္ပါဘူး။"
			},
			{
				"spell_name":"Midnight Pulse",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_midnight_pulse_hp1.png",
				"spell_overview":"AoE Nuke Ability တစ္ခုလုိ႔ ေျပာလုိ႔ရတဲ့ Midnight Pulse ကေတာ့ အဆုိပါ AoE ကုိ တက္နင္းထားတဲ့ Enemy ရဲ႕ Max Hp ပမာဏေပၚ မူတည္ျပီး တြက္ခ်က္မယ့္ Pure Damage အမ်ဴိးအစားပဲျဖစ္ပါတယ္။ 3%/3.75%/4.5%/5.25% ဆုိတဲ့ ပမာဏအတုိင္း Enemy Units ေတြရဲ႕ Max Hp နဲ႕တြက္ခ်က္ျပီး ေသြးေလ်ာ့ေစမွာျဖစ္လုိ႔ ေယဘုယ်အားျဖင့္ အေစာပုိင္းတစ္ဆင့္ေလာက္ တင္ထားလည္း လုံေလာက္မွာျဖစ္ပါတယ္။ ဥပမာ - 1000 Hp ရွိတဲ့ Enemy Hero တစ္ေကာင္ဟာ lvl 1 Midnight အေပၚမွာ 4 seconds ခန္႔ တက္နင္းထားတယ္ဆုိပါစုိ႔။ 1 second ကုိ ၄င္း Hp ရဲ႕3% နဲ႕ ညီမွ်တဲ့ 30 Pure Damage ကုိ 4 seconds သက္ေရာက္မွာျဖစ္လုိ႔ 30 x 4 = 120 pure damage ကုိ ခံစားရပါလိမ့္မယ္။ အဆုိပါအေျခအေနကုိ lvl 4 Midnight အျဖစ္ တြက္ခ်က္ၾကည့္တဲ့အခါ 1000 Hp ရဲ႕ 5.25% = 52.5 Pure Damage ဟာ စုစုေပါင္း 4 seconds အတြက္ 210 Pure Damage ကုိ သတ္ေရာက္ေစမွာပါ။ Max Hp ပမာဏေပၚ မူတည္ျပီး တြက္ခ်က္တာျဖစ္လုိ႔ Hp အလြန္နည္းတဲ့ Lane Creep, Jungle Creep တုိ႔အျပင္ အေစာပုိင္း Hp နည္းေသးတဲ့ Hero ေတြ အေပၚ အသုံးျပဳျခင္းက ထိေရာက္မႈ အားနည္းပါတယ္။ ဒါေၾကာင့္ မ်ားမ်ားတင္ေလ Mana Cost တစ္ခုပဲ တက္လာေလျဖစ္တဲ့ Midnight ကုိ ပြဲအေစာပုိင္းမွာ သစ္ပင္ခ်ဴိးဖုိ႔နဲ႕ ဟန္မပ်က္ အသုံးျပဳဖုိ႔အတြက္ တစ္ဆင့္ေလာက္ တင္ထားရင္ လုံေလာက္ပါတယ္။"
			},
			{
				"spell_name":"Black Hole",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enigma_black_hole_hp1.png",
				"spell_overview":"လက္ရွိ Patch v6.88 မွာ Enigma ရဲ႕ Black Hole ကုိ Pure Damage အျဖစ္ေျပာင္းလဲ ေပးလုိက္ျခင္းက ယခင္ကတည္းက Over ျဖစ္ေနတဲ့ AoE Disable Ability ကေန AoE Killing Disable အျဖစ္ ေျပာင္းလဲေပးလုိက္သလုိ ျဖစ္သြားပါတယ္။ 420 AoE ရွိတဲ့ Black Hole အတြင္းမွာ ယူထားတဲ့အဆင့္အလုိက္ 50/ 100/ 150 Pure Damage ကုိ သတ္ေရာက္ေစမွာျဖစ္ျပီး 4 seconds Duration အတြင္းမွာ အဆုိပါ AoE အတြင္းက Units မ်ားအားလုံးကုိ Complete Disable ျဖစ္ေနေစမွာျဖစ္ပါတယ္။ Magic Immune Units ေတြကုိ ဖမ္းထားနုိင္တဲ့ အားသာခ်က္ရွိလုိ႔ Black Hole ဟာ Super Late Game အထိ တန္ဖုိးျဖတ္မရတဲ့ Ability တစ္ခုလည္းျဖစ္ပါတယ္။ Black Hole မိေနတဲ့ Hero ကုိ Force Staff, Geomagnetic Grip စတဲ့ အသုံးျပဳမႈေတြ နဲ႕ အလြယ္တကူ ဖယ္ထုတ္လုိ႔ မရေပမယ့္ Nether Swap, Meat Hook လုိ Ability မ်ားကုိ အသုံးျပဳျပီးေတာ့ ကယ္ထုတ္လုိ႔ရပါတယ္။ Aghanim’s Scepter ကုိ ေရြးခ်ယ္ႏုိင္စြမ္းရွိတဲ့ Ultimate ျဖစ္ျပီး Black Hole ကုိ နဂုိ 50/ 100/ 150 Pure Damage အျပင္ ယူထားတဲ့ Midnight အဆင့္နဲ႕ ညီမွ်တဲ့ Damage ကုိ ပါ ေပါင္းစပ္ေပးသြားမွာျဖစ္ပါတယ္။"
			}
		]
 },
 {
	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/631344273683111",
	"hero_intellgience":"22 + 2.50",
	"hero_agility":"15 + 1.70",
	"hero_strength":"16 + 2.00",
	"hero_damage":"22 - 26",
	"hero_movement_speed":"290",
	"hero_armor":"3.1",
 	"hero_name":"Necrohpos",
 	"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/necrolyte_vert.jpg",
 	"hero_role":"Ranged - Carry - Nuker - Durable - Disabler",
	"hero_detail":"",
 	"hero_overview":"Necrophos ကုိ Offlaner နဲ႕ Mid Laner အျဖစ္ အျမင္ရမ်ားေလ့ရွိျပီး Death Pulse ကုိ ဦးစားေပး တင္ေလ့ရွိတာကို ေတြ႕ရပါတယ္။ တစ္ခါတစ္ရံမွာ Offlaner Necrophos ေတြ အေနနဲ႕ Heartstopper ကုိ ဒုတိယ ဦးစားေပး တင္ေလ့ရွိေပမယ့္ ကစားပြဲအေစာပုိင္းမွာ Sadist ကုိ ဦးစြာတင္ဖုိ႔ အၾကံျပဳခ်င္ပါတယ္။ Sadist ဟာ Last Hit တစ္ခုလုပ္လုိက္တုိင္း HP MP ကုိ Regen ရေစမယ့္ အခ်က္က Necrophos ကုိ အေစာပုိင္းမွာ Mana Regen Item ေတြ ထည့္မစဥ္းစားဖုိ႔ အခြင့္အေရးရေစပါတယ္။ တကယ္လုိ႔ သင္က lvl 9 မွာ Sadist ကုိ Max ျဖစ္ေအာင္ တင္ခဲ့မယ္ဆုိရင္ မိနစ္ ၂ဝ မတုိင္ခင္ Team Fight ေတြမွာ Hero တစ္ေကာင္ Kill ႏုိင္တာနဲ႕ 360 Heal + 720 Mana Restore ဆုိတဲ့ မ်ားျပားေသာ Effective HP, MP ကုိ ရရွိေစမယ့္ အတြက္ျဖစ္ပါတယ္။ Heartstopper ဟာ အလြန္ထိေရာက္တဲ့ Aura တစ္ခုျဖစ္ေပမယ့္ ၄င္းဟာ % Calculation ျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္း Enemy Hero ေတြ ေသြးနည္းေနခ်ိန္မွာလည္း Dps နည္းနည္းပဲ ထိဦးမွာျဖစ္လုိ႔ AFK Jungle ေဆာ့တဲ့ (သုိ႔မဟုတ္) Aggressive Tri Offlane ေဆာ့တဲ့ Necrophos မဟုတ္ရင္ အေစာပုိင္းမွာ မ်ားမ်ား တင္ထားလည္း သိပ္ေတာ့ မထိေရာက္ပါဘူး။ (သုိ႔ေပမယ့္ ရံဖန္ရံခါမွာ Aggressive Mid Laner ေတြနဲ႕ ေဆာ့ရတဲ့အခါမ်ဴိး (ဥပမာ Outworld Devourer, TA) မွာ Heartstopper ကုိ မ်ားမ်ားယူျပီး ထိန္းရတဲ့ အေျခအေနမ်ဴိးရွိပါတယ္။) Sadist ကုိ ေရြးခ်ယ္ထားျခင္းေၾကာင့္ Dagon, Dagger, Force Staff, Blade Mail အစရွိတဲ့ Situational Item ေတြကုိ အေစာပုိင္းကတည္းက ေရြးခ်ယ္ႏုိင္ပါလိမ့္မယ္။Reaper’s Scythe ရဲ႕ အဓိက အားနည္းခ်က္ဟာ 600 သာရွိတဲ့ Cast Range ပဲျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္းမွာ Force Staff, Dagger တစ္ခုခုကို ေရြးခ်ယ္ႏုိင္ျပီး Aether Lens ဟာလည္း Situational Item တစ္ခု ျဖစ္ပါလိမ့္မယ္။ Reaper’s Scythe အသုံးျပဳျပီး 1.5 seconds ၾကာမွ Damage တြက္ခ်က္သက္ေရာက္မွာျဖစ္လုိ႔ Dagon နဲ႕ တြဲဖက္ျပီး အသုံးျပဳတာကေတာ့ အျမင္ရအမ်ားဆုံး ကစားပုံျဖစ္ပါတယ္။ ဒီလုိ Reaper’s Scythe အသုံးျပဳထားတဲ့ 1.5 seconds မွာမွ အဆုိပါ Hero ကုိ Lotus Orb တင္ေပးမယ္ဆုိရင္ Damage ဟာ Necrophos ကုိ ျပန္လည္ သတ္ေရာက္ေစမွာ မဟုတ္ပါဘူး။ (Lotus Orb သုံးထားျပီးသား Unit ေပၚကုိ Reaper’s Scythe သုံးမွသာ ျပန္ထိမွာျဖစ္ပါတယ္။) မိမိ Ally Hero တစ္ေကာင္ေကာင္ကုိ Reaper’s Scythe အသုံးျပဳခံေနရတဲ့အခ်ိန္မွာ Glimmer Cape တင္ေပးျခင္းက အေကာင္းဆုံး Counter ျဖစ္ပါတယ္။ အေၾကာင္းက Glimmer Cape မွာ 45% Magic Resistance ပါဝင္တဲ့အတြက္ Reaper’s Scythe ရဲ႕ Damage Output ကုိ သိသာစြာ ေလွ်ာ့ခ်ေပးမွာျဖစ္ပါတယ္။ မ်ားေသာအားျဖင့္ ကစားပြဲၾကာျမင့္လာေလေလ Necrophos ပါဝင္တဲ့အသင္းက ႏုိင္ဖုိ႔ အခြင့္အေရးရွိေလ ျဖစ္ပါတယ္။ အေၾကာင္းက Aghanim’s Scepter + Refresher Orb ကုိ အသုံးျပဳျပီး Enemy Team က Hero ၂ ေကာင္ေလာက္ကုိ လုံးဝ Buyback ထြက္လုိ႔ မရေအာင္ လုပ္ပစ္ႏုိင္တဲ့ Overpower အေျခအေန တစ္ရပ္ကုိ ပုိင္ဆုိင္ထားတဲ့အတြက္ပဲျဖစ္ပါတယ္။ Item အေနနဲ႕လည္း မ်ားစြာ ေရြးခ်ယ္ႏုိင္ပါတယ္။ ဖိနပ္ျပီးတာနဲ႕ Bloodstone တန္းထည့္တဲ့ Aggressive Durable Style, Blade Mail + Force Staff နဲ႕ Battle လုိက္တဲ့ Aggressive Initiator Style, Dagon + Aghanim’s နဲ႕ Carry Style, Guardian Greaves + Pipe နဲ႕ Support Style စ သျဖင့္ မရုိးႏုိင္ေသာ Play Style ေပါင္းမ်ားစြာ၊ ေရြးခ်ယ္စရာ Item ေပါင္းမ်ားစြာနဲ႕ ျပီးျပည့္စုံတဲ့ Flexible Intelligence Hero တစ္ေကာင္ပဲ ျဖစ္ပါေတာ့တယ္။ဒီလုိ အေၾကာင္းျပခ်က္ေပါင္း မ်ားစြာေၾကာင့္ပဲ Rotund’Jere The Necrophos ဟာ Pub Stomper တစ္ေကာင္အျဖစ္ အခ်ိန္ၾကာျမင့္စြာ ရပ္တည္ေနႏုိင္တဲ့ Hero တစ္ေကာင္ဆုိတာ ျငင္းလုိ႔မရပါဘူး။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
 	"hero_spell":[
 		{
 			"spell_name":"Death Pulse",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_death_pulse_hp1.png",
 			"spell_overview":"Necrophos releases a wave of death around him, dealing damage to enemy units and healing allied units."
 		},
 		{
 			"spell_name":"Heartstopper Aura",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_heartstopper_aura_hp1.png",
 			"spell_overview":"Necrophos stills the hearts of his opponents, causing nearby enemy units to lose a percentage of their max health over time."
 		},
 		{
 			"spell_name":"Sadist",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_sadist_hp1.png",
 			"spell_overview":"Necrophos gains health and mana regeneration for every unit he kills. Hero kills grant 10 times the regen bonus."
 		},
 		{
 			"spell_name":"Reaper's Scythe",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/necrolyte_reapers_scythe_hp1.png",
 			"spell_overview":"Stuns the target enemy hero, then deals damage based on how much life it is missing. Heroes killed by Reaper's Scythe will have 10 seconds added to their respawn timer. Any kill under this effect is credited to Necrophos. Upgradable by Aghanim's Scepter."
 		}
 	]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/604433353040870",
		"hero_intellgience":"23 + 2.70",
		"hero_agility":"18 + 2.20",
		"hero_strength":"17 + 1.90",
		"hero_damage":"27 - 31",
		"hero_movement_speed":"295",
		"hero_armor":"2.52",
		"hero_name":"Shadow Demon",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/shadow_demon_vert.jpg",
		"hero_role":"Ranged - Support - Disabler - Initiator - Nuker",
		"hero_detail":"လက္ရွိ Meta မွာ Pub Match ေတြမွာ အဆုိးရြားဆုံး ဒုကၡေပးေနတဲ့ Hero တစ္ေကာင္လုိ႔ ေျပာလုိက္ရင္ Spectre ကုိ ဦးစြာ ေျပးျမင္မိမွာ ေသခ်ာပါတယ္။ အျခား Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Outworld Devourer ဟာလည္း Overpower ျဖစ္ေနတယ္ဆုိေပမယ့္ Pub Match ေတြမွာေတာ့ Spectre ေလာက္ ဆုိးဆုိးရြားရြား Pub Stomper တစ္ေကာင္မျဖစ္ေသးပါဘူး။ ဒါေၾကာင့္ Spectre ကုိ Counter လုပ္တဲ့အခါမွာ မ်ားေသာအားျဖင့္ Slow Ability Caster ေတြဟာ အသုံးဝင္ေလ့ရွိျပီး Spectre ရဲ႕ Passive ေတြကုိပါ ရပ္တန္႔ေစမယ့္ Support Hero တစ္ေကာင္ကေတာ့ The Shadow Demon ပဲ ျဖစ္ပါတယ္။ Shadow Demon ဟာ Dota 2 Hero ေပါင္း ၁၁၁ ေကာင္မွာ ေပၚျပဴလာျဖစ္မႈ နံပါတ္စဥ္ ၁ဝ၇ သာ ခ်ိတ္တာကို ေတြ႕ရပါလိမ့္မယ္။ Pubber အမ်ားစုဟာ ရုိးရွင္းတဲ့ Disable, ရုိးရွင္းတဲ့ Nuke, ရုိးရွင္းတဲ့ Carry ေတြကုိ အၾကဳိက္မ်ားေလ့ရွိတဲ့အတြက္ Shadow Demon လုိမ်ဴိး Pure Support Hero တစ္ေကာင္ဟာ လူၾကဳိက္သိပ္မမ်ားဘူးဆုိေပမယ့္ Early Game နဲ႕ Mid Game မွာ Strong ျဖစ္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလုိ႔ မရပါဘူး။ တကယ္လုိ႔ သင္ဟာ Support Player တစ္ေယာက္ ဒါမွမဟုတ္ Mid Player တစ္ေယာက္ျဖစ္ေနခဲ့မယ္ဆုိရင္ေတာ့ Shadow Demon ကုိ သင္ေရြးခ်ယ္ရမယ့္ Hero List ထဲမွာ ထည့္သြင္းစဥ္းစားဖုိ႔ အၾကံျပဳလုိပါတယ္။\nItem Build\nShadow Demon ဟာ ရုတ္တရက္ၾကည့္ရင္ Mana Cost အေျမာက္အမ်ားလုိတယ္လုိ႔ ထင္ရေပမယ့္ သင့္ေတာ္တဲ့ Mana Regeneration သာ ရွိမယ္ဆုိရင္ သူ႔ရဲ႕ Ability ေတြဟာ Battle တစ္ခုအတြက္ လံုေလာက္တဲ့ ပမာဏကုိ ပုိင္ဆုိင္ျပီးသားျဖစ္ပါတယ္။ ဒါေၾကာင့္ ဖိနပ္အတြက္ Tranquil Boots ကုိ ေရြးခ်ယ္ျခင္းက ပုိမုိ အသုံးတည့္ေစျပီး ဒုတိယ Item အျဖစ္ Aether Lens ကုိ အၾကံျပဳခ်င္ပါတယ္။ Urn နဲ႕ Force staff ကေတာ့ Support Hero တစ္ေကာင္အတြက္ Escape နဲ႕ Save အတြက္ အသုံးျပဳဖုိ႔ အေထာက္အကူ ျပဳေစတာကိုပါလိမ့္မယ္။ Dagger, Rod of Atos, Eul Scepter, Mekansm, Pipe, Necronomicon တုိ႔ကေတာ့ ပြဲအေျခအေနေပၚမူတည္၍ ေရြးခ်ယ္ႏုိင္ျပီး Aghanim's ကေတာ့ Late Game Counter အတြက္ လြန္စြာ အေရးၾကီးတဲ့ Item တစ္ခုအျဖစ္ စဥ္းစားႏုိင္ပါတယ္။",
		"hero_overview":"Shadow Demon ရဲ႕ Shadow Poison ကေတာ့ မ်ားျပားတဲ့ Damage ပမာဏကုိ ေပးမယ့္ Nuke Ability ဆုိတာ ေဖာ္ျပျပီးျဖစ္ပါတယ္။ ဒါေၾကာင့္ တစ္ဖက္အသင္းမွာ မိမိအသင္းကုိ ဒုကၡေပးမယ့္ Mid Laner တစ္ေကာင္ေကာင္ (DP, OD, Zeus, etc... ) လာမယ္ဆုိရင္ Shadow Demon ရဲ႕ Long Range Shadow Poison နဲ႕ Counter ျပန္ေထာက္ျပီး Mid Lane ပုံစံနဲ႕ ျပန္ထိန္းႏုိင္ပါတယ္။ ဒါအျပင္ Mid Lane Hero နဲ႕ ေဆာ့တဲ့အခါမွာ Neutral Creep Camp Stack တစ္ခုကုိ စားဖုိ႔ 12.5 Seconds ၾကာျမင့္တဲ့ Shadow Poison 5 Stacks ျဖင့္ အလြယ္တကူ Creep စားႏုိင္ဦးမွာျဖစ္ပါတယ္။ Disruption ရဲ႕ ထူးျခားခ်က္ကေတာ့ Illusion Unit ေတြအေပၚမွာ အသုံးျပဳႏုိင္ျခင္းပဲျဖစ္ပါတယ္။ ျဖစ္ေပၚလာတဲ့ Illusion ၂ ေကာင္ရဲ႕ Damage Output ဟာ Illsion Unit ေပၚတြက္ခ်က္ျခင္းမဟုတ္ဘဲ ပုိင္ရွင္ Hero အစစ္ရဲ႕ Damage ပမာဏအတုိင္း တြက္ခ်က္တာျဖစ္လုိ႔ Spectre ရဲ႕ Ultimate Haunt Illusion လိုမ်ဴိး Illusion ေပၚကုိ အသုံးျပဳေပးတာနဲ႕ မူလ Spectre ရဲ႕ 60% Damage Output ၂ ေကာင္ကို ရရွိေစမွာျဖစ္ပါတယ္။ ဒါ့အျပင္ မိမိအသင္းက Hard Carry ကုိ အသုံးျပဳေပးရင္လည္း Manta Style ထက္ ၇.၅ ဆ ပုိေကာင္းတဲ့ Illusion Unit ႏွစ္ခု ကုိ ရရွိေစမယ့္ အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။Shadow Demon ဟာ Early Game နဲ႕ Aghanim's ထြက္ျပီး Late Game မွာ မ်ားစြာ အသုံးဝင္ပါတယ္။ Damage တစ္ခုကုိ တုိက္ရုိက္မထိဘဲ သြယ္ဝုိက္ကာ အခ်ိန္အတုိင္းအတာ တစ္ခုထိ ေစာင့္ေပးရတဲ့ အားနည္းခ်က္ေၾကာင့္ လူၾကဳိက္နည္းေနရတာ ျဖစ္ေပမယ့္ တကယ္တမ္း အသုံးဝင္တဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလို႔ မရပါဘူး။ Shadow Demon ရဲ႕ အသုံးဝင္မႈဟာ သူ႔ကို ကုိင္တြယ္ကစားမယ့္ ကစားသမားရဲ႕ ပါးနပ္မႈေပၚကုိ မ်ားစြာ မူတည္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Disruption",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_disruption_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ ဒီ Single Target Ability ဟာ မည္သည့္ Hero Unit ကုိေပၚမဆုိ အသုံးျပဳႏုိင္ျပီး အဆုိပါ Hero ကုိ 2.5 Seconds ခန္႔ ေျမပုံေပၚက ေပ်ာက္သြားေစမွာျဖစ္ပါတယ္။ 2.5 seconds ျပည့္သြားတဲ့အခါမွာေတာ့ အဆုိပါ Hero ဟာ သူ႔ရဲ႕ ပုံစံတူ Hero ၂ ေကာင္နဲ႕ အတူ ျပန္လည္ထြက္ေပၚလာမွာျဖစ္ပါတယ္။ အဆုိပါ Illusion Unit ၂ ခုဟာ Shadow Demon ရဲ႕ ထိန္းခ်ဴပ္မႈေအာက္မွာရွိမွာျဖစ္ျပီး Illusion တစ္ေကာင္ခ်င္းစီဟာ အဆုိပါ Hero ရဲ႕ 30%/ 40%/ 50%/ 60% Damage Output ရွိမွာျဖစ္ျပီး 150% Incoming Damage ရွိမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Illusion Unit ၂ ခုေပါင္းရဲ႕ စုစုေပါင္း Damage ဟာ 120% ရွိလုိ႔ မူလ Hero ထက္ ပုိမ်ားတဲ့ Damage ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ (Late Game မွာ Strong ျဖစ္ေနတဲ့ Enemy Hero တစ္ေကာင္ကုိ အသုံးျပဳေပးျခင္းက အဆုိပါ Hero ထက္ 20% ပုိၾကမ္းေသာ Illusion Unit ၂ခု ကုိ မိမိဘက္မွ ျပန္လည္ ကူညီ တုိက္ခုိက္ေပးေစမယ့္ သေဘာျဖစ္ပါတယ္။ ) မိမိအသင္းဘက္မွ Position လုိအပ္တဲ့ Ability မ်ားျဖစ္တဲ့ Sacred Arrow, Requiem of Souls, Sun Strike, Earth Split, Smoke Screen, စတဲ့ Ability ေတြကုိ တိက်စြာ သက္ေရာက္ေစဖုိ႔ အေထာက္အကူျပဳတဲ့အျပင္ Enemy Team မွာ တုိက္ခုိက္လာမယ့္ Ability မ်ားျဖစ္တဲ့ Duel, Fiend Grip, Mystic Flare, Trick of the Trade, Reaper Scythe စတဲ့ Ultimate မ်ားကို ကာကြယ္ေပးႏုိင္တဲ့အျပင္ Long Range Spell မ်ား ရန္ကလည္း ကာကြယ္ေပးႏုိင္ပါလိမ့္မယ္။ အေရးအၾကီးဆုံးအခ်က္ကေတာ့ အခ်ိန္ကုိက္ အသုံးျပဳဖုိ႔အတြက္ Cast Time 0.3 Second နဲ႕ Cast Range 500 ကုိ တိတိက်က်သိထားဖုိ႔ လုိအပ္ပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Soul Catcher",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_soul_catcher_hp1.png",
				"spell_overview":"တကယ္လုိ႔ သင္က Support Shadow Demon ျဖစ္ေနမယ္ဆုိရင္ ဒီ Ability ကုိ Lvl 7 မွာ ဂိတ္ဆုံးယူဖုိ႔ အၾကံျပဳလုိပါတယ္။ Catch မိသြားတဲ့ Unit အေပၚကုိ က်ေရာက္လာသမွ် Damage (Physical, Magical, Pure) တုိင္းကုိ 20%/ 30%/ 40%/ 50% တုိးေစမွာျဖစ္ပါတယ္။ ဥပမာ - Lvl 7 အေရာက္မွာ Soul Catcher မိသြားတဲ့ Unit ကုိ မိမိအသင္းသား Lion က Ultimate Finger of Death နဲ႕ တိုက္ခုိက္တဲ့အခါ ပုံမွန္ Damage 600 အစား 600 + 50% = 900 Damage ကုိ ထိေစမွာျဖစ္ပါတယ္။ အေစာပုိင္းမွာ Hero တစ္ေကာင္ကို Ganking လုပ္ရာမွာ မ်ားစြာ Overpower ျဖစ္ေနတဲ့ Ability လုိ႔ ေျပာလုိ႔ရပါတယ္။ ဒါေပမယ့္ ဒီေလာက္ ေကာင္းတဲ့ Amplified Ability တစ္ခုအေနနဲ႕ အားနည္းခ်က္ကေတာ့ ၾကီးမားတဲ့ 500 AoE အတြင္းက Random Unit တစ္ခုကိုသာ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ အသုံးျပဳတဲ့အခါမွာ AoE အတြင္းမွာ အျခား Unit ေတြ မရွိေစဘဲ မိမိ Target ထားလုိတဲ့ Hero တစ္ေကာင္တည္း ရွိေအာင္ သုံးေပးရပါမယ္။ (ဥပမာ - မိမိတုိက္ခုိက္လုိတဲ့ Enemy ကုိ Disruption နဲ႕ ဖမ္းထားျပီး Soul Catcher ရဲ႕ AoE တစ္ခုလုံးကုိ Unit မရွိတဲ့ ေတာအုပ္ဘက္ကုိထားျပီး AoE ရဲ႕ အစြန္းတစ္ဘက္နဲ႕ အဖ်ားခက္ရုံေလးသာ အသုံးျပဳေပးမယ္ဆုိရင္ ထိဖုိ႔ေသခ်ာသေလာက္ရွိပါတယ္။)"
			},
			{
				"spell_name":"Shadow Poison",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_shadow_poison_hp1.png",
				"spell_overview":"တကယ္လုိ႔ သင္က Mid Lane Shadow Demon အေနနဲ႕ေဆာ့မယ္ဆုိရင္ေတာ့ Shadow Poison ကုိ Lvl 7 မွာ ဂိတ္ဆုံးယူေပးသင့္ပါတယ္။ Shadow Poison ဟာ Distance 1500 Range အထိသြားႏုိင္တဲ့ AoE 190 ရွိေသာ Stack Nuke Ability ျဖစ္ပါတယ္။ တြက္ခ်က္ပုံကေတာ့ Stack တစ္ခု၊ တစ္ခုစီ တုိးသြားတဲ့အခါတုိင္းမွာ မိမိယူထားတဲ့အဆင့္ရဲ႕ Stack Damage ကုိ 1/ 2/ 4/ 8/ 16 ဆုိတဲ့ ေျမွာက္လဒ္အတုိင္း ေျမွာက္ျပီး ထိမွာျဖစ္ပါတယ္။ ေျမွာက္လဒ္မွာ ေဖာ္ျပထားတဲ့အတုိင္း 5 stack မွာ Damage ပမာဏအမ်ားဆုံး သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ ေနာက္ဆုံးအဆင့္ကုိ ဥပမာထားျပီး တြက္ခ်က္ၾကည့္ရရင္ Stack Damage ပမာဏဟာ 65 Damage ရွိပါလိမ့္မယ္။ သင္က Enemy Hero ကုိ 4 Stacks ရေအာင္ တင္ထားျပီးျပီဆုိရင္ ၄ဆင့္ရဲ႕ ေျမွာက္လဒ္ဟာ ၈ ျဖစ္ပါတယ္။ (1/ 2/ 4/ 8/ 16)။ 65 x 8 = 520 Damage သက္ေရာက္ပါလိမ့္မယ္။ တကယ္လုိ႔ သင္က ေနာက္ထပ္ 2.5 seconds ေစာင့္ျပီး ၅ ခုေျမာက္ Stack ကို တင္လုိက္ရင္ ေျမွာက္လဒ္ တန္ဖုိးက 8 မဟုတ္ေတာ့ဘဲ 16 ျဖစ္သြားပါလိမ့္မယ္။ ဒါေၾကာင့္ 65 x 16 = 1040 Damage ေတာင္ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ 5 stack ထက္ပုိသြားသမွ်ကေတာ့ ထပ္မေျမွာက္ေတာ့ဘဲ 50 Damage ဆီသာ တုိးသြားေတာ့မွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ 5 Stacks မွာ အသုံးျပဳရင္ အေကာင္းဆုံးျဖစ္ပါတယ္။ Enemy Hero ရဲ႕ ဦးေခါင္းေပၚမွာ Stack ပမာဏ ဘယ္ေလာက္ေရာက္ေနျပီလဲဆုိတာ အထင္အရွား သိႏုိင္ပါတယ္။ Cooldown 2.5 Seconds နဲ႕ Mana Cost 40 သာ ကုန္က်မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Demonic Purge",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shadow_demon_demonic_purge_hp1.png",
				"spell_overview":"Single Target Ability ျဖစ္တဲ့ Ultimate ကေတာ့ ရုိးရွင္းတဲ့ Slow Ability တစ္ခုပဲျဖစ္ပါတယ္။ အတင္ခံရတဲ့ Enemy မွာ ရွိသမွ် Normal Positive Buff ေတြ အကုန္လုံးကုိ ဖ်က္စီးေပးမွာျဖစ္ျပီး ၅ စကၠန္႔ၾကာျမင့္တဲ့ MS Slow ကုိ သက္ေရာက္ေစပါမယ္။ သတ္ေရာက္မယ့္ Damage ကေတာ့ Duration 5 Seconds အျပီးမွ ျဖစ္ေပၚလာပါလိမ့္မယ္။ ပုံေသ Cooldown 50 Seconds ရွိေပမယ့္ ပုိယူခဲ့မယ္ဆုိရင္ Slow Calculation က တုိးလာမွာျဖစ္ပါတယ္။ ပထမတစ္ဆင့္မွာ MS Slow ဟာ Second အလုိက္ 100%/80%/60%/40%/20% ဆုိျပီး ျပန္လည္ တက္သြားမွာျဖစ္ေပမယ့္ ေနာက္ဆုံးအဆင့္မွာေတာ့ ပထမ စကၠန္႔မွာ 100% MS Slow ျဖစ္ေစျပီး က်န္တဲ့ ေလးစကၠန္႔စလုံးမွာ 50% MS Slow ျဖစ္ေနမွာျဖစ္ပါတယ္။ Aghanim's Scepter သာ ဆက္လုိက္မယ္ဆုိရင္ Charge ပုံစံ ေျပာင္းသြားမွာျဖစ္ပါတယ္။ Charge Cooldown 40 Seconds နဲ႕ စုစုေပါင္း ၃ ခါ သုံးလုိ႔ ရတဲ့ Charge ပုံစံ ျဖစ္သြားမယ့္အျပင္ Break Debuff ကုိပါ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ Break ဆုိတာကေတာ့ အသုံးခံရတဲ့ Enemy မွာ ရွိသမွ် Passive Ability ေတြအားလုံးကုိ ရပ္တန္႔သြားေစမယ့္ Debuff ျဖစ္ပါတယ္။ လက္ရွိ Pub Stomper ျဖစ္တဲ့ Spectre ရဲ႕ Desolate နဲ႕ Dispersion လုိ Passive မ်ဴိး၊ Blur နဲ႕ Coup De Grace ကုိ ပုိင္ဆုိင္ထားတဲ့ Phantom Assasin လုိမ်ဴိး Hero ေတြကုိ Counter လုပ္ဖုိ႔ အသင့္ေတာ္ဆုံး Item ေရြးခ်ယ္မႈဟာ Aghanim's Scepter ကေန ရရွိပါလိမ့္မယ္။ Spell Immune Unit ေတြအေပၚမွာ အသုံးျပဳလုိ႔ရတဲ့ Demonic Purge ဟာ Enemy Team ရဲ႕ Couier ကုိ Target ထားျပီး အသုံးျပဳဖုိ႔ လြန္စြာမွ သင့္ေတာ္တဲ့ Ultimate တစ္ခုျဖစ္ပါတယ္။"
			}
		]
 },
 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/652719051545633",
		"hero_intellgience":"24 + 2.70",
		"hero_agility":"10 + 1.00",
		"hero_strength":"22 + 2.50",
		"hero_damage":"22 - 32",
		"hero_movement_speed":"295",
		"hero_armor":"2.4",
		"hero_name":"Warlock",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/warlock_vert.jpg",
		"hero_role":"Ranged - Support - Initiator - Disabler",
		"hero_detail":"Summon Unit ေတြအေပၚကုိ 99999 Damage သတ္ေရာက္တဲ့ Diffusal Blade ရဲ႕ Target Ability ကုိလည္း ဖယ္ရွားေပးလုိက္တဲ့ v6.85 Patch ေနာက္မွာေတာ့ Premium တန္းမွာ ေတြ႕ရခဲတဲ့ Warlock ရဲ႕ အစြမ္းအစဟာ ျပန္လည္ ျမင့္တက္လာခဲ့ပါတယ္။ Pub Tier မွာ Win Rate အေကာင္းဆုံး ထိပ္တန္း Hero ေတြထဲမွာ ပါဝင္ေသာ Intelligence Hero တစ္ေကာင္ျဖစ္တဲ့ Warlock ဟာ ကစားပြဲအေစာပုိင္းကေန ပြဲေနာက္ပုိင္းအထိ အသုံးတည့္တဲ့ Hero အမ်ဴိးအစားထဲမွာလည္း ပါဝင္ပါတယ္။ ဒါ့အျပင္ Team နဲ႕ ေဆာ့တဲ့အခါမွာ Click တစ္ခ်က္တည္း ႏွိပ္ေပးရုံနဲ႕ မ်ားစြာေသာ Damage Output မ်ားျဖစ္ေပၚေစမယ့္ Ability, Healing, AoE Slow နဲ႕ AoE Disable Teamfight Summon Unit တုိ႔နဲ႕ ဖြဲ႕စည္းထားေသာ ရုိးရွင္းတဲ့ Intelligence Hero တစ္ေကာင္ျဖစ္ပါတယ္။",
		"hero_overview":"Fatal Bonds ဟာ လြန္စြာမွာ Overpower ျဖစ္ေနတဲ့ Support Ability တစ္ခုျဖစ္ပါတယ္။ F ခလုတ္တစ္ခ်က္ ႏွိပ္ရုံနဲ႕ အလြန္မ်ားျပားတဲ့ Damage Sharing ေတြ ျဖစ္ေပၚေစမယ့္ Ability ျဖစ္လုိ႔ ကစားပြဲေနာက္ပုိင္းအထိ ဒုကၡေပးမယ့္ Ability တစ္ခုျဖစ္ပါတယ္။ အၾကံျပဳခ်င္တာကေတာ့ Warlock ဟာ Solo Offlane ေဆာ့ဖုိ႔ အေကာင္းဆုံး Hero တစ္ေကာင္ျဖစ္ပါတယ္။ Shadow Word ဟာ ၂ ဆင့္ယူထားတဲ့အခ်ိန္မွာ 300 Hp ကုိ Heal ေစမွာျဖစ္လုိ႔ Attack Range 600 ရွိတဲ့ Hero တစ္ေကာင္အေနနဲ႕ Offlane မွာ အလြယ္တကူ အသက္ရွင္သန္ႏုိင္ပါတယ္။ ဒါေၾကာင့္ Shadow Word ကုိ ၂ ဆင့္ပဲယူျပီး Lvl 7 မွာ Upheaval ကုိ ဂိတ္ဆုံးယူျပီး ေဆာ့ၾကည့္ဖုိ႔ အၾကံျပဳခ်င္ပါတယ္။ Upheaval ကုိ လြန္ဆန္ႏုိင္တဲ့ Ability ဟာ Blink Ability မ်ားနဲ႕ အေပၚမွာေဖာ္ျပခဲ့တဲ့ Ability ၃ ခုသာ ရွိတဲ့အတြက္ lvl 7 မွာ အဆုံးထိ ယူထားမယ္ဆုိရင္ Team Fight တစ္ခုဟာ သိသိသာသာ အားသာခ်က္ ရွိတာကုိ ေတြ႕ရပါတယ္။ မိမိကသာ ဒီ Channeling ကုိ အလြယ္တကူ အဖ်က္မခံရမယ့္ ေနရာကေန အသုံးျပဳတတ္ဖုိ႔ အေလ့အက်င့္ေလး ရွိဖုိ႔သာ လုိပါတယ္။ ဒါေၾကာင့္ Overpower ျဖစ္ေနတဲ့ Fatal Bonds ကုိေတာ့ ပြဲေနာက္ပုိင္းမွာ သုံးဖုိ႔အတြက္ စိတ္ခ်လက္ခ် တင္ႏုိင္ပါတယ္။\nတကယ္လုိ႔ သင္က ကုိယ္တုိင္ တုိက္ခုိက္မယ့္ Mid Laner, Safe Laner Warlock ျဖစ္ခဲ့မယ္ဆုိရင္ေတာ့ Hand of Midas နဲ႕ Fatal Bonds ကုိ ဦးစြာ တင္သင့္ပါတယ္။ ဘယ္ပုံစံနဲ႕ ေဆာ့ေဆာ့ Shadow Word ကုိ ၂ ဆင့္ပဲ ယူတာ လုံေလာက္တယ္ဆုိတဲ့ အခ်က္ကုိေတာ့ ေမ့မထားသင့္ပါဘူး။ ဦးစြာ Boots of Speed ကုိ ရွာေဖြျပီးေနာက္ Aghanim’s Scepter, Refresher Orb, Arcane Boots ဆုိတဲ့ အစဥ္လုိက္အတုိင္း ေရြးခ်ယ္သြားသင့္ျပီး ပြဲအေျခအေနေပၚလုိက္၍ Aether Lens, Blink Dagger, Octarine Core, Shiva Guard စတဲ့ Item မ်ားကုိလည္း အစဥ္လုိက္ ေရြးခ်ယ္သြားသင့္ပါတယ္။ (Warlock ဟာ စာေရးသူရဲ႕ Stats မွာ Rating အေကာင္းဆုံး နံပါတ္ ၁ Hero ျဖစ္လုိ႔ မိမိကစားကြက္ကုိ အၾကံျပဳရျခင္းျဖစ္ပါတယ္။) အဓိကကေတာ့ Warlock ဟာ Lvl လုိအပ္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ Solo Offlane, Solo Mid Lane သာ အေကာင္းဆုံး ဆုိေပမယ့္ ပြဲအေျခအေနေပၚလုိက္ျပီး ေရြးခ်ယ္စရာ ကစားကြက္အစုံအလင္ ရွိတဲ့ Hero တစ္ေကာင္ျဖစ္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Fatal Bonds",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_fatal_bonds_hp1.png",
				"spell_overview":"Cast Range 1000 ရွိတဲ့ Single Target Ability ျဖစ္ျပီး အသုံးျပဳခံရတဲ့ Unit ရဲ႕ 700 AoE အတြင္းက အနီးစပ္ဆုံး Unit ၆ ခုကုိ 25 seconds ၾကာျမင့္တဲ့ Fatal Bonds Debuff ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ အဆုိပါ Debuff သတ္ေရာက္ခံထားရတဲ့ Unit တစ္ခုစီတုိင္းေပၚကုိ Physical, Magical, Pure Damage တစ္မ်ဴိးမ်ဴိး သတ္ေရာက္တုိင္း Fatal Bonds အတူတကြ သတ္ေရာက္ခံထားရတဲ့ အျခား Unit ၅ ခုစလုံးကုိ 25% ေသာ Damage ေတြ မွ်ေဝျပီး သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဥပမာ - Enemy Hero ၂ ေကာင္နဲ႕ Creep Unit ၄ ခုကုိ Fatal Bonds သတ္ေရာက္သြားျပီ ဆုိပါစုိ႔။ သတ္ေရာက္ထားတဲ့ Creep ေတြထဲက တစ္ေကာင္ကုိ Lion ရဲ႕ Finger of Death lvl 3 (850 Magical Damage) ျဖင့္ တုိက္ခုိက္မယ္ဆုိရင္ 850 ရဲ႕ 25% ျဖစ္တဲ့ 213 Magical Damage ဟာ အျခား Creep ၃ ေကာင္နဲ႕ Hero ၂ ေကာင္ကုိပါ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ထူးျခားခ်က္ကေတာ့ အခုလုိ ျပန္လည္ေဝမွ်ျပီး ထိမယ့္ Damage ဟာ Physical ဆုိ Physical, Magical ဆုိ Magical, Pure ဆုိ Pure ဆုိတဲ့အတုိင္း Source Damage အတုိင္း ထိေရာက္မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Shadow Word",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_shadow_word_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ Healing Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Unit ဟာ Ally Unit ျဖစ္မယ္ဆုိရင္ တစ္စကၠန္႔ကုိ 15/ 25/ 35/ 45 Hp ႏႈန္းနဲ႕ 12 seconds ၾကာျမင့္တဲ့ Healing ကုိ ရရွိေစမွာျဖစ္ျပီး Enemy ဆုိရင္ေတာ့ 15/ 25/ 35/ 45 Damage Per Seconds ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ပုံေသ Cooldown 16 seconds ရွိပါတယ္။"
			},
			{
				"spell_name":"Upheaval",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_upheaval_hp1.png",
				"spell_overview":"Cast Range 1200, AoE 650 ရွိတဲ့ Upheaval ကေတာ့ AoE MS Slow Ability တစ္ခုျဖစ္ပါတယ္။ Channeling Ability တစ္ခုျဖစ္ျပီး Warlock အသုံးျပဳထားတာၾကာျမင့္ေလေလ Slow Rate က တုိးေလေလျဖစ္လာမွာျဖစ္ပါတယ္။ 1 second ကုိ 7%/ 14%/ 21%/ 28% ႏႈန္းနဲ႕ MS Slow Rate က တက္လာမွာျဖစ္ျပီး အမ်ားဆုံး 84% Slow Rate အထိ ေရာက္ႏုိင္ေခ်ရွိပါတယ္။ ဒါေၾကာင့္ ေနာက္ဆုံးအဆင့္မွာေတာ့ Warlock အသုံးျပဳျပီးျပီးခ်င္း 3.5 seconds အၾကာမွာ 84% MS Slow ကုိ ေရာက္ရွိသြားမွာျဖစ္ပါတယ္။ Max Movement Speed ကုိေပးတဲ့ Ability မ်ားျဖစ္ေသာ Shukuchi, Surge, Stampede တုိ႔ကုိေတာ့ Slow ႏုိင္စြမ္း မရွိပါဘူး။"
			},
			{
				"spell_name":"Chaotic Offering",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/warlock_rain_of_chaos_hp1.png",
				"spell_overview":"Warlock ရဲ႕ Signature Ability ျဖစ္တဲ့ Ultimate Chaotic Offering ကေတာ့ Warlock ဟာ Teamfight အတြက္ Powerful Golem တစ္ေကာင္ကို ဆင့္ေခၚလုိက္မွာျဖစ္ပါတယ္။ အထိေရာက္ဆုံး အားသာခ်က္တစ္ခုကေတာ့ အသုံးျပဳလုိက္တဲ့ 600 AoE အတြင္းက Enemy Unit ေတြအားလုံးကုိ Magic Immune Piercing 1 second Stun ကုိ သတ္ေရာက္ေစမယ့္ အခ်က္ပဲျဖစ္ပါတယ္။ Golem ဟာ 33% Magic Resistance, 6/ 9/ 12 Armor နဲ႕ 75/ 100/ 125 Damage ရွိျပီး Flaming Fist နဲ႕ Permanent Immolation ဆုိတဲ့ Ability ၂ ခုလည္း ပါဝင္ပါေသးတယ္။ Flaming Fist ကေတာ့ 40% Chance ရွိေသာ 80/ 115/ 150 Pure Damage ကုိ အတုိက္ခုိက္ခံရေသာ Unit အပါအဝင္ 300 AoE အတြင္းက Enemy Unit အားလုံးကုိ သတ္ေရာက္ေစမယ့္ Ability ျဖစ္ျပီး Permanent Immolation ကေတာ့ Radiance ကဲ့သုိ႔ Golem ရဲ႕ 300 AoE အတြင္းမွာ 30/ 40/ 50 Magical Damage မ်ား ေလာင္ကြ်မ္းေနေစမယ့္ Ability တုိ႔ျဖစ္ပါတယ္။ Aghanim’s Scepter ဆက္ခြင့္ရွိျပီး Golem ၂ ေကာင္ျဖစ္သြားေစမွာျဖစ္သလုိ Golem တစ္ေကာင္စီဟာ Gold Bounty တစ္ဝက္ဆီ ခြဲေဝသြားမွာျဖစ္ျပီး Physical Damage ကုိေတာ့ 75% စီ (56/ 75/ 94) ခြဲသြားမွာျဖစ္ပါတယ္။"
			}
		]
 },
	{
		"share_hero":"https://web.facebook.com/yahooyeehadotasuggestion/posts/536960869788119",
		"hero_intellgience":"27 + 3.20",
		"hero_agility":"16 + 1.50",
		"hero_strength":"18 + 1.50",
		"hero_damage":"13 - 31",
		"hero_movement_speed":"295",
		"hero_armor":"1.24",
		"hero_name":"Lina",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/lina_vert.jpg",
		"hero_role":"Ranged - Support - Carry - Nuker - Disabler",
		"hero_detail":"Background Story\nသမပုိင္းဇုန္တစ္ခုမွ အတူတကြ ေမြးဖြားၾကီးျပင္းလာတဲ့ Linaနဲ႕ Rylaiတုိ႔ ႏွစ္ေယာက္ဟာငယ္စဥ္ကေလးဘဝကတည္းကတစ္ဦးနဲ႕တစ္ဦးယွဥ္ျပဳိင္ရင္း ၾကီးျပင္းအရြယ္ေရာက္လာတဲ့ ညီအစ္မ ႏွစ္ဦးပဲျဖစ္ပါတယ္။သူတုိ႔ႏွစ္ဦးရဲ႕ ျပဳိင္ဆုိင္မႈမွာရုိးသားျဖဴစင္ျပီးအျပစ္ကင္းတဲ့ Rylaiအေပၚကုိပါးနပ္စြာအကြက္က်က်စီစဥ္ျပီးဗုိလ္က်တတ္တဲ့ Lina က မ်ားေသာအားျဖင့္ အသာစီးရေလ့ရွိပါတယ္။ ဒီလုိအသြင္မတူတဲ့ ညီအစ္မ ႏွစ္ေယာက္ကုိတစ္ေယာက္တစ္ေနရာဆီခြဲထားဖုိ႔ အၾကံညဏ္မရခင္ အခ်ိန္အတြင္းမွာပဲဒုကၡေပါင္းစုံခံခဲ့ရတဲ့ ကေလးႏွစ္ေယာက္ရဲ႕ မိဘႏွစ္ပါးဟာသူတုိ႔ ပုိင္တဲ့ တစ္ဒါဇင္ခန္႔ရွိေသာလယ္ယာ၊ အိမ္ယာ၊ အေဆာက္အအုံမ်ားအားလုံးဟာလည္းတစ္ဝက္ခန္႔ မီးေလာင္ျပာက်ကာ၊ က်န္ဒါဇင္ဝက္ဟာလည္းေရခဲမ်ားခဲကာပ်က္ဆီးဆုံးရႈံးခဲ့ရပါတယ္။ အစ္မၾကီးျဖစ္တဲ့ Linaကေတာ့ ေဝးလံလွတဲ့ ေတာင္ပုိင္းရွိ Misrule ကႏ ၱရ မွာေနတဲ့ စိတ္ရွည္သည္းခံတတ္ေသာအေဒၚျဖစ္သူထံသုိ႔ ပုိ႔ေဆာင္ျခင္းခံလုိက္ရျပီးထာဝစဥ္မီးေတာက္ေလာင္ေနတဲ့ Linaအတြက္ ဒီရာသီဥတုဟသက္ေတာင့္သက္သာရွိလွပါတယ္။ ပ်င္းရိျငီးေငြ႕ဖြယ္တိတ္ဆိပ္လွတဲ့ ဒီေဒသအတြက္ကုိLinaေရာက္ေရာက္လာျခင္းမွာမ်က္ႏွာပန္းလွေစခဲ့တဲ့အခ်က္ေတြကေတာ့ ေဒသခံေတြရဲ႕ မ်က္ခုံးေမြးေတြ ေလာင္ကြ်မ္းသြားေစရုံမကဘဲလက္ေခ်ာင္းေတြ မီးေလာင္ျပာက်သြားေစတဲ့အထိသူမကုိေၾကာက္ရြံ႕သြားေစျခင္းပဲျဖစ္ပါတယ္။ သူမရဲ႕ ေလာင္ကြ်မ္းမႈကုိမည္သူတစ္ဦးတစ္ေယာက္ကမွ ေလ်ာ့က်သြားေအာင္ မတားဆီးနုိင္ျခင္းကုိLinaဟာအင္မတန္ ဂုဏ္ယူလ်က္ရွိပါေတာ့တယ္။",
		"hero_overview":"Linaဟာ 1989 ခုႏွစ္ကထြက္ရွိခဲ့တဲ့ နာမည္ၾကီးဂ်ပန္ Anime တစ္ခုျဖစ္ေသာ The Slayer ဇာတ္လမ္းတြဲထဲကအဓိက Character တစ္ေကာင္ျဖစ္တဲ့ လူငယ္ေမွာ္ဆရာမLina Inverse ကုိကုိယ္စားျပဳေရးဆြဲခဲ့တာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Frozen Throne DotaမွာLinaရဲ႕ အမည္ဟာLina Inverse The Slayer ျဖစ္ရျခင္းျဖစ္ပါတယ္။ Suggested Item ေတြထဲမွာမပါဝင္ေပမယ့္ Linaရဲ႕ Fiery Soul ေၾကာင့္ Attacker Item ေတြ ကုိလည္းပြဲအေျခအေနေပၚလုိက္ျပီးထည့္သြင္းေဆာ့ကစားၾကပါတယ္။ ဒီအေျခအေနမ်ဴိးမွာခပ္ေပ်ာ့ေပ်ာ့ Hero တစ္ေကာင္ျဖစ္တဲ့ Linaကုိ Attribute တက္ေစမယ့္ Skadi, Satanic တုိ႔ကုိေရြးခ်ယ္နုိင္ပါတယ္။ တကယ္လုိ႔သင္ကGankerအေနနဲ႕ေဆာ့ကစားမယ္ဆုိရင္ေတာ့ Dagon + Ethereal Blade ကုိတြဲဖက္အသုံးျပဳႏုိင္ေပမယ့္ Aghanim’s Scepter ေရြးခ်ယ္မယ္ဆုိရင္ေတာ့ Ethereal Blade ကုိေရွာင္သင့္ပါတယ္။ (Pure Damage ဟာ Ghost Form ကုိ Magic Damage Amplify မျဖစ္ေစပါဘူး။) Enemy Team မွာအရမ္းထိမ္းရခက္တဲ့ Carry တစ္ေကာင္ပါလာရင္ေတာ့ Refresher Orb + Aghanim’s Scepter အသုံးျပဳျခင္းက 1900 Pure Damage Output ကုိရရွိေစမွာျဖစ္လုိ႔ အေျခအေနေပၚမူတည္ျပီးစဥ္းစားနုိင္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူမိမိႏွစ္သက္ေသာကစားကြက္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Dragon Slave",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/lina_dragon_slave_hp1.png",
				"spell_overview":"AoE Nuke Ability တစ္ခုျဖစ္တဲ့ Dragon Slave ကုိေတာ့ Linaကစားသမားအမ်ားစု က ဦးစားေပးတင္ေလ့ရွိပါတယ္။ Speed 1200 ရွိျပီး Distance 1275 အထိသြားနုိင္တဲ့ Dragon Slave ဟာေနာက္ဆုံးအဆင့္ 320 Damage နဲ႕ 8.5 Seconds Cooldownသာရွိတဲ့ Base Ability တစ္ခုျဖစ္ပါတယ္။ အခုေနာက္ပုိင္း Mid Lane ကစားႏႈန္းသိသိသာသာတက္လာတဲ့ Linaအေနနဲ႕ တစ္ဖက္အသင္းရဲ႕ Mid lanerကုိအလြယ္ကူဆုံး harassment လုပ္နုိင္ရုံမက Early Farming အတြက္လည္းလြန္စြာထိေရာက္မႈရွိပါတယ္။"
			},
			{
				"spell_name":"Light Strike Array",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/lina_light_strike_array_hp1.png",
				"spell_overview":"Light Strike Array ကေတာ့ စုစုေပါင္းDelay 0.95 second ရွိလုိ႔ Eul Specter နဲ႕ တြဲဖက္ အသုံးျပဳၾကျပီးေသခ်ာတဲ့ Disable ကုိရယူေလ့ရွိတဲ့ Ability ျဖစ္ပါတယ္။ Cyclone ဟာ 2.5 seconds ၾကာခ်ိန္ရွိလုိ႔ Enemy Unit ကုိအသုံးျပဳျပီး 1.5 second ဝန္းက်င္ေလာက္မွာ Cyclone ေအာက္ေျခကို Light Strike Array ကုိအသုံးျပဳေပးမယ္ရမွာျဖစ္ပါတယ္။ Disable ၾကာခ်ိန္ဟာလည္း 1.6 seconds ကေန 2.5 seconds အထိတုိးလာမွာျဖစ္ပါတယ္။ အခုေနာက္ဆုံးထြက္ထားတဲ့ v6.85 မွာေတာ့ Damage ကုိ Rescale ျပန္လုပ္ထားလုိ႔ ယခင္ကထက္ 40 Damage ေတာင္ နည္းသြားျပီျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Fiery Soul",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/lina_fiery_soul_hp1.png",
				"spell_overview":"Fiery Soul ဟာLinaရဲ႕ Ability ၃ ခုထဲကတစ္ခုခုကုိသုံးလုိက္တုိင္း MS 5%/6%/7%/8% နဲ႕ Attack Speed 40/55/70/85 တုိးလာေစမွာျဖစ္ပါတယ္။ ၾကာခ်ိန္ကေတာ့ 10 Seconds ရွိျပီး Ability တစ္ခုအသုံးျပဳလုိက္တုိင္းအဆုိပါ Duration ကုိ 10 seconds ျပန္ျဖစ္သြားေစမွာျဖစ္ပါတယ္။ ဒါေပမယ့္ ဒီ Bonus မ်ားဟာ 3 stacks Maximum သာရွိမွာျဖစ္ပါတယ္။ (Refresher Orb အသုံးျပဳျပီး Ability ၆ ခါအသုံးျပဳလုိ႔ ၤFiery Soul တုိးလာမွာမဟုတ္ပါဘူး။) ဒါေၾကာင့္ ေနာက္ဆုံးအဆင့္မွာ 3 Stacks အထိရွိခဲ့မယ္ဆုိရင္ 24% Movement Speed Bonus နဲ႕ 225 Attack Speed Bonus တုိ႔ ရရွိေနမွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Laguna Blade",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/lina_laguna_blade_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ Single Target Massive Nuke Ability ျဖစ္ေသာ Ultimate Laguna Blade ကေတာ့450/650/850 Magical Damage ျဖင့္ တုိက္ခုိက္နုိင္မွာျဖစ္ပါတယ္။ Magic Immune ဟာDotaရဲ႕ အသက္ျဖစ္လာတဲ့ေနာက္ပုိင္းမွာ Magic Immune ကုိတုိက္ခုိက္နုိင္မယ့္ Ability ေတြဟာလည္းတျဖည္းျဖည္းနဲ႕မ်ားျပားလာပါတယ္။ ဒီထဲမွာLinaရဲ႕ Ultimate Laguna Blade ဟာAghanim’s Scepter ဆက္လုိက္မယ္ဆုိရင္ Magical Type ကေန Pure Damage Type ကုိေျပာင္းလဲသြားမွာျဖစ္ျပီး Magic Immune Unit ေတြကုိထုိးေဖာက္တုိက္ခုိက္ႏုိင္စြမ္းရွိသြားမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Aghanim’s Scepter ဟာလည္းLinaရဲ႕ ဒုတိယေျမာက္ လူၾကဳိက္အမ်ားဆုံး Item ျဖစ္လာပါတယ္။"
			}
		]
	},
	{
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/539447319539474",
		"hero_intellgience":"25 + 2.80",
		"hero_agility":"15 + 1.60",
		"hero_strength":"14 + 1.80",
		"hero_damage":"18 - 32",
		"hero_movement_speed":"335",
		"hero_armor":"1.1",
		"hero_name":"Keeper of the Light",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/keeper_of_the_light_vert.jpg",
		"hero_role":"Ranged - Support - Nuker - Disabler - Jungler",
		"hero_detail":"Background Story\nအဆုံးမရွိေသာ ေနမင္းတုိ႔ရဲ႕ အလင္းေရာင္ကုိ Keeper of the Light ဟာ ျဖဴဖတ္ျဖဴေလ်ာ္ ျမင္းတစ္စီးကုိ စီးနင္းလ်က္ ေစာင့္ေရွာက္လ်က္ရွိပါတယ္။ Ezalor ဟာ စၾကာဝဠာမျဖစ္ေပၚခင္ကတည္းက ဟန္ခ်က္ညီစြာ ယွဥ္တြဲျဖစ္တည္လ်က္ရွိေသာ သဘာဝတရားအားလုံးရဲ႕ မူလအစ ကမာၻၾကီးကေန လြတ္ေျမာက္လာတဲ့ စြမ္းအင္ၾကီး တစ္ခုျဖစ္ပါတယ္။ သူ႔ျဖစ္တည္မႈရဲ႕ ဆုလာဒ္မ်ားကုိ ေရာင္စဥ္ျဖာထြက္ေနတဲ့ ေတာင္ေဝွးရဲ႕ အစြန္းတစ္ဖက္မွာ သိမ္းစည္းထားျပီး သူဟာ စၾကာဝဠာၾကီးအတြင္းက ကမာၻ၊ ကမာၻတုိင္းအေပၚက ျဖစ္တည္မႈတစ္ခုျဖစ္တဲ့ အေမွာင္ထု (Chaos) ရဲ႕ ေရွ႕ကေန ေစာစီးစြာ ေျခတစ္လွမ္းသာေနေလ့ ရွိတဲ့ တစ္လက္လက္ေတာက္ပေနေသာ ေရာင္နီဦး အလင္းေရာင္တစ္ခုလည္း ျဖစ္ေနခဲ့ပါတယ္။ သူ႔ရဲ႕ စစ္မွန္တဲ့ စြမ္းအားမ်ားကုိ ျမင္းကုန္းနီွးေပၚမွာ အားအင္ခ်ိနဲ႕စြာ ထုိင္ေနေသာ အဖိုးအုိတစ္ဦး သဖြယ္ အေပၚပုိင္းအသြင္သ႑န္ကုိ ၾကည့္ရုံနဲ႕ သိနုိင္မွာမဟုတ္ပါဘူး။ မည္သုိ႔ပင္ဆုိေစကာမူ သူဟာ အေမွာင္ထုရဲ႕ စိန္ေခၚမႈကုိ ထိပ္တုိက္ရင္ဆုိင္ရေတာ့မယ့္ အခါမွာေတာ့၊ ေပါက္ကြဲထြက္လာမယ့္ အလုံးစုံေသာ အလင္းေရာင္တုိ႔ရဲ႕ ျဖစ္တည္မႈ တုိ႔နဲ႕အတူ Ezalor ရဲ႕ မူလအသြင္သ႑န္ကုိ တဖန္ျပန္လည္ ေျပာင္းလဲကာ ၄င္းရဲ႕ စြမ္းအားအျပည့္အစုံ ထုတ္ေဖာ္ျပသမွာ အေသအခ်ာပါပဲ။",
		"hero_overview":"1 minutes Radiance = Lancer + Keeper ဆုိတဲ့ အတြဲကေတာ့ Dota 1 ေခတ္ကတည္းက လူသိမ်ားခဲ့တဲ့ Flow တစ္ခုျဖစ္ပါတယ္။ Kotl ရဲ႕ Chakra Magic ဟာ မိမိ Lane က Hero ရဲ႕ Spamming Spell ေတြအတြက္ မ်ားစြာအေထာက္အကူျပဳလုိ႔ Lancer ကဲ့သုိ႔ Long Range Nuker မ်ားျဖစ္တဲ့ Sven, Vengi, Earthshaker, Kotl ဟာ Jungle ေဆာ့လုိ႔ရတဲ့ Hero တစ္ေကာင္လည္း ျဖစ္ျပီး Jungler ေတြထဲက Sand King နဲ႕ ကစားပုံ အနည္းငယ္ဆင္တူပါတယ္။ Neutral Creeps Stack ထားျပီး Illuminate ၁ ေခါက္ကုိ Camp ၂ ခု ထိေအာင္ အသုံးျပဳနုိင္မယ့္ Long Range Nuke Ability နဲ႕ Chakra Magic တုိ႔ေၾကာင့္ မိမိဘာသာ Jungle ေဆာ့နုိင္ေပမယ့္ Lane ေပၚေနရင္း Babysitter သဖြယ္ေဆာ့ရတာ ပုိျပီး ထိေရာက္ပါတယ္။ ပုိက္ဆံရွာရလြယ္တဲ့ Kotl ကုိ မ်ားေသာအားျဖင့္ Boots of Travel ေရြးခ်ယ္ၾကပါတယ္။ ဒါေပမယ့္ Mana မပူရတဲ့အတြက္ Tranquil Boots, ပြဲေနာက္ပုိင္းအတြက္ Guardian Greaves တုိ႔ကိုလည္း စဥ္းစားနုိင္ပါတယ္။ Kotl ဟာ Teamfight ရဲ႕ ေနာက္မွာ ေနရတဲ့ သေဘာရွိလုိ႔ Enemy Team ရဲ႕ Spell Caster ေတြရန္ကေန လြတ္ေလ့ရွိေပမယ့္ Battle ေက်ာ္ျပီး သတ္မယ့္ Hitter ေတြကုိေတာ့ ေၾကာက္ရပါတယ္။ Force Staff + Ghost Stick ကုိ Escape အျဖစ္ ေရြးခ်ယ္ႏုိင္ျပီး Necronomicons, Dagon တုိ႔ကုိေတာ့ Mid Game လိုအပ္ခ်က္အတြက္ စဥ္းစားနုိင္ပါတယ္။ ပြဲၾကားလာရင္ေတာ့ Support Role အတုိင္း Vyse, Shiva, Pipe, Discord တုိ႔သာမက မိမိစိတ္တုိင္းက် Item Build ကုိ ေရြးခ်ယ္နုိင္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သာလွ်င္ မိမိအတြက္အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Illuminate",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/keeper_of_the_light_illuminate_hp1.png",
				"spell_overview":"Kotl ရဲ႕ အဓိက Nuke Ability ျဖစ္တဲ့ Illuminate ကေတာ့ Dota ထဲက Ultimate မဟုတ္တဲ့ Ability ေတြထဲမွာ AoE အၾကီးဆုံးနဲ႕ Damage အမ်ားဆုံး Ability တစ္ခုလည္းျဖစ္ပါတယ္။ အားနည္းခ်က္အျဖစ္ Kotl ဟာ Channeling လုပ္ေနရမွာျဖစ္လုိ႔ အေစာပိုင္းမွာ ေနရာယူမွန္ျပီး ေခ်ာင္းေျမာင္းအသုံးျပဳတတ္ဖုိ႔ လုိအပ္ပါတယ္။ အနည္းဆုံး 30 Damage နဲ႕ အစျပဳမွာျဖစ္ျပီး 0.1 second တုိင္းမွာ 10 Damage ဆီတုိးလာမွာျဖစ္ျပီး အမ်ားဆုံး ယူထားတဲ့အဆင့္အလုိက္ Channeling Time က 2/3/4/5 seconds ျဖစ္လာမွာျဖစ္ျပီး Damage ကလည္း 200/300/400/500 Damage အထိ တုိးလာပါမယ္။ 350 AoE အေနနဲ႕ 1900 Distance အထိ အကြာအေဝးေရာက္ႏုိင္တဲ့ Illuminate ဟာ သြားရာလမ္းေၾကာင္းတစ္ေလွ်ာက္ Channeling စတင္ခ်ိန္ကေန အဆုံးသတ္ထြက္သြားခ်ိန္အထိ Flying Vision ကုိလည္း ရရွိေစမယ့္ Ability တစ္ခုျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Mana Leak",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/keeper_of_the_light_mana_leak_hp1.png",
				"spell_overview":"Bloodseeker ရဲ႕ Ultimate Rupture နဲ႕ သေဘာတရားျခင္း ဆင္တူတဲ့ Mana Leak ကေတာ့ အသုံးျပဳခံရတဲ့ Enemy Hero ရဲ႕ ေရြ႕လ်ားမႈတုိင္းမွာ Hp မေလ်ာ့ပဲ Mana ေတြသာ ေလ်ာ့သြားေစမယ့္ Ability ျဖစ္ပါတယ္။ Percentage ပုံစံ နဲ႕ တြက္ခ်က္တဲ့အတြက္ Mana Pool အနည္းအမ်ားနဲ႕ မဆုိင္ဘဲ အသုံးျပဳခံရတဲ့ Unit ဟာ 20 Distance ေရြ႕လ်ားလုိက္တုိင္း စုစုေပါင္း Mana Pool ရဲ႕ 1% ေသာ Mana ေတြ ကုန္ဆုံးေနမွာျဖစ္ပါတယ္။ Duration ထဲမွာ Mana Pool ထဲက Mana Zero ျဖစ္သြားခဲ့မယ္ဆုိရင္ေတာ့ 1.5/ 2/ 2.5/ 3 Seconds Stun သတ္ေရာက္ေစပါလိမ့္မယ္။ ဒါေပမယ့္ အသုံးျပဳခံရတဲ့ Unit ဟာ 0.01 second အတြင္းမွာ 300 Distance ထက္ပုိေဝးေအာင္ ေရြ႕လ်ားျခင္းတစ္ခုခု ျပဳလုပ္ခဲ့မယ္ဆုိရင္ Mana Leak တြက္ခ်က္မွာမဟုတ္ပါဘူး။ ဆုိလုိသည္ကေတာ့ 300 Distance ထက္ ပုိေဝးတဲ့ ေရြ႕လ်ားမႈမ်ားျဖစ္တဲ့ Town Portal, Blink, Glimpse, X-Mark the Spot ကဲ့သုိ႔ေသာ Ability မ်ားေၾကာင့္ Mana Burn တြက္ခ်က္မွာမဟုတ္ပါဘူး။"
			},
			{
				"spell_name":"Chakra Magic",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/keeper_of_the_light_chakra_magic_hp1.png",
				"spell_overview":"Ezalor ရဲ႕ လူၾကဳိက္အမ်ားဆုံး၊ အထူးသျဖင့္ Ally Hero တုိ႔ရဲ႕ အၾကဳိက္ဆုံး Ability တစ္ခုျဖစ္တဲ့ Chakra Magic ကေတာ့ ရုိးရွင္းတဲ့ Mana ျပန္ျဖည့္ေပးတဲ့ Ability တစ္ခုျဖစ္ပါတယ္။ ယခင္က 75/ 150/ 225/ 300 Mana ရုိးရွင္းစြာ ျပည့္ခဲ့ေပမယ့္ v6.84 ကေန စျပီး Cooldown Reduction Buff တစ္ခု ထည့္သြင္းေပးလုိက္ပါတယ္။ Hero တစ္ေကာင္ဟာ Chakra Magic ျဖည့္ခံရျပီးေနာက္ ပထမဆုံး အသုံးျပဳမယ့္ Ability ဟာ ေနာက္တစ္ခါ ျပန္လည္ အသုံးျပဳဖုိ႔ Cooldown 2/3/4/5 seconds ေလ်ာ့နည္းသြားမွာျဖစ္ပါတယ္။ ဥပမာအေနနဲ႕ - Earthshaker ရဲ႕ Fissure ဟာ 15 seconds Cooldown ရွိပါတယ္။ Chakra Magic ျဖည့္ေပးလုိက္ျပီးေနာက္ Earthshaker ဟာ ပထမဆုံးအေနနဲ႕ Echo Slam, Enchant Totem တုိ႔ကို မသုံးပဲ Fissure ကုိ အသုံးျပဳလိုက္မယ္ဆုိရင္ ေနာက္တစ္ခါ Fissure ကုိ အသုံးျပဳဖုိ႔ Cooldown 5 seconds ေလ်ာ့နည္းသြားမွာျဖစ္လုိ႔ 10 seconds Cooldown သာ ေစာင့္ရမွာျဖစ္ပါတယ္။ အလားတူ Chakara ျဖည့္ျပီးေနာက္ Enchant Totem ကုိ အသုံးျပဳခဲ့မယ္ဆုိရင္ ေနာက္တစ္ခါ Enchant Totem သုံးဖုိ႔ 0 second သာ Cooldown ေစာင့္ရပါလိမ့္မယ္။ Ezalor ဟာ မိမိကုိယ္ကုိ အသုံးျပဳျပီး Cooldown ေလ်ာ့ခ်နုိင္တဲ့အျပင္ မိမိ Team အတြက္ အသုံးဝင္မယ့္ Ability Caster တစ္ေကာင္ရဲ႕ Spell တစ္ခုကုိ Cooldown 5 seconds ေလ်ာ့ခ်ေပးနုိင္တဲ့အတြက္ ကစားပြဲတစ္ခုကုိ အေျပာင္းအလဲ ျဖစ္ေစဖုိ႔ လုံေလာက္တဲ့ အားသာခ်က္တစ္ခုျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Recall",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/keeper_of_the_light_recall_hp1.png",
				"spell_overview":"ကမာၻေက်ာ္ The Lord of the Rings ရုပ္ရွင္ကားထဲက အဓိက ဇာတ္ေကာင္တစ္ေယာက္ျဖစ္တဲ့ Gandalf ရဲ႕ သြင္ျပင္မ်ားစြာကုိ ကုိယ္စားျပဳထားတဲ့ Ezalor ဟာ v6.81 ကေန စျပီး သူ႕ရဲ႕ Ultimate Spirit Form ကုိ Aghanim’s Scepter Upgradeable သတ္မွတ္ေပးခဲ့ပါတယ္။ ပုံမွန္ 40 seconds Duration ကေန Permanent Spirit Form ကုိ ရရွိေစမယ့္ ဒီ Aghanim’s Upgrade ဟာ Ezalor ကစားသမားတုိင္း ဆက္သင့္တဲ့ Item တစ္ခုဆုိလည္း မမွားပါဘူး။ Spirit Form ဟာ Blinding Light နဲ႕ Recall ဆုိတဲ့ Ability ၂ ခုကုိ ရရွိေစျပီး Illuminate ကုိ Spirit Form က ကိုယ္စား Channeling လုပ္ေပးမယ့္ အားသာခ်က္မ်ား ပုိင္ဆုိင္ထားပါတယ္။ Aghanim’s Scepter ရရွိျပီးရင္ေတာ့ အေပၚက အက်ဴိးသတ္ေရာက္မႈေတြအျပင္ ေန႔ဘက္မွာ ရမယ့္ အားသာခ်က္ေတြအျဖစ္ 1800 AoE Flying Vision နဲ႕ Illuminate က Healing ျဖစ္ေစမယ့္ စတဲ့ Effect ၂ ခုပါ တုိးလာမွာျဖစ္ပါတယ္။ ေန႔ဘက္မွာ မိမိရဲ႕ Illuminate သြားရာလမ္းေၾကာင္းတစ္ေလ်ာက္မွာ ရွိမယ့္ Enemy Hero မ်ားကုိ Damage သတ္ေရာက္ေစမွာျဖစ္သလုိ အဆုိပါ Damage ပမာဏအတုိင္း လမ္းေၾကာင္းအတြင္းက Ally မ်ားကုိ Heal ေစမွာျဖစ္ပါတယ္။ 675 AoE ရွိတဲ့ Blinding Light ဟာ AoE အတြင္းက Enemy Unit တုိင္းကုိ ေနာက္ဘက္ 400 Disatance ကုိ ေရြ႕ေစမွာျဖစ္လို႔ Mana Leak ထားတဲ့ Unit ကုိ 20% Mana ကုန္ေစမွာျဖစ္ပါတယ္။ အဓိကအက်ဆုံးကေတာ့ 4/5/6 seconds ၾကာျမင့္မယ့္ 80% Miss Chance ကုိ Enemy မ်ား ခံစားရမယ့္ အခ်က္ပါပဲ။ ရုိးရွင္းတဲ့ Recall ကေတာ့ မိမိ Ally Hero ကုိ 5/4/3 seconds အၾကာမွာ မိမိအနားေရာက္ေအာင္လွမ္းေခၚေပးမွာျဖစ္ျပီး အဆုိပါ Recall Time မွာ Player Damage သတ္ေရာက္ခဲ့ရင္ေတာ့ Recall ရပ္တန္႔သြားပါလိမ့္မယ္။"
			}
		]
	},
	{
		"share_hero":"https://web.facebook.com/yahooyeehadotasuggestion/posts/516921568458716",
		"hero_intellgience":"25 + 2.60",
		"hero_agility":"20 + 2.20",
		"hero_strength":"18 + 1.40",
		"hero_damage":"19 - 29",
		"hero_movement_speed":"295",
		"hero_armor":"1.8",
		"hero_name":"Ancient Apparition",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/ancient_apparition_vert.jpg",
		"hero_role":"Ranged - Support - Disabler - Nuker",
		"hero_detail":"Background Story\nKaldr, The Ancient Apparition ဟာ အခ်ိန္ကာလယႏ ၱယားရဲ႕ အျပင္ဘက္မွာ ျဖစ္ေပၚလာတဲ့ ပုံရိပ္သ႑န္ တစ္ခုျဖစ္ပါတယ္။ သူဟာ စၾကဝဠာၾကီး ျဖစ္ေပၚမလာခင္ကတည္းက ေအးခဲျပီး အဆုံးမရွိတဲ့ ဟင္းလင္းျပင္ေနရာလြတ္အတြင္းမွာ ေပၚထြက္လာျခင္းျဖစ္ျပီး စၾကဝဠာၾကီး အဆုံးသတ္သြားမယ့္အခ်ိန္အထိ တည္ရွိေနမွာျဖစ္ပါတယ္။ အတိတ္၊ ပစၥဳပၸန္၊ အနာဂတ္မွာ ကြ်န္ေတာ္တုိ႔ ထင္မွတ္ထားတဲ့အတုိင္း အားလုံးရဲ႕ မ်က္စိေရွ႕ေမွာက္ကုိ စြမ္းအားျပည့္ဝျပီး ေမွးမွိန္ေနခဲ့တဲ့ အမွန္တရားရဲ႕ ပဲ့တင္သံတုိ႔နဲ႕အတူ ထာဝရ Kaldr ဟာ ေရာက္ရွိလာခဲ့ပါတယ္။ အမ်ားစုကေတာ့ ျပီးျပည့္စုံတဲ့ စၾကာဝဠာၾကီးရဲ႕ အဆုံးသတ္ခ်ိန္ကုိ တျဖည္းျဖည္းခ်ဥ္းကပ္လာတာနဲ႕အမွ် Kaldr ရဲ႕ ရုပ္သြင္ဟာ ပုိမုိ ငယ္ရြယ္၊ ပ်ဴိျမစ္၊ သန္မာ လာကာ အစဥ္ထာဝရ အဆုံးမရွိျခင္းအျဖစ္သုိ႔ ေရာက္သြားမွာျဖစ္တယ္လုိ႔ ထင္မွတ္ထားပါတယ္။ သူ႕ရဲ႕ ေအးခဲေသာ လက္အစုံဟာ အရာဝတၱဳမ်ားရဲ႕ ထာဝရ ရပ္တန္႔ျခင္းကုိ ေဖာ္ေဆာင္ေပးသြားမွာျဖစ္ျပီး သူ႔သ႑န္ဟာလည္း မခံရပ္ႏုိင္ေလာက္တဲ့ အလင္းေရာင္ေတြ နဲ႕ ေတာက္ပလာမွာျဖစ္ပါတယ္။ Kaldr The Ancient Apparition ဟာ သာမန္ အသြင္သ႑န္ကေလး တစ္ခုမွ်သာ မဟုတ္ေတာ့ပါဘူး။",
		"hero_overview":"Kaldr ရဲ႕ Ability ဖြဲ႕စည္းပုံဟာ အေစာပုိင္းမွာ တစ္ကုိယ္ေတာ္ လႈပ္ရွားရတာထက္ Ally တစ္ေကာင္ေကာင္နဲ႕ တြဲသုံးျခင္းက မ်ားစြာအက်ဴိးရွိေစပါတယ္။ Vengiful Spirit, Sven, Ogre Magi, Lion စတဲ့ Ganking Support Hero ေတြနဲ႕ Roamer ပုံစံ ေဆာ့ခဲ့မယ္ဆုိရင္ တစ္ဖက္အသင္းရဲ႕ Mid Lane နဲ႕ Safe Lane က Core Hero ေတြဟာ မ်ားစြာဒုကၡေရာက္သြားနုိင္တဲ့အတြက္ တကယ္လုိ႔သင္က Clan တစ္ခုသက္သက္မွတ္မွတ္ရွိျပီး Support ကစားတဲ့သူျဖစ္မယ္ဆုိရင္ ေလ့က်င့္သင့္တဲ့ Hero စာရင္းထဲမွာ Kaldr ကုိ ထည့္ထားသင့္ပါတယ္။ Kaldr ကစားသမားတစ္ေယာက္အေနနဲ႕ အဓိကအက်ဆုံးလိုအပ္ခ်က္မွာ Map Awareness နဲ႕ Timing Skill ပဲျဖစ္ပါတယ္။ 1500 Speed ရွိတဲ့ Ultimate ကို ရုတ္တရက္ဝင္ေရာက္တုိက္ခုိက္မယ့္ Battle တစ္ခုအတြင္း မိမိ Ally ေတြနဲ႕အတူ အခ်ိန္အတိအက် က်ေရာက္ေအာင္ သုံးႏုိင္ဖုိ႔ အတန္အသင့္ ေလ့က်င့္ထားဖုိ႔လုိျပီး ေလ့က်င့္ရင္က်င့္သေလာက္ အက်ဴိးရွိမယ့္ Wombo Combo စာရင္းထဲမွာလည္းပါဝင္ပါတယ္။ Hp နည္းလြန္းတဲ့အတြက္ အေစာပုိင္း Roamer ပုံစံေဆာ့တဲ့အခါမွာ တစ္ဖက္ Hero က ျပန္လည္တုိက္ခုိက္ခံရတဲ့ အေျခအေနမ်ဴိးမွာ မေသရေလေအာင္ ေနတတ္ထုိင္တတ္ဖုိ႔လည္း အလြန္အေရးၾကီး ပါတယ္။\n\nKaldr The Ancient Apparition ဟာ Strong ျဖစ္တဲ့ Hero ျဖစ္တာနဲ႕အညီ ကြ်မ္းကြ်မ္းက်င္က်င္ကုိင္တတ္နုိင္ဖုိ႔ အခ်ိန္ေပးေလ့က်င့္ဖုိ႔ လုိအပ္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ မိမိအသင္းအတြက္ မ်ားစြာအသုံးတည့္မယ့္ Support, Ganker, Initiator Hero တစ္ေကာင္အျဖစ္ စာရင္းလ်ာ ထားႏုိင္ပါတယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Cold Feet",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_cold_feet_hp1.png",
				"spell_overview":"Side Lane မွာ မိမိဘက္က Disable Hero တစ္ေကာင္ေကာင္သာ ပါဝင္ခဲ့မယ္ဆုိရင္ အလြယ္တကူ Hero Kill Combo ကုိ ရရွိေစမယ့္ Cold Feet ဟာ Disable Ability တစ္ခုျဖစ္ပါတယ္။ Enemy ဟာ အသုံးျပဳခံရတဲ့ေနရာကေန 4 seconds အတြင္း 740 Range ထက္ ပုိေဝးေအာင္ မေျပးနုိင္ဘူးဆုိရင္ Disable ကို ျဖစ္ေပၚေစမွာျဖစ္ျပီး မ်ားမ်ားယူေလေလ Cooldown က်ျပီး Disable Duration ၾကာမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ အေစာပုိင္းမွာ Slow သုိ႔မဟုတ္ Disable Ally Hero ေတြနဲ႕သာ တြဲဖက္ထားမယ္ဆုိရင္ အေစာပုိင္း Easy Kill ကုိ ပုိင္ဆုိင္ႏုိင္မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Ice Vortex",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_ice_vortex_hp1.png",
				"spell_overview":"ကစားပြဲရဲ႕ အလယ္ပုိင္းေလာက္မွာ အၾကီးမားဆုံး ဒုကၡေပးမယ့္ Ice Votex ကေတာ့ အသုံးျပဳလုိက္မယ့္ 275 AoE အတြင္းမွာ Movement Speed Slow နဲ႕ Magic Resistance ကုိ ေလွ်ာ့ခ်ေပးမွာျဖစ္ပါတယ္။ Movement Speed Slow ဟာ Ice Votex ရဲ႕ အဓိက အားသာခ်က္ျဖစ္ေပမယ့္ Cast Range 1500 ရွိျပီး 200 AoE Vision ကုိ ရရွိျခင္းေၾကာင့္ Enemy Team လႈပ္ရွားမႈကုိ အခ်ိန္တုိအတြင္း Scout ခ်ဖုိ႔အတြက္ အသုံးျပဳႏုိင္တဲ့ အားသာခ်က္လည္း ရွိပါတယ္။"
			},
			{
				"spell_name":"Chilling Touch",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_chilling_touch_hp1.png",
				"spell_overview":"ပထမဦးဆုံး lvl 1 မွာ Chilling Touch ကုိ စတင္ယူေလ့ရွိပါတယ္။ အေၾကာင္းက အသုံးျပဳလိုက္တဲ့ 525 AoE အတြင္းမွာရွိသမွ် Ally Hero မ်ားအားလုံးဟာ ေနာက္လာမယ့္ မိမိရဲ႕ Physical Attack ၃ ခ်က္မွာ 50 Magic Damage ကုိ Bonus အျဖစ္ေပါင္းေနမွာျဖစ္တဲ့အတြက္ပါပဲ။ တစ္ဖက္အသင္းက Enemy Hero ေတြကုိ ႏွိမ္ဖုိ႔အတြက္ Spell ေတြ အမ်ားၾကီး သုံးေနစရာမလုိဘဲ Physical တုိက္ခုိက္မႈနဲ႕တင္ႏွိမ္နုိင္သလုိ အေစာပုိင္း Creep Last Hit ကုိလည္း ပုိမုိက်ိန္းေသေစမွာျဖစ္ပါတယ္။ ဒါေပမယ့္ Chilling Touch ရရွိထားတဲ့ Ally Hero ဟာ -20 Attack Speed ကုိ ျဖစ္ေပၚေစမွာျဖစ္လုိ႔ အေျခအေနၾကည့္ျပီးသုံးေပးရမွာျဖစ္ပါတယ္။ v6.84 Patch မွာေတာ့ Chilling Touch ရရွိထားတဲ့ Hero တစ္ေကာင္ဟာ Attack Speed Slow မွာကုိ မလုိလားဘူးဆုိရင္ Status Bar ေပၚမွာ Chilling Touch Icon ကုိ ႏွိပ္ျပီး မိမိဘာသာ ဖ်က္ပစ္လုိက္နုိင္မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Ice Blast",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/ancient_apparition_ice_blast_hp1.png",
				"spell_overview":"Ultimate Ice Blast ဟာ Global Ability ျဖစ္တာနဲ႕အညီ ေဝးေဝးကုိ သုံးေလ AoE ၾကီးလာမွာျဖစ္ပါတယ္။ Ice Blast ထိသြားတဲ့ AoE အတြင္းမွာ Initial AoE Damage သတ္ေရာက္မွာျဖစ္ျပီး 8/9/10 seconds ၾကာမယ့္ Damage per Second ကုိလည္း ဆက္လက္ခံစားရပါမယ္။ အဓိကအားသာခ်က္ကေတာ့ အဆုိပါ Debuff Duration မွာ Healing Effect ေတြအားလုံး Disable ျဖစ္ေနမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ တစ္ဖက္အသင္းက Healer ေတြ ထုတ္လုိက္ျပီဆုိတာနဲ႕ Kaldr ဟာ ဦးစားေပးစဥ္းစားတဲ့ Hero တစ္ေကာင္ျဖစ္လာရျခင္းပါပဲ။ v6.78 ကေန စျပီး Aghanim’s Secpter ဆက္ခြင့္ရွိသြားတဲ့ Ice Blast ဟာ Duration ကုိ 17 seconds အထိၾကာေစမွာျဖစ္လုိ႔ Kaldr ဟာ Late Game အထိ အသုံးဝင္တဲ့ Support Hero တစ္ေကာင္ျဖစ္လာပါတယ္။ အဆုိပါ Debuff Duration မွာ Enemy Hero ရဲ႕ Hp ဟာ 10%/ 11%/ 12% ေအာက္ကုိ ေရာက္သြားမယ္ဆုိရင္ ေနရာမွာတင္ ခ်က္ခ်င္းေသသြားမယ့္ Physical Damage ကုိ ျဖစ္ေပၚေစဦးမွာပါ။"
			}
		]
	},
	{
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/484117011739172",
		"hero_intellgience":"26 + 3.00",
		"hero_agility":"23 + 1.70",
		"hero_strength":"16 + 1.50",
		"hero_damage":"15 - 19",
		"hero_movement_speed":"320",
		"hero_armor":"3.22",
		"hero_name":"Leshrac",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/leshrac_vert.jpg",
		"hero_role":"Ranged - Carry - Support - Nuker - Pusher - Disabler",
		"hero_detail":"Background Story\nLeshrac The Tormented Soul ဆုိတာဟာ ျဖစ္တည္မႈတစ္ဝက္၊ ေပ်ာက္ဆုံးမႈတစ္ဝက္နဲ႕ ရပ္တည္ေနတဲ့ သဘာဝတရားရဲ႕ ေၾကကြဲဖြယ္ အမွန္တရား အရင္းအျမစ္တစ္ခုပဲျဖစ္ပါတယ္။ ျဖစ္တည္မႈတုိင္းဟာ ေရွာင္လႊဲမရေသာ စက္ဆုတ္ထိတ္လန္႔ေၾကာက္ရြံ႕ဖြယ္ရာမ်ားႏွင့္သာ ျပည့္ႏွပ္ေနေၾကာင္းကုိေတာ့ သူ႕ရဲ႕ အရာရာကုိ ထုိးထြင္းသိျမင္ႏုိင္တဲ့အသိညဏ္နဲ႕ သိရွိထားသူျဖစ္ပါတယ္။ အရာဝတၱဳမ်ားအားလုံး ရဲ႕ အဓိပၸါယ္ဖြင့္ဆုိခ်က္ ကုိ နားလည္သေဘာေပါက္ဖုိ႔အတြက္ သဘာဝတရားရဲ႕ အတြင္းက်က်အရင္းအျမစ္မ်ားအထိေရာက္ေအာင္ က်ိန္စာသင့္ေနတဲ့ Chronoptic Crystals နဲ႕အတူ ရွာေဖြေလ့လာသူတစ္ေယာက္ျဖစ္ခဲ့ဖူးျပီး သူ႔ရဲ႕ ဖုံးကြယ္ထားတဲ့ အံ့ဖြယ္ရာမ်ားကုိ ရွာေဖြေတြ႕ရွိမႈေၾကာင့္ပဲ ထာဝရေျပာင္းလဲျခင္းကုိ ပုိင္ဆုိင္လုိက္ရပါေတာ့တယ္။ အခုခ်ိန္မွာေတာ့ သူ႔ရဲ႕ သိလုိစိတ္ျပင္းျပေသာ အာရုံစုိက္ကာ ထုိးထြင္းၾကည့္ရွဳျခင္း ေၾကာင့္သာလွ်င္ အနက္ရႈိင္းဆုံးမွာရွိတဲ့ အမွန္တရားကုိ အလင္းေဆာင္နုိင္ခဲ့ျခင္းျဖစ္ပါတယ္။ အျခားေသာ ရုပ္ဝတၱဳမ်ားကဲ့သုိ႔ သူဟာလည္း အလုံးစုံေသာ သဘာဝတရားမ်ားနဲ႕ ဖြဲ႕စည္းထားပါတယ္။ သုိ႔ေပမယ့္ ထိတ္လန္႔ေၾကာက္ရြံ႕ ႏွိပ္စက္ညွင္းပန္း နာက်င္ေဆြးေျမ႕ ပူေလာင္ေသာကတုိ႔နဲ႕ ျပည့္ႏွပ္ေနတဲ့ သဘာဝအမွန္တရားမ်ားပဲျဖစ္ပါတယ္။ စၾကဝဠာၾကီးရဲ႕ ဖြဲ႕စည္းျဖစ္ေပၚလာတဲ့ အမွန္တရားကုိ ရွာေဖြေတြ႕ရွိခဲ့တဲ့အတြက္ သူဟာ အထူးဆုလာဘ္အျဖစ္ အရာရာရဲ႕ ေကာက္က်စ္ရက္စက္မႈေတြကုိ သိျမင္ႏုိင္စြမ္း ရရွိခဲ့ပါေတာ့တယ္။ \n\nယခင္က Lvl 7 အေရာက္မွာ Diabolic Edict ကုိ ဂိတ္ဆုံးယူျပီး Pusher ပုံစံနဲ႕ ကစားခဲ့ၾကေပမယ့္ လက္ရွိမွာေတာ့ Split Earth နဲ႕ Lightning Storm ကုိ ဦးေအာင္ တင္ျပီး ေဆာ့တဲ့ပုံစံက ပုိအလုပ္ျဖစ္လွ်က္ရွိပါတယ္။",
		"hero_overview":"Octarine Core ကုိသာဆက္ထားခဲ့မယ္ဆုိရင္ Split Earth 6.75 Seconds cooldown, Diabolic Edict 16.5 seconds cooldown နဲ႕ Lightning Storm 3 seconds cooldown ျဖစ္သြားေစမယ့္အျပင္ Nuker တစ္ေကာင္ရဲ႕ Damage Output တုိင္းကေန Lifesteal ျပန္ရေနမွာျဖစ္လုိ႔ Leshrac ဟာ ယခင္လုိ လြယ္လြယ္ေသတဲ့ Hero တစ္ေကာင္ မဟုတ္ေတာ့ပါဘူး။ Pugna ဟာ Cripple သုတ္ျပီးမွ Nether Blast ရုိက္သလုိ Leshrac ဟာလည္း Lightning Storm ခ်ျပီးမွ Split Earth အသုံးျပဳမယ္ဆုိရင္ က်ိန္းေသေပါက္ အလြယ္တကူ ဖမ္းထားနုိင္ေတာ့မွာျဖစ္လုိ႔ လူၾကဳိက္မ်ားလာရျခင္းျဖစ္ပါတယ္။\n\nBloodstone, Eul’s Staff, Glimmer Cape, Boots of Travel, Octarine Core, Aghanim’s Scepter တုိ႔ကေတာ့ ေယဘုယ်အက်ဆုံး Item ၆ ခုျဖစ္ျပီး Shiva Guard, Scythe of Vyse, Black King Bar, Veil of Discord, Dagger, Rod of Atos တုိ႔ကုိေတာ့ ပြဲအေျခအေနေပၚ မူတည္ျပီး ထည့္သြင္းစဥ္းစားသင့္ပါတယ္။ Octarine Core ဟာ Damage သတ္ေရာက္မယ့္ တစ္ယူနစ္ တုိင္းကေန Lifesteal တြက္ခ်က္မွာျဖစ္လုိ႔ AoE Ability ေလးခုနဲ႕ ဖြဲ႕စည္းထားတဲ့ Leshrac ကေတာ့ အလုိက္ဖက္ဆုံး Hero တစ္ေကာင္ျဖစ္ေနျပီး ကစားပြဲအမ်ားစုရဲ႕ First Ban Hero ျဖစ္ေနပါေတာ့တယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Split Earth",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_split_earth_hp1.png",
				"spell_overview":"Stun Duration က 2 seconds ကေန ပုိတုိးမလာနုိင္ေပမယ့္ AoE ကေတာ့ သိသိသာသာ တုိးလာမွာျဖစ္လုိ႔ Split Earth ဟာ ဒုတိယဦးစားေပး Ability ျဖစ္လွ်က္ရွိပါတယ္။ Lightning Storm ရဲ႕ 75% Movment Speed Slow Duration ဟာ ဒီေျမပုံမွာ ေနာက္ဆုံးအဆင့္ 1 second အထိ ၾကာမွာျဖစ္လုိ႔ Split Earth ရဲ႕ Delay Time 0.37 second ကုိ ျပန္လည္ ခ်ိန္ညွိေပးမွာျဖစ္လုိ႔ လူၾကဳိက္မ်ားတဲ့ Hero တစ္ေကာင္ျပန္ျဖစ္လာပါတယ္။ Split Earth ဟာ မ်ားမ်ားယူေလ Damage တက္ေလျဖစ္ေပမယ့္ Mana Cost လည္းတက္ျပီး ထိေအာင္ သုံးဖုိ႔လည္းအသင့္အတင့္ ခက္ခဲတဲ့အတြက္ Lightning Storm ေနာက္မွ တင္တဲ့ ဒုတိယဦးစားေပးျဖစ္ရျခင္းျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Diabolic Edict",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_diabolic_edict_hp1.png",
				"spell_overview":"v6.82 ကေန စျပီး Tower အေပၚကုိ 40% ပုိျပီး Damage သတ္ေရာက္ေစမယ့္ Diabolic Edict ကေတာ့ ယခင္ Pusher ပုံစံနဲ႕ေဆာ့ခဲ့ၾကတဲ့ Leshrac Player ေတြ အၾကဳိက္ဆုံး Ability တစ္ခုျဖစ္ပါတယ္။ Leshrac ရဲ႕ 500 AoE အတြင္းက Random Unit အေပၚ 0.25 second တုိင္းကုိ 9/18/27/36 Damage စီ သတ္ေရာက္ေစမွာျဖစ္လုိ႔ Unit နည္းေလ သုံးလုိ႔ေကာင္းေလျဖစ္ေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Split Earth, Lightning Storm, Pulse Nova စတဲ့ Nuke Ability ေတြအသုံးျပဳ Creep ရွင္းျပီး Tower ကုိ လြတ္လြတ္လပ္လပ္အသုံးျပဳခဲ့မယ္ဆုိရင္ ေနာက္ဆုံးအဆင့္ စုစုေပါင္း 2016 Damage ေတာင္ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ "
			},
			{
				"spell_name":"Lightning Storm",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_lightning_storm_hp1.png",
				"spell_overview":"Cooldown 4 Seconds ပုံေသရွိတဲ့အတြက္ Mana Pool အလုံအေလာက္ရွိသြားတဲ့အခါမွာ ဆက္တုိက္အသုံးျပဳျပီးတုိက္ခုိက္နုိင္မယ့္ Nuke တစ္ခုျဖစ္လုိ႔ Item အသစ္ Octarine Core သာ ဆက္ျပီးမယ္ဆုိရင္ 3 seconds Cooldown နဲ႕ Massive Lifesteal ကုိ ျပန္လည္ရရွိေစမွာျဖစ္လုိ႔ ခတ္ေပ်ာ့ေပ်ာ့ Leshrac အတြက္ လုိက္ဖက္မႈအရွိဆုံး ေပါင္းစပ္မႈတစ္ခုျဖစ္လာခဲ့ပါတယ္။"
			},
			{
				"spell_name":"Pulse Nova",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/leshrac_pulse_nova_hp1.png",
				"spell_overview":"ယခင္ Dota 1 တုန္းက Leshrac ရဲ႕ Ultimate Pulse Nova ဟာ Invisible ျဖစ္ေနတဲ့အေျခအေနမွာ အသုံးျပဳရင္ အက်ဴိးသတ္ေရာက္မႈ မရွိခဲ့ေပမယ့္ လက္ရွိ Dota 2 မွာေတာ့ Glimmer Cape ကဲ့သုိ႔ Invisible Item ေတြနဲ႕ေတာင္ တြဲဖက္အသုံးျပဳနုိင္ေနျပီျဖစ္ပါတယ္။ 450 AoE အတြင္းက Non-Ally Unit ေတြအားလုံးကုိ 100/130/160 Magical Damage နဲ႕ စကၠန္႔တုိင္းမွာ တုိက္ခုိက္ေနမွာျဖစ္ျပီး စကၠန္႔တုိင္းမွာလည္း 20/40/60 Mana စီ ကုန္ေနမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Nuker တစ္ေကာင္အေနနဲ႕ Mana Cost က အေရးအၾကီးဆုံးျဖစ္ျပီး Mana Pool ေရာ Mana Regen ပါ မ်ားေအာင္ ဆက္ထားမွသာ Battle ထဲမွာ ၾကာၾကာအသုံးဝင္ေနမွာျဖစ္ပါတယ္။"
			}
		]
	},
	{
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/480817788735761",
		"hero_intellgience":"24 + 3.00",
		"hero_agility":"22 + 1.80",
		"hero_strength":"19 + 1.50",
		"hero_damage":"22 - 32",
		"hero_movement_speed":"285",
		"hero_armor":"5.08",
		"hero_name":"Storm Spirit",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/storm_spirit_vert.jpg",
		"hero_role":"Ranged - Carry - Escape - Nuker - Initiator - Disabler",
		"hero_detail":"Background Story\nStorm Spirit ဆုိတဲ့ စကားလုံးကုိ အဟုန္ျပင္းတဲ့ ေလထု နဲ႕ ဥတုရာသီ စြမ္းအား၂မ်ဴိးအား ခပ္ထန္ၾကမ္းတမ္း၊ ေပ်ာ္ရႊင္ျမဴးတူးကာ ပိတ္ပင္တားဆီးမရေသာ အသြင္ရွိသည့္ လူသ႑န္ခႏၶာကုိယ္တစ္ခုတည္းမွာ ထည့္သြင္းေပါင္းစပ္ထားတဲ့ သဘာဝရဲ႕ ခြန္အားတစ္ခုလုိ႔ အဓိပၸါယ္ေဖာ္ယူလုိ႔ရပါတယ္။ ထာဝရေပ်ာ္ရႊင္ေနတဲ့အသြင္နဲ႕ဒီဦးေလးၾကီးဟာ တဂြ်တ္ဂြ်တ္ျမည္ေနတဲ့ စြမ္းအားေတြနဲ႕ျပည့္ႏွပ္ေနေပမယ့္ ဒီဖန္တီးမႈျဖစ္ေပၚလာဖုိ႔အတြက္ ေနာက္ကြယ္မွာေတာ့ ေၾကကြဲဖြယ္ရာ ဇာတ္လမ္းတစ္ပုတ္ရွိေနခဲ့ပါတယ္။ လြန္ေလျပီးေသာ မ်ဴိးဆက္မ်ားစြာတုန္းက ေသာကေတာင္တန္းၾကားမွာ စိတ္ထားေကာင္းေသာ လူသားမ်ဴိးႏြယ္တစ္စုဟာ မုိးေခါင္ျပီး ငတ္မြတ္ေခါင္းပါးတဲ့ ၾကမၼာဆုိးနဲ႕ ရင္ဆုိင္ေနခဲ့ရပါတယ္။ Thunderkeg လုိ႔အမည္ရတဲ့ သာမန္အဂိၢရက္ဆရာတစ္ဦးဟာ ဒီျပႆနာကုိ အကူအညီေပးလုိတဲ့အတြက္ သုံးစြဲခြင့္တားျမစ္ပိတ္ပင္ထားတဲ့ ဂါထာမႏၲာန္ တစ္ခုကုိရြတ္ဆုိျပီး မုိးရြာသြန္းေပးေစဖုိ႔ မုန္တုိင္းနတ္ဘုရားကုိ ဆင့္ေခၚကာ အသနားခံခဲ့ပါတယ္။ Raijin လုိ႔အမည္ရတဲ့ မုိးၾကဳိးမုန္တုိင္းနတ္ဘုရားဟာ သာမန္ေသမ်ဴိးလူသားတစ္ဦးက သူ႔အားဆင့္ေခၚခဲ့သည့္အတြက္ အမ်က္ေဒါသတစ္ေထာင္းေထာင္းထျပီး တုိင္းျပည္တစ္ခုလုံးကုိ ေလမုန္တုိင္းျဖင့္တုိက္ခတ္ကာ ေရလႊမ္းေစျပီး အမ်က္ေဒါသတုိ႔ျဖင့္ တုံ႔ျပန္ခဲ့ပါေတာ့တယ္။ နတ္ဘုရားတစ္ပါးနဲ႕ ႏႈိင္းယွဥ္ဖုိ႔ မျဖစ္နုိင္တဲ့အတြက္ Thunderkeg ဟာ မိမိကုိယ္ကုိ စေတးခံျပီး Raijin နတ္ဘုရားကုိ ဟန္႔တားဖုိ႔ဆုံးျဖတ္ခဲ့ပါတယ္။ မိမိ နဲ႕ နတ္ဘုရားရဲ႕ ကံၾကမၼာ ႏွစ္ခုကုိ တစ္ခုတည္းအျဖစ္ ေပါင္းစပ္ေစဖုိ႔ ကုိယ္ကုိေသဆုံးေစမယ့္ မႏၲာန္ကုိ ရြတ္ဆုိျပီးေနာက္ Thunderkeg ဟာ သူ႔ရဲ႕ ခႏၶာကုိယ္ကုိ ေလွာင္အိမ္ တစ္ခုသဖြယ္ စေတးျပီးေနာက္ မုန္တုိင္းနတ္ဘုရားကုိ ဖမ္းဆီးထိမ္းသိမ္းလုိက္ပါတယ္။ ၾကမၼာႏွစ္ခုေပါင္းစပ္ထားတဲ့ Thunderkeg ရဲ႕ ခႏၶာကုိယ္ဟာ အက္ကြဲ ေၾကမြေနတဲ့ မုန္တုိင္းနတ္ဘုရားရဲ႕ စြမ္းအားမ်ား စီးဆင္းလ်က္ရွိျပီး နတ္ဘုရားတန္ခုိး၊ လူ႔ခႏၶာကုိယ္ ေပါင္းစပ္ထားေသာ ထာဝရေပ်ာ္ရႊင္ျမဴးထူးေနသည့္ Raijin Thunderkeg ကုိ ျဖစ္ေပၚလာေစခဲ့ပါေတာ့တယ္။",
		"hero_overview":"ကစားကြက္မ်ားစြာရွိတဲ့အထဲကမွ Sumail က Electric Voltex မယူဘဲ ေဆာ့ခဲ့တာျဖစ္ေပမယ့္ ကစားသမားအမ်ားစုေရြးခ်ယ္တဲ့ ကစားကြက္ေတာ့ Overload ကုိအရင္တင္ျပီး Remnant ၁ ဆင့္၊ Voltex ၄ ဆင့္ပုံစံကုိ အေတြ႕ရအမ်ားဆုံးျဖစ္ပါတယ္။ 140 Damage ရွိတဲ့ Remnant ကုိ Mana ကုန္က်စားရိတ္သပ္သာေအာင္ ၁ ဆင့္တည္း ထားျပီး Electric Voltex Cooldown ကုိေလွ်ာ့ခ်ကာ ေဆာ့ကစားၾကေပမယ့္ မိမိႏွစ္သက္ဖုိ႔သာလွ်င္ အေရးအၾကီးဆုံးျဖစ္ပါတယ္။ v6.70 မတုိင္ခင္ ႏွစ္မ်ားစြာက Power Tread + Linken + Dagon ဟာ လူၾကဳိက္အမ်ားဆုံး ကစားကြက္ျဖစ္ခဲ့ေပမယ့္ လက္ရွိ Meta မွာေတာ့ Orchid သုိ႔မဟုတ္ Bloodstone ကုိ 2nd item အျဖစ္ေရြးခ်ယ္ၾကပါတယ္။ Ball Lightning ဟာ Mana Pool ရဲ႕ Percentage ကုိၾကည့္ျပီး တြက္ခ်က္တာျဖစ္လုိ႔ Mana Pool မ်ားတဲ့ Item ေတြထက္ Mana Regen ကုိ ဦးစားေပးမယ့္ Bloodstone ကုိ ေရြးခ်ယ္ၾကျပီး အခ်ိန္တုိအတြင္းမွာ Magic Damage အေျမာက္အမ်ားနဲ႕တုိက္ခုိက္နုိင္မွာျဖစ္လုိ႔ ပုိမိုေသခ်ာေစမယ့္ Soul Burn Damage ကုိရရွိေစမယ့္ Orchid ဟာ လူဆက္အမ်ားဆုံး Item တစ္ခုလည္းျဖစ္ပါတယ္။ Ball Lightning ရွိတဲ့အတြက္ မိမိအသင္းသားေတြ ေနရာမယူနုိင္ေသးခင္မွာ Battle ၾကဳိမဝင္သင့္ဘဲ Battle ေနာက္မွာေနျပီး တုိက္ခုိက္မယ့္ Enemy Hero (Sniper, Warlock, Pugna, ... ) တုိ႔ကို တာဝန္ေပးဖုိ႔အခြင့္အေရးကုိ Storm Spirit က ပုိင္ဆုိင္ထားပါတယ္။ Strength နည္းေပမယ့္ Battle အလည္ထဲထိဝင္ေရာက္ တုိက္ခုိက္ရမွာျဖစ္လုိ႔ 3rd item ကုိ Black King Bar ေရြးခ်ယ္ဖုိ႔ အဓိက အၾကံျပဳလုိပါတယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သာလွ်င္ မိမိအတြက္အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Static Remnant",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/storm_spirit_static_remnant_hp1.png",
				"spell_overview":"ပုံေသ Cooldown 3.5 seconds ပဲရွိျပီး တစ္ဆင့္တည္းယူရုံနဲ႕ 140 Damage အထိရွိတဲ့ Static Remnant ဟာ 12 seconds Duration ရွိပါတယ္။ တစ္ဆင့္ပုိယူလုိက္တုိင္း 40 Damage ဆီတုိးလာမွာျဖစ္ျပီး Mana Cost ဟာလည္း 10 ဆီလုိက္တုိးလာမွာျဖစ္ပါတယ္။ ထူးျခားခ်က္ကေတာ့ အသုံးျပဳထားတဲ့အခ်ိန္မွာ Remnant ဟာ 800 AoE Flying Vision ကုိ ရရွိေစမွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Electric Vortex",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/storm_spirit_electric_vortex_hp1.png",
				"spell_overview":"Electric Voltex ကေတာ့ Enemy Unit ကုိ မိမိနားသုိ႔ 100 Movement Speed ႏႈန္းနဲ႕ ဆြဲေခၚေပးမွာျဖစ္ျပီး 300 Cast Range ရွိပါတယ္။ ပထမအဆင့္မွာ ဆြဲေခၚခ်ိန္ဟာ 1 second ပဲရွိလုိ႔ 100 Distance အထိပဲ Disable ျဖစ္ေနမွာျဖစ္ျပီး ေနာက္ဆုံးအဆင့္မွာ ဆြဲေခၚခ်ိန္ဟာ 2.5 seconds ၾကာမွာျဖစ္လုိ႔ 250 Distance အထိ အဆုိပါ Unit Disable ျဖစ္ေနမွာျဖစ္ပါတယ္။ 2.5 seconds ၾကာတဲ့ Disable Ability ျဖစ္လုိ႔ အားနည္းခ်က္ကေတာ့ Storm Spirit ဟာ မိမိဘာသာ 50% Movement Speed Slow ကုိျဖစ္ေပၚေစမွာပါ။ ဒါေပမယ့္ Ultimate Ball Lightning ရွိေနတဲ့အတြက္ Movement Speed ေလ်ာ့ေနျခင္းက ျပႆနာတစ္ခုေတာ့မဟုတ္ပါဘူး။"
			},
			{
				"spell_name":"Overload",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/storm_spirit_overload_hp1.png",
				"spell_overview":"Mana အသုံးျပဳရတဲ့ သူ႕ရဲ႕အျခား Ability ၃ခု အသုံးျပဳျပီးတုိင္းမွာ Overload ျဖစ္ေပၚမွာျဖစ္ျပီး လာမယ့္ Physical Attack တုိက္ခုိက္မယ့္ Unit ရဲ႕ 275 AoE အတြင္းမွာ 30/50/70/90 Bonus Magical Damage ကို ျဖစ္ေပၚေစမွာျဖစ္ပါတယ္။ အဆုိပါ AoE အတြင္းမွာရွိတဲ့ Enemy Unit မ်ားအေနနဲ႕ 80% MS Slow နဲ႕ 50 Attack Speed Slow ကုိျဖစ္ေပၚေစမွာ ျဖစ္ေပမယ့္ Item အသုံးျပဳျခင္းေၾကာင့္ Overload ကုိရရွိမွာမဟုတ္ပါဘူး။ Overload ဟာ မိမိတုိက္ခုိက္လုိက္တဲ့ Projectile ဟာ သတ္မွတ္ေနရာကုိ မေရာက္ခင္မွာ အသုံးျပဳသမွ် Ability တုိင္းေၾကာင့္ ျဖစ္ေပၚတာျဖစ္လုိ႔ Physical Attack ထိခါနီးမွ Remnant အသုံးျပဳမယ္ဆုိရင္လည္း Overload ကုိ ျဖစ္ေပၚေစမွာပါ။"
			},
			{
				"spell_name":"Ball Lightning",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/storm_spirit_ball_lightning_hp1.png",
				"spell_overview":"Cooldown မရွိဘဲ Mana က်န္ေသးသေလာက္ ခုန္လုိ႔ရတဲ့ Ball Lightning ဟာ Dota ရဲ႕ အေကာင္းဆုံး Ultimate ေတြထဲက တစ္ခုျဖစ္ပါတယ္။ Maximum Mana Pool မ်ားရင္ မ်ားသေလာက္ Active Mana Cost နဲ႕ Travel Mana Cost က တက္လာမွာျဖစ္ျပီး မ်ားမ်ားယူရင္ Speed, Travel Damage နဲ႕ Damage AoE တက္လာမွာျဖစ္ပါတယ္။ Ball Lightning စတင္အသုံးျပဳတဲ့ေနရာက စတင္တြက္ခ်က္မယ့္ AoE Magical Damage ဟာ သြားရာလမ္းတစ္ေလွ်ာက္ Distance 100 တုိင္းအတြက္ 16 Damage ႏႈန္းနဲ႕တက္လာမွာျဖစ္ေပမယ့္ မိမိရဲ႕ Mana ကုန္က်မႈကုိ အရင္တြက္ခ်က္သင့္ပါတယ္။ ထူးျခားခ်က္ကေတာ့ Ball Lightning သြားရာလမ္းတစ္ေလွ်ာက္မွာ 400 AoE Flying Vision ကုိ ရရွိေနမွာျဖစ္ပါတယ္။"
			}
		]
	},
	{
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/457479017736305",
		"hero_intellgience":"16 + 2.80",
		"hero_agility":"19 + 1.80",
		"hero_strength":"16 + 1.00",
		"hero_damage":"31 - 41",
		"hero_movement_speed":"335",
		"hero_armor":"0.66",
		"hero_name":"Enchantress",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/enchantress_vert.jpg",
		"hero_role":"Ranged - Support - Jungler - Pusher - Durable - Disabler",
		"hero_detail":"Background story\nAiushtha ဟာ စိမ္းလန္းေသာ ေတာအုတ္ၾကီးအတြင္းက အျပစ္ကင္းစင္၊ ေၾကာက္ရြံ႕မႈကိုမသိတဲ့ သက္ရွိေလးတစ္ေကာင္္ျဖစ္ပါတယ္။ သဘာဝေလာကၾကီးရဲ႕ ပူေဆြးေသာကေတြကုိ သူမဟာ ေကာင္းစြာနားလည္သိရွိထားတဲ့အတြက္ေၾကာင့္ အလင္းေရာင္ျဖာျပီး စိမ္းလမ္းတဲ့ ေတာၾကီးနဲ႕ ေဝးရာကို ထြက္ခြာလာခဲ့ပါတယ္။ သူမဟာ ရာသီ အလီလီ၊ ေဒသ အမ်ဴိးမ်ဴိး၊ ေရာက္ေလရာ အရပ္တုိင္းမွာ မိတ္ေဆြသစ္မ်ားရွာေဖြ၊ သတင္းမ်ား ျဖန္႔က်က္၊ ရယ္ေမာစရာမ်ားသယ္ေဆာင္ကာ ဒဏ္ရာအစုံစုံကုိ ကုသေပးခဲ့ပါတယ္။ စစ္ပြဲမ်ားေၾကာင့္ ပ်က္စီးယုိးယြင္းေနတဲ့ ကမာၻၾကီးေပၚမွာ သစ္ပင္မ်ားဟာ စစ္ဖက္အေဆာက္အအုံ၊ သေဘၤာမ်ား နဲ႕ ခံတပ္မ်ား အျဖစ္ေျပာင္းလဲသြားခဲ့ရျပီး ျငိမ္းခ်မ္းတဲ့ ေဒသေတြမွာေတာင္ လူေနအိမ္မ်ား၊ မီးဖုိမ်ားအတြက္ မေရမတြက္နုိင္ေအာင္ အသုံးျပဳေနတဲ့ ေလာင္စာမ်ားအျဖစ္ အသုံးခ်ဖုိ႔ ခုတ္လွဲ ဖ်က္စီးျခင္း ခံေနရပါေတာ့တယ္။ အသက္ရွင္ရပ္တည္ဖုိ႔ စိမ္းလန္းအုံ႕စုိင္းတဲ့ အရိပ္အာဝါသ ကုိလုိအပ္ေသာ သတၱဝါငယ္ေလးမ်ားရဲ႕ အသနားခံသံကုိ မည္သူတစ္ဦးတစ္ေယာက္မွာ အေလးထားျခင္းမရွိခဲ့ေပမယ့္ Aiushtha ဟာ ဂရုတစုိက္နားေထာင္ေပးခဲ့ပါတယ္။ သူမဟာ သစ္ေတာၾကီးအတြင္းက အျဖစ္အပ်က္ဇာတ္လမ္းမ်ားကုိ ကမာၻၾကီးတစ္ခုလုံး သိရွိသြားေအာင္ သယ္ေဆာင္ေပးမယ္လုိ႔ ဆုံးျဖတ္ခဲ့ပါတယ္။ သူ႕ရဲ႕ ေကာင္းမြန္မွန္ကန္တဲ့ အားေပးခ်ီးေျမာက္မႈကသာလွ်င္ အထိေရာက္ဆုံး စည္းရႈံးမႈတစ္ခုျဖစ္လာမယ္လုိ႔ ယုံၾကည္တဲ့ Aiushtha ဟာ စိမ္းလန္းသာယာေသာ အနာဂတ္ကုိ ဖန္တီးေပးမယ္လုိ႔ တုိင္တည္ထားတဲ့ ကတိကုိ ျဖစ္ေျမာက္ေအာင္ လုပ္ေဆာင္ေပးမယ့္သူတစ္ဦးပဲျဖစ္ပါေတာ့တယ္။",
		"hero_overview":"Hero ၁ ေကာင္တည္းမွာတင္ Role ေလးခု ေပါင္းစပ္ ေပးထားေပမယ့္ Hp ပမာဏနည္းလြန္းျခင္းကုိ Enchantress ရဲ႕ အဆုိးရြားဆုံး အားနည္းခ်က္အျဖစ္ထည့္သြင္းထားလုိ႔ သတ္ရလြယ္တဲ့ Hero တစ္ေကာင္ျဖစ္ေနပါတယ္။ ယခင္ Dota 1 တုန္းက Navi ကစားသမားေတြဟာ Summon Unit ေတြနဲ႕ Aggressive Pushing ပုံစံနဲ႕ ကစားျပခဲ့လုိ႔ Enchantress ကုိ Support, Pusher ပုံစံထက္ပုိျပီး မသက္မွတ္ေပးၾကပါဘူး။ ဒါေပမယ့္ အထုိက္အေလ်ာက္ Hp Pool မ်ားေအာင္ ဆက္ျပီး ေနတက္တုိင္တက္မယ္ဆုိရင္ Enchantress ဟာလည္း ပြဲအစမွ ပြဲအဆုံး အသုံးတည့္တဲ့ Hero ဆုိတာ ျငင္းလုိ႔မရပါဘူး။ Dota 2 ရဲ႕ Suggest Items List ထဲမွာကုိက Enchantress ကုိ Support Item ေတြနဲ႕ေဆာ့ဖုိ႔ မရည္ညႊန္းထားဘဲ Hp Pool တက္ျပီး Armor, Attack Speed တုိးေစမယ့္ Heart, Hyperstone, Orchid တုိ႔လုိ Item ေတြကုိ ရည္ညႊန္းထားတာကုိၾကည့္ရုံနဲ႕ Aiushtha ဟာ Pure Support မဟုတ္ဘူးဆုိတာကုိ သိနုိင္ပါတယ္။ အေစာပုိင္း Lane Push ပုံစံ မကစားဘူးဆုိရင္ ပစ္ခ်က္တုိင္းမွာ မ်ားျပားတဲ့ Pure Damage ေပါင္းမ်ားစြာ ျဖစ္ေပၚနုိင္တဲ့ Enchantress ကုိ Carry တစ္ေကာင္လုိေဆာ့တာလည္း အမွားၾကီးေတာ့ မဟုတ္ပါဘူး။ မိမိတာဝန္ မိမိေက်ဖုိ႔ပဲ လိုပါလိမ့္မယ္။ Hand of Midas, Mask of Madness တုိ႔ျဖင့္ Enchantress ရဲ႕ Attack Speed ကုိ တင္ေပးထားနုိင္ျပီး Attack Range ကို ၁၉ဝ တုိးေစမယ့္ Aghanim’s Scepter ကေတာ့ Hp Pool ကုိတုိးေစမွာျဖစ္လုိ႔ Carry လုိေဆာ့မယ္ဆုိရင္ေတာ့ မျဖစ္မေနဆက္ေပးသင့္ပါတယ္။ Public Match ေတြမွာ ကစားမယ္ဆုိရင္ Lane ေနဖုိ႔ အခက္အခဲရွိတာေၾကာင့္ Jungle Support ပုံစံနဲ႕ အေဆာ့မ်ားေပမယ့္ Massive Nuker ေတြျဖစ္တဲ့ ဥပမာ Lion, Lina, QoP, Tiny, Meepo တုိ႔လုိ Hero ေတြမပါခဲ့ရင္ေတာ့ Carry Enchantress နဲ႕ ေဆာ့ကစားဖုိ႔ကုိ ထည့္သြင္းစဥ္းစားနုိင္ပါတယ္။ မည္သုိ႔႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သာလွ်င္ မိမိအတြက္အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Untouchable",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_untouchable_hp1.png",
				"spell_overview":"Enchantress ကုိ Durable Hero တစ္ေကာင္အျဖစ္ သတ္မွတ္ေစမယ့္ Untouchable ဟာ သူမကုိ ဦးတည္ျပီး တုိက္ခုိက္မႈျပဳလုပ္တဲ့ Hero တုိင္းကုိ 4 seconds ၾကာတဲ့ Attack Speed 30/60/90/120 ေလ်ာ့ေစမွာျဖစ္ပါတယ္။ ေနာက္ဆုံးအဆင့္မွာ Hyperstone ၂ လုံးထက္မ်ားျပားတဲ့ Attack Speed ပမာဏကို ေလ်ာ့ေစမွာျဖစ္ျပီး Physical Attack အျပင္ Target Ability အသုံးျပဳရင္ေတာင္ Attack Speed ကုိ Slow ေစမွာက Untouchable ရဲ႕ ထူးျခားမႈပဲျဖစ္ပါတယ္။ ပြဲေနာက္ပုိင္းအထိ အသုံးဝင္တဲ့အျပင္ ကစားပြဲအစပုိင္းမွာပါ Carry ေတြနဲ႕ယွဥ္ျပီး တုိက္ခုိက္နုိင္မွာျဖစ္ပါတယ္။ (Aiushtha ကုိ Durable တစ္ေကာင္အျဖစ္ သတ္မွတ္ေပးမယ့္ Ability ျဖစ္ပါတယ္။)"
			},
			{
				"spell_name":"Enchant",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_enchant_hp1.png",
				"spell_overview":"Enemy နဲ႕ Neutral Unit မ်ားကုိ မိမိဘက္မွာ ကူညီတုိက္ခုိက္ေပးေအာင္ ညဳိ႕ေခၚနုိင္မယ့္ Enchant ကို ကစားပြဲဲအစမွာ Neutral Unit ျဖင့္အကူအညီယူတုိက္ခုိက္ဖုိ႔ အသုံးျပဳနုိင္သလုိ ပြဲေနာက္ပုိင္းအထိ Enemy Hero မ်ားကုိ Movement Speed Slow ျဖင့္တုိက္ခုိက္နုိင္မယ့္ Ability ျဖစ္ပါတယ္။ Warlock’s Golem, Brewmaster’s Pandas, Wards နဲ႕ Building မ်ားကုိ Enchant အသုံးျပဳနုိင္မွာ မဟုတ္ဘဲ Meepo Clone နဲ႕ Spirit Bear ကုိအသုံးျပဳရင္ MS Slow ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ညွဳိ႕နုိင္ခဲ့မယ္ဆုိရင္ေတာ့ 80 Seconds ၾကာေအာင္ ထိန္းခ်ဴပ္နုိင္မွာျဖစ္ျပီး MS Slow ျဖစ္ေပၚေစမယ္ဆုိရင္ 5.5 seconds ၾကာမွာျဖစ္ပါတယ္။ မ်ားမ်ားယူရင္ေတာ့ Cooldown က်ျပီး Slow Rate တုိးလာမွာပါ။ (Aiushtha ကုိ Pusher တစ္ေကာင္အျဖစ္ သတ္မွတ္ေပးမယ့္ Ability ျဖစ္ပါတယ္။)"
			},
			{
				"spell_name":"Nature's Attendants",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_natures_attendants_hp1.png",
				"spell_overview":"Wisp တစ္ေကာင္ဟာ 10 Hp ႏႈန္းနဲ႕ ေသြးျဖည့္ေပးမွာျဖစ္ျပီး Nature’s Attandant ကုိမ်ားမ်ားယူခဲ့ရင္ Wisp အေကာင္အေရအတြက္ 3/5/7/9 ေကာင္ တုိးလာမွာျဖစ္လုိ႔ ကစားသမားအမ်ားစု lvl တင္ေလ့ရွိတဲ့ Ability တစ္ခုျဖစ္ပါတယ္။ Wisp မ်ားဟာ Enchantress ရဲ႕ 275 AoE အတြင္းက Unit ေတြကုိ Random ေသြးျဖည့္ေပးမွာျဖစ္လုိ႔ Unit မ်ားသြားရင္ ေသြးျပည့္မယ့္ ပမာဏ နည္းသြားမယ့္အခ်က္ကုိ သတိျပဳသင့္ပါတယ္။ ဒါေၾကာင့္ Nature’s Attandant ကုိ Ally အတြက္အသုံးျပဳေပးတဲ့အခါမွာ Creep မ်ားနဲ႕ ေဝးရာမွာ အသုံးျပဳသင့္ပါတယ္။ ေနာက္ဆုံးအဆင့္မွာ စုစုေပါင္း Hp ပမာဏ 900 ကုိ ျပည့္ေစမွာျဖစ္ပါတယ္။ (Aiushtha ကုိ Support တစ္ေကာင္အျဖစ္ သတ္မွတ္ေပးမယ့္ Ability ျဖစ္ပါတယ္။)"
			},
			{
				"spell_name":"Impetus",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/enchantress_impetus_hp1.png",
				"spell_overview":"Unique Attack Modifier မ်ားကုိ ေလ်ာ့ခ်ေပးလုိက္တဲ့ Dota 2 အေရာက္မွာေတာ့ Ultimate Impetus ကုိ Mask of Madness နဲ႕ တြဲဖက္အသုံးျပဳလာတာကို ေတြ႕ရပါတယ္။ Impetus ျဖင့္ Safe ျဖစ္တဲ့ အကြာအေဝးကေန လွ်င္ျမန္တဲ့ Attack Speed နဲ႕ တုိက္ခုိက္မယ္ဆုိရင္ မ်ားျပားလြန္းတဲ့ Pure Damage မ်ားဟာ Physical တုိက္ခုိက္မႈတုိင္းမွာ တြဲဖက္ေပးေနမွာျဖစ္ပါတယ္။ Enchantress နဲ႕ အတုိက္ခုိက္ခံရတဲ့ Unit ၾကားအကြာအေဝးရဲ႕ ၂၅% ဟာ Pure Damage အျဖစ္ေပါင္းစပ္ျပီး သက္ေရာက္ေနမွာျဖစ္ပါတယ္။ ၂ ေယာက္ၾကားအကြာအေဝး 1000 Distance ရွိမယ္ဆုိရင္ 250 Pure Damage ပုိထိမွာျဖစ္လုိ႔ Projectile မက်ေရာက္ခင္ Target Unit နဲ႕ ေဝးရာကုိသြားျပီး Damage ပမာဏကို တုိးျမင့္နုိင္ပါတယ္။ ဒါေပမယ့္ အမ်ားဆုံး 2500 Distance ထက္မပုိမွသာ Extra Damage ရရွိမွာျဖစ္လုိ႔ Glimpse, Test of Faith, Town Portal အစရွိတဲ့ 2500 Distance ထက္ပုိမယ့္ အသုံးျပဳမႈမ်ားကုိ လက္ေလ်ာ့ထားသင့္ပါတယ္။ (Aiushtha ကုိ Carry တစ္ေကာင္အျဖစ္ သတ္မွတ္ေပးမယ့္ Ability ျဖစ္ပါတယ္။)"
			}
		]
	}
]