[
 {
	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/628544287296443",
	"hero_intellgience":"18 + 1.60",
	"hero_agility":"20 + 2.20",
	"hero_strength":"25 + 2.50",
	"hero_damage":"24 - 28",
	"hero_movement_speed":"290",
	"hero_armor":"1.8",
 	"hero_name":"Axe",
 	"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/axe_vert.jpg",
 	"hero_role":"Melee - Initiator - Durable - Disabler - Jungler",
	"hero_detail":"V6.84 Patch မွာ ရွိေနတဲ့ Ability ၃ ခုကုိ Nerf ေပးျပီးေနာက္ Axe ဟာ ေနာက္ဆုံးထြက္ရွိလာတဲ့ v6.87 Patch ေရာက္ေတာ့မွ ျပန္လည္ Buff ခံရတဲ့ Initiator, Disabler Hero တစ္ေကာင္ျဖစ္ပါတယ္။ Axe ဟာ v6.83c မတုိင္ခင္ ကာလမ်ားတုန္းက Premium အဆင့္ ကစားပြဲမ်ားမွာ Pick ဖုိ႔၊ Ban ဖုိ႔ ဦးစားေပး စဥ္းစားရတဲ့ Hero တစ္ေကာင္ျဖစ္ခဲ့ျပီး ယခုအခ်ိန္ထိ ကြယ္ေပ်ာက္သြားျခင္းမရွိတဲ့ Hero ေကာင္းတစ္ေကာင္ျဖစ္ပါတယ္။ IceFrog ဟာ လက္ရွိ Meta မွာ Teamfight ေတြကုိ ပုိမုိၾကာျမင့္ေစမယ့္ အေျပာင္းအလဲမ်ားကုိ ဖန္တီးေပးခဲ့သလုိ Initiate Tanker မ်ားကုိလည္း Buff ေပးထားတာကုိ ေတြ႕ရပါတယ္။ Axe ဟာလည္း ထိုက္သင့္တဲ့ Buff တစ္ခုအျဖစ္ Counter Helix ကုိ Physical ကေန Pure Damage Type သုိ႔ ေျပာင္းလဲေပးလုိက္တဲ့အတြက္ ဝွက္ဖဲတစ္ခုအျဖစ္ ထည့္သြင္းသုံးစြဲလုိ႔ ေကာင္းတဲ့ Situational Hero စာရင္းမွာ ထိပ္ဆုံးက ျပန္လည္ ပါဝင္လာခဲ့ျပီပဲျဖစ္ပါတယ္။Axe ဟာ Magic Immune Unit ေတြကုိ ဖမ္းထားေပးႏုိင္တဲ့ AoE Disable Ability, Single Target Slow, Passive Nuke Ability တစ္ခုနဲ႕ Killing Blow Ability တုိ႔နဲ႕ ဖြဲ႕စည္းထားတဲ့ Durable, Jungler, Disabler, Initiator Strength Hero တစ္ေကာင္ျဖစ္ပါတယ္။",
 	"hero_overview":"Axe ဟာ Initiator Hero တစ္ေကာင္ျဖစ္ပါတယ္။ ဒါေၾကာင့္ ဖိနပ္တစ္ခုကုိ ေရြးခ်ယ္ျပီးတာနဲ႕ Dagger, Force Staff အစရွိတာကုိ ဦးစားေပး ေရြးခ်ယ္ေလ့ရွိပါတယ္။ Berserker’s Call ဟာ 300 AoE အတြင္းက Unit အားလုံးကုိ မိမိအား တုိက္ခုိက္ေအာင္ ဖိအားေပးမွာျဖစ္လုိ႔ Blade Mail ကုိလည္း ေရြးခ်ယ္သင့္ပါတယ္။ Battle Hunger ဟာ Patch အသစ္ေတြ တစ္ခုျပီး တစ္ခု ေျပာင္းလာတုိင္းမွာ တုိးတာလာခ့ဲပါတယ္။ ပုံေသ Duration 10 seconds ရွိတဲ့အတြက္ Laning မွာ Creep ၂ အုတ္ကုန္သြားတဲ့အေျခအေန၊ တစ္ဖက္ Hero က Last Hit လုပ္စရာမရွိလုိ႔ ေနာက္ဆုတ္သြားတဲ့ အေျခအေန၊ မ်ဴိးမွာ အသုံးျပဳျပီး ႏွိမ္ထားလုိ႔ရပါတယ္။ Damage ပမာဏကလည္း သိသိသာသာ မ်ားျပားလြန္းတဲ့အတြက္ ပြဲအေျခအေနေပၚၾကည့္ျပီး Counter Helix ထက္ ဦးစားေပး တင္ေပးရတဲ့ အခါမ်ဴိးေတြလည္း ရွိတတ္ပါတယ္။Axe ရဲ႕ Cosmetic Immortal Item တစ္ခုျဖစ္တဲ့ Rampant Outrage ဟာ Berserker’s Call ရဲ႕ 300 AoE ကုိ ရွင္းရွင္းလင္းလင္းျမင္ရေစတဲ့ အားသာခ်က္တစ္ခုလည္း ရွိလုိ႔ သင္က Axe Crazy ဆုိရင္ ရွာေဖြဝယ္ယူထားသင့္တဲ့ Item တစ္ခုလည္းျဖစ္ပါတယ္။ လက္ရွိ Meta မွာ Counter Helix ဟာ Pure Damage Type အျဖစ္ ေျပာင္းလဲသြားျပီျဖစ္လုိ႔ Bkb Unit မ်ားကုိလည္း Damage သတ္ေရာက္ႏုိင္ျပီျဖစ္ပါတယ္။ Pipe, Shiva, Crimson Guard တုိ႔ဟာ ပုံေသ စဥ္းစားစရာ Item မ်ားျဖစ္သလုိ Mjollnir ဟာလည္း Berserker’s Call နဲ႕ တြဲဖက္သုံးစြဲလုိ႔ ေကာင္းတဲ့ အခ်က္ကုိ ေမ့မထားသင့္ပါဘူး။Axe ဟာ Tranquil Boots + Stout Shield ရွိရုံနဲ႕ Jungle အတြင္းမွာ ေအးေအးေဆးေဆး Farm လုိ႔ရတဲ့ Ability Build ေတြနဲ႕ Hero ျဖစ္ပါတယ္။ Tranquil Boots ကုိ Disable မျဖစ္ေစရန္ ေျမၾကီးေပၚ ခ်ထားျပီးမွ Neutral Creep အုတ္ထဲဝင္ဖုိ႔ေတာ့ လုိပါလိမ့္မယ္။ တစ္ဖက္အသင္းက Axe က Aggressive ကစားလာမယ္ဆုိရင္ေတာ့ Slow Ability ပါတဲ့ Hero ေတြျဖစ္တဲ့ Venomancer, Dazzle, Viper တုိ႔လုိ႔ Hero မ်ားနဲ႕ Counter ထိန္းနုိင္ပါတယ္။ သတိျပဳရမယ့္ တစ္ခ်က္က Ultimate Culling Blade ကုိ Linken Sphere နဲ႕ ကာကြယ္လုိ႔ ရတဲ့အခ်က္ျဖစ္ျပီး Lotus Orb သုံးထားတဲ့ Unit ကုိ Culling Blade ရဲ႕ Killing Blow သတ္ေရာက္မယ္ဆုိရင္ေတာ့ Axe ဟာ Killing Blow ကုိ ဦးစြာ ျပန္ထိျပီး အရင္ေသသြားႏုိင္တဲ့ အခ်က္ပါပဲ။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
 	"hero_spell":[
 		{
 			"spell_name":"Berserker's Call",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/axe_berserkers_call_hp1.png",
 			"spell_overview":"အသုံးျပဳလုိက္စဥ္မွာ 300 AoE အတြင္းက Enemy Unit မ်ားအားလုံးဟာ Uncontrollable ျဖစ္သြားျပီး Axe ကုိ ဝိုင္းဝန္းတုိက္ခုိက္ၾကမွာျဖစ္ပါတယ္။ Berserker’s Call Duration အတြင္းမွာ Axe ဟာ +40 Bonus Armor ကုိ ရရွိေနမွာျဖစ္ျပီး မိမိကုိ ဝုိင္းဝန္းတုိက္ခုိက္ေနတဲ့အတြက္ Counter Helix ျဖစ္ေပၚမယ့္ အခြင့္အေရးကုိ မ်ားစြာရရွိပါလိမ့္မယ္။ အားသာခ်က္ကေတာ့ Magic Immune Unit ေတြကုိပါ Disable ျဖစ္ေစမွာျဖစ္လုိ႔ ပြဲေနာက္ပုိင္းအထိ အသုံးဝင္တဲ့ Ability ျဖစ္ပါတယ္။ Berserker’s Call ဟာ မ်ားမ်ားယူတဲ့အခါ Duration တုိးျပီး Cooldown က်သြားမွာျဖစ္ေပမယ့္ ပုံေသ Bonus 40 Armor ကေတာ့ မေျပာင္းလဲဘဲ ရွိမွာျဖစ္ျပီး Mana Cost တုိးလာမွာျဖစ္လုိ႔ ကစားပြဲ အေစာပိုင္းမွာ အေျခအေနကုိၾကည့္ျပီး တစ္ဆင့္ေလာက္သာ တင္ထားရုံနဲ႕ လုံေလာက္တဲ့ Ability ျဖစ္ပါတယ္။"
 		},
 		{
 			"spell_name":"Battle Hunger",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/axe_battle_hunger_hp1.png",
 			"spell_overview":"Initiator အမ်ားစုက Battle တစ္ခုကုိ အစျပဳဖုိ႔အတြက္ Positioning ေကာင္းေကာင္းေပးမယ့္ Ability မ်ဴိးေတြ ပါဝင္ေလ့ရွိပါတယ္။ Axe မွာေတာ့ Movement Speed တုိးေစမယ့္ Ability ၂ ခုေတာင္ပါပါတယ္။ တစ္ခုက AoE MS Bonus ရရွိေစဖုိ႔ Ultimate မွာပါဝင္မွာျဖစ္ျပီး ေနာက္တစ္ခုကေတာ့ Battle Hunger မွာ ပါဝင္ပါတယ္။ Battle Hunger ဟာ Single Target Ability ျဖစ္ျပီး ပုံေသ Mana Cost 75 နဲ႕ Duration 10 Seconds ရွိပါတယ္။ အသုံးျပဳခံရတဲ့ Unit ဟာ 12% MS Slow ေနမွာျဖစ္ျပီး Axe ကေတာ့ 12% MS Increase မွာျဖစ္ပါတယ္။ အားသာခ်က္တစ္ခုကေတာ့ Axe က Battle Hunger ကုိ Unit တစ္ခုထက္ ပုိသုံးႏုိင္ေလ MS Increased ဟာ Stack ျပီးတုိးေနမယ့္ အခ်က္ျဖစ္ပါတယ္။ ဥပမာ - ေနာက္ဆုံးအဆင့္မွာ 5 Seconds Cooldown သာ ရွိမွာျဖစ္ျပီး Team Fight တစ္ခုမွာ Enemy Unit ၂ ခုကုိ သုံးထားမယ္ဆုိရင္ Axe ဟာ 24% MS Bonus ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ ယူထားတဲ့ အဆင့္အလုိက္ 16/ 24/ 32/ 40 DPS ကုိ 10 Seconds အတြင္း သက္ေရာက္ေနမွာျဖစ္ျပီး အဆုိပါ Unit က Last Hit တစ္ခုကုိ ျပဳလုပ္လုိက္တာနဲ႕ Battle Hunger က ရပ္တန္႔သြားမွာျဖစ္ပါတယ္။"
 		},
 		{
 			"spell_name":"Counter Helix",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/axe_counter_helix_hp1.png",
 			"spell_overview":"Axe အေပၚကို က်ေရာက္လာတဲ့ Physical Attack တုိင္းအတြက္ Counter Helix ျဖစ္ေပၚဖုိ႔ 20% Chance ရွိပါတယ္။ မ်ားမ်ားတင္ေပးတဲ့အခါ Damage ပမာဏ မ်ားလာျပီး Passive Cooldown ကုိ ေလွ်ာ့ခ်ေပးမွာျဖစ္ပါတယ္။ 90/ 120/ 150/ 180 Pure Damage ျဖစ္ျပီး 275 AoE ရွိပါတယ္။ Unit တစ္ခုရဲ႕ ပင္မ Physical Attack မ်ားကိုသာ Counter တြက္ခ်က္မွာျဖစ္လုိ႔ Medusa, Luna, Gyro ေသာ Hero ေတြမွာပါဝင္တဲ့ Extra Attack မ်ားကုိေတာ့ Counter Helix အတြက္ ထည့္သြင္းတြက္ခ်က္မွာ မဟုတ္ပါဘူး။ Counter Helix ဟာ Pseudo Random Distribution ကုိ အသုံးျပဳထားတာျဖစ္လုိ႔ True Random Distribution ထက္ေတာ့ ျဖစ္ေပၚႏုိင္ေျခနည္းပါးပါတယ္။"
 		},
 		{
 			"spell_name":"Culling Blade",
 			"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/axe_culling_blade_hp1.png",
 			"spell_overview":"Enemy Hero ရဲ႕ Hp ဟာ 250/ 325/ 400 ေအာက္သုိ႔ က်ဆင္းေနခ်ိန္မွာ အသုံးျပဳခဲ့မယ္ဆုိရင္ အဆုိပါ Hero ကုိ Killing Blow သတ္ေရာက္ျပီး ခ်က္ခ်င္း ေသသြားေစမယ့္ Ultimate Culling Blade ျဖစ္ပါတယ္။ Killing Blow သတ္ေရာက္သြားတုိင္း အဆုိပါ 900 AoE အတြင္းမွာရွိသမွ် Axe ရဲ႕ Allied Unit ေတြဟာ 6 seconds ၾကာျမင့္တဲ့ 30% Bonus MS ကုိ ရရွိေစမွာျဖစ္ယုံမကဘဲ Culling Blade ကုိလည္း Cooldown 0 သုိ႔ ျပန္လည္ Reset က်သြားမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Culling Blade ဟာ အထက္မွာေဖာ္ျပထားတဲ့ Hp ေအာက္ ေရာက္မေနတဲ့ အေျခအေနမွာ အသုံးျပဳမယ္ဆုိရင္ 150/ 250/ 300 Magical Damage ပဲ သတ္ေရာက္မွာျဖစ္ျပီး 75/ 65/ 55 Seconds Cooldown လည္း ျဖစ္သြားေစမွာပါ။ Culling Blade ဟာ Magic Immune Unit, Armor 1000 Unit ေတြ အေပၚမွာ ေဖာက္ထြင္းအသုံးျပဳႏုိင္တဲ့ HP Removal Damage အမ်ဴိးအစား ျဖစ္ပါတယ္။"
 		}
 	]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/590599721090900",
		"hero_intellgience":"23 + 1.60",
		"hero_agility":"14 + 1.50",
		"hero_strength":"24 + 2.30",
		"hero_damage":"23 - 33",
		"hero_movement_speed":"315",
		"hero_armor":"2.96",
		"hero_name":"Elder Titan",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/elder_titan_vert.jpg?v=3539650",
		"hero_role":"Melee - Initiator - Disabler - Nuker - Durable",
		"hero_detail":"Dota 2 ဟာ ကမာၻနဲ႕ယွဥ္ျပီး E-Sports အားကစားတစ္ခုျဖစ္လာတဲ့ေနာက္မွာ စည္းစနစ္က်တဲ့ Hero Role, Position, Duty ေတြနဲ႕ ေဆာ့ကစားေနၾကျပီျဖစ္ပါတယ္။ ဒါေၾကာင့္ ကစားပြဲတစ္ပြဲမွာ Carry နဲ႕ Support ဆုိတဲ့ Role အျပင္ Offlane ဆုိတဲ့ ေနရာဟာလည္း ေခါင္းစဥ္တစ္ခုအေနနဲ႕ အေလးထား စဥ္းစားေပးစရာ လုိပါတယ္။ Experience နဲ႕ Gold အေျမာက္အမ်ားမရရင္ေတာင္ မေသေအာင္ ေနလုိ႔ ရတဲ့ Hero အမ်ားစုကုိ ေယဘုယ်အေနျဖင့္ Offlane မွာ ကစားေစေလ့ရွိတဲ့အျပင္ Initiator အမ်ားစုကို ေတြ႕ရမွာျဖစ္ပါတယ္။ Professional အဆင့္ ကစားပြဲေတြမွာ ၂ ႏွစ္တာေလာက္ အေမ့ေလ်ာ့ခံျဖစ္ေနခဲ့ေပမယ့္ v6.81 Patch ကေန ယခု v6.86 အထိ Patch ၆ ခု ဆက္တုိက္ Buff ခံထားရတဲ့ Offlaner Hero တစ္ေကာင္ဟာ မၾကာခင္ Professional တန္းမွာ ျပန္လည္ျမင္ေတြ႕လာရဖုိ႔ အလားအလာ ရွိေနပါတယ္။ သူကေတာ့ Elder Titan The Worldsmith ပဲျဖစ္ပါတယ္။ Strength Melee Hero တစ္ေကာင္ျဖစ္ျပီး Initiator တစ္ေကာင္လည္း ျဖစ္တဲ့ Elder Titan ဟာ သာမန္ Hero ေတြနဲ႕ မတူညီႏုိင္တဲ့ Skill Build ေတြနဲ႕ ဖြဲ႕စည္းထားတဲ့ Overpower Hero တစ္ေကာင္ျဖစ္ေနေပမယ့္ Positioning ေပၚမ်ားစြာ မူတည္ေနလုိ႔ Pub Match ေတြမွာ မျမင္ေတြ႕ရလုနီးပါး ျဖစ္ေနခဲ့ပါတယ္။ Hero ေပါင္း ၁၁၁ ေကာင္ရွိတဲ့ Dota 2 မွာ Popular ျဖစ္မႈ နံပါတ္စဥ္ ၁ဝ၈ မွာျဖစ္ေနတဲ့ Elder Titan ဟာ အေမ့ေလ်ာ့ခံ Overpower Hero တစ္ေကာင္ျဖစ္လုိ႔ သင္က Team တစ္ခုအေနနဲ႕ ကစားဖုိ႔ အစီအစဥ္ရွိရင္ ေလ့က်င့္သင့္တဲ့ Hero တစ္ေကာင္လုိ႔ အၾကံျပဳခ်င္ပါတယ္။",
		"hero_overview":"Elder Titan ဟာ Initiator တစ္ေကာင္ျဖစ္ေပမယ့္ သူ႔ရဲ႕ ေႏွးေကြးေလးလံတဲ့ Spell Cast ေတြေၾကာင့္ Pub Match ေတြမွာ Popular ျဖစ္ႏႈန္းက်ဆင္းေနရျခင္းပဲျဖစ္ပါတယ္။ Astral Spirit ဟာ Initiate လုပ္ဖုိ႔ အသုံးဝင္တဲ့ Ability ျဖစ္ေပမယ့္ Cast Range 1200 ဟာ အရမ္းမနည္းသလုိ အရမ္းလည္း မမ်ားပါဘူး။ ဒါေပမယ့္ ျပီးခဲ့တဲ့ Update မွာ ပါဝင္ခဲ့တဲ့ Aether Lends ကေတာ့ Spirit ကုိ 1400 Cast Range ျဖစ္သြားေစမွာျဖစ္လုိ႔ Elder Titan အတြက္ မရွိမျဖစ္ ေရြးခ်ယ္သင့္တဲ့ Item တစ္ခုျဖစ္လာပါတယ္။ တကယ္လုိ႔ သင္က Offlane မွာ ေဆာ့ကစားရမယ္ဆုိရင္ေတာ့ Tranquil Boots နဲ႕ Soul Ring ကုိ ဦးစြာ ေရြးခ်ယ္ေပးသင့္ပါတယ္။ Offlaner တစ္ေယာက္ျဖစ္ေပမယ့္ Astral Spirit ကေန ျပန္လည္ရရွိမယ့္ Bonus Damage နဲ႕ Bonus MS တုိ႔ဟာ သင့္အတြက္ အေရးပါတဲ့ Last Hit ကုိ လုပ္နုိင္ေစမယ့္အျပင္ လုိအပ္ရင္ လုိအပ္သလုိ Aggressive ဆန္ဆန္ လုိက္လံတုိက္ခုိက္ႏုိင္မယ့္ Physical Damage ပမာဏကုိ ရရွိေစမွာျဖစ္ပါတယ္။\nကစားပြဲအလယ္ေလာက္မွာ Initator တစ္ေကာင္လုိ ဆုိတာထက္ Hitter တစ္ေကာင္အျဖစ္ ပါဝင္ခ်င္ရင္ေတာ့ Power Tread + Drum ကုိ ေရြးခ်ယ္သင့္ပါတယ္။ Astral Spirit Bonus ကေန ရရွိမယ့္ Damage ဟာ မ်ားျပားလြန္းျပီး 9 Seconds Duration ရွိတာေၾကာင့္ Natural Order ကေန ရရွိမယ့္ Reduction ေတြနဲ႕ေပါင္းဖက္ျပီး အနီးကပ္ ဝင္ေရာက္တုိက္ခုိက္ႏုိင္မယ့္ အားသာခ်က္လည္း ရွိပါေသးတယ္။ \nMelee hero ေတြရဲ႕ Attack Range ဟာ 128 Range ျဖစ္ပါတယ္။ သင့္ရဲ႕ Spirit ကေန ရရွိလာမယ့္ Bonus Damage ေတြကုိ 9 seconds အတြင္းမွာ ထိထိေရာက္ေရာက္ အသုံးျပဳႏိုင္ဖုိ႔ Hitter ဆန္ဆန္ Item ေတြနဲ႕လည္း စမ္းသပ္ၾကည့္ႏုိင္ပါတယ္။ Drum + Dagger + Sange and Yasha + Bkb ကေတာ့ ပုံမွန္ ျမင္ေတြ႕ရေနရၾက Elder Titan ရဲ႕ ပုံစံနဲ႕ ကြဲထြက္ေနေပမယ့္ တစ္ဖက္အသင္းရဲ႕ Carry ကုိ ကစားပြဲအလယ္ေလာက္မွာ ထိန္းသိမ္းေပးထားႏုိင္မယ့္ Semi Hitter တစ္ေကာင္လုိ အသုံးျပဳႏုိင္မွာျဖစ္ပါတယ္။ အေၾကာင္းကေတာ့ Natural Order ေၾကာင့္ျဖစ္ပါတယ္။ 275 AoE ဟာ Melee Range ထက္ မ်ားစြာ ပုိလုိ႔ မိမိ ကုိယ္တုိင္ Enemy နားကပ္ျပီး Bonus Physical Damage မ်ားကုိ Attack Speed ေကာင္းေကာင္းနဲ႕ တုိက္ခုိက္ေပးမယ့္ ပုံစံျဖစ္ပါတယ္။ ပုံမွန္ Initiator တစ္ေကာင္လုိ ကစားမယ္ဆုိရင္ေတာ့ Aether Lens, Shiva Guard, Refresher Orb, Veil of Discord, Crimson Guard တုိ႔ကုိ ဦးစားေပး ေရြးခ်ယ္ႏုိင္ပါတယ္။\nAether Lens ကေန ရရွိမယ့္ 8% Magic Damage Increase ဟာ Earth Splitter ရဲ႕ Overall Damage ကုိ 2% တုိးျမင့္ေစမွာျဖစ္ပါတယ္။ Refresher Orb နဲ႕သာ တြဲဖက္ျပီး အသုံးျပဳမယ္ဆုိရင္ Earth Splitter ရဲ႕ စုစုေပါင္း Damage ဟာ 52% + 52% = 104% အထိ တုိးျမင့္သြားေစပါလိမ့္မယ္။ ဒီအေျခအေနမွာ Natural Order ကေန ရရွိမယ့္ Magic Reduction ေၾကာင့္ Enemy Hero ေတြဟာ သူတုိ႔ရဲ႕ Basic Magic Reduction ပမာဏဟာ 0.25% သာလွ်င္ က်န္ေတာ့မွာျဖစ္လုိ႔ Spirit ရဲ႕ 275 AoE အတြင္းက သူတုိ႔ရဲ႕ Hp ကုိ 103.75% အထိ တုိက္ခုိက္ႏုိင္မွာျဖစ္လုိ႔ ေဘးေပါင္း အစိမ္းေရာင္ Armor သာ မရွိရင္ Instantly Kill ျဖစ္သြားေစပါလိမ့္မယ္။ Refresher Orb ကုိ အေစာပုိင္း မေရြးခ်ယ္ႏုိင္ေသးရင္လည္း Veil of Discord ကုိ အသုံးျပဳဖုိ႔ တုိက္တြန္းလုိပါတယ္။\nElder Titan ဟာ ေျမပုံ ၆ ခု ခန္႔ ဆက္တုိက္ Buff ခံေနရတဲ့အတြက္ လာမယ့္ ေျမပုံမွာလည္း ထပ္ Buff ခံရဖုိ႔ ရွိပါတယ္။ သူ႔ရဲ႕ Natural Order ကုိ 75 AoE ေလာက္ ထပ္မံတုိုးေပးျပီး Astral Spirit ရဲ႕ Cast Range ကုိသာ 100 ခန္႔ ထပ္တုိးေပးလုိက္မယ္ဆုိရင္ေတာ့ လုိတာထက္ ပုိျပီး Overpower ျဖစ္လာမယ့္ Offlane Hero တစ္ေကာင္အျဖစ္ ျပန္ျမင္ေတြ႕လာႏုိင္စရာ အေၾကာင္းရွိပါတယ္။ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိ ႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Echo Stomp",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/elder_titan_echo_stomp_hp1.png",
				"spell_overview":"AoE Disable Ability တစ္ခုျဖစ္တဲ့ Echo Stomp ဟာ 500 AoE အတြင္းက Enemy Unit ေတြအားလုံးကုိ 2/3/4/5 Seconds ခန္႔ Sleep Debuff ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဒီ Debuff သတ္ေရာက္ေနခ်ိန္မွာ Damage တစ္မ်ဴိးမ်ဴိး သတ္ေရာက္လုိက္တာနဲ႕ ခ်က္ခ်င္း Debuff ေျပသြားမွာျဖစ္ပါတယ္။ ထူးျခားခ်က္က Elder Titan ရဲ႕ 2nd Ability ျဖစ္တဲ့ Astral Spirit နဲ႕ တြဲဖက္ သုံးႏုိင္ျခင္းပဲျဖစ္ပါတယ္။ ေနာက္ဆုံးအဆင့္မွာ မိမိရဲ႕ မူလ Elder Titan အနီးတစ္ဝုိက္ 500 AoE မွာ 110 Physical Damage နဲ႕ Disable ျဖစ္ေစသလုိ Astral Spirit ရဲ႕ 500 AoE အတြင္းမွာလည္း 110 Magical Damage ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ အားနည္းခ်က္တစ္ခုကေတာ့ Cast Time 1.2 Seconds ခန္႔ၾကာျမင့္ျခင္းပဲျဖစ္လုိ႔ Echo Stomp ရဲ႕ အသုံးဝင္မႈကုိ ပုိမုိ ထိေရာက္ေစဖုိ႔ Positioning ကုိ Setting ခ်ေပးမယ့္ Teammate ေတြ အထုိက္အေလွ်ာက္ လုိအပ္ပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Astral Spirit",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/elder_titan_ancestral_spirit_hp1.png",
				"spell_overview":"အေပၚမွာေျပာခဲ့သလုိမ်ဴိး Astral Spirit ဟာ Echo Stomp နဲ႕ တြဲဖက္သုံးလုိ႔ရတဲ့ Basic Ability ျဖစ္ပါတယ္။ Cast Range 1200 ရွိျပီး အဆုိပါ Spirit ကုိ Control လုပ္ႏုိင္ပါတယ္။ Duration 8 Seconds အတြင္းမွာ Spirit နဲ႕ ထိေတြ႕ထားသမွ် Unit ေတြရဲ႕ အေရအတြက္ေပၚ မူတည္ျပီး မိမိဆီ Spirit ျပင္ဝင္လာျပီးေနာက္ Damage နဲ႕ MS bonus Buff ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ တုိက္ထားတဲ့ Hero ၁ ေကာင္တုိင္းစီအတြက္ 10/ 20/ 30/ 40 Bonus Damage နဲ႕ Unit တစ္ခုတုိင္းစီအတြက္ 6/ 9/ 12/ 15 Bonus Damage ဆီ တုိးမယ့္အျပင္ Bonus MS ကေတာ့ Hero တစ္ေကာင္အတြက္ 5% MS နဲ႕ Unit တစ္ခုစီအတြက္ 1% MS Bonus ကုိ ရရွိေစဦးမွာျဖစ္ပါတယ္။ ဒီ Buff ဟာ 9 Seconds ၾကာျမင့္မွာျဖစ္ပါတယ္။ ဥပမာ ေနာက္ဆုံးအဆင့္မွာ မိမိရဲ႕ Spirit ဟာ Enemy Hero ၄ ေကာင္ နဲ႕ Creep ၈ ေကာင္ကုိ တုိက္ျပီးမွ မိမိကုိယ္ထဲ ျပန္ဝင္လာတယ္ဆုိပါစုိ႔။ (40 x 4) + (15 x 8) = 280 Bonus Damage ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Spirit ကုိ သုံးျပီးျပီးခ်င္း မိမိစီ ခ်က္ခ်င္းျပန္မေခၚဘဲ ရရင္ရသေလာက္ Enemy Unit ေတြကုိ လုိက္ျပီး တုိက္သင့္ပါတယ္။"
			},
			{
				"spell_name":"Natural Order",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/elder_titan_natural_order_hp1.png",
				"spell_overview":"လူအမ်ား သိပ္အေလးမထားတဲ့ Natural Order ကေတာ့ Elder Titan ရဲ႕ Overpower Ability တစ္ခုျဖစ္ပါတယ္။ Elder Titan နဲ႕ သူ႔ရဲ႕ Spirit တုိ႔ အနီးတစ္ဝုိက္မွာ ရွိမယ့္ Enemy Unit ေတြရဲ႕ Basic Armor အားလုံးကုိ 100% ေလွ်ာ့ခ်လုိက္မယ့္အျပင္ Magic Resistance ကုိလည္း 33% အထိ ေလွ်ာ့ခ်ေပးဦးမွာျဖစ္ပါတယ္။ Basic Armor ဆုိတာကေတာ့ မိမိ Hero ရဲ႕ Attribute Box ထဲက အျဖဴေရာင္နဲ႕ ျပထားတဲ့ Armor ကုိ ေျပာတာျဖစ္ပါတယ္။ အဲ့ဒီ့ အျဖဴ Armor ပမာဏအတုိင္း ႏႈတ္ပစ္မွာျဖစ္လုိ႔ Assault လုိ Item မ်ဴိး ဆက္ေလ့ မရွိတဲ့ Agility Carry Hero ေတြကုိ Counter လုပ္ဖုိ႔ အလြန္တရာမွ အသုံးဝင္ပါတယ္။ ဒါ့အျပင္ 33% Magic Resistance Reduction ဆုိတဲ့ ပမာဏဟာလည္း Meepo ကလြဲရင္ က်န္တဲ့ Hero ၁၀၉ ေကာင္စလုံးကုိ Base Magic Resistance ေပ်ာက္သြားေစမယ့္ ပမာဏျဖစ္လုိ႔ မိမိအသင္းဘက္က Spell Caster ေတြရဲ႕ Magic Damage ေတြကုိ Pure Damage သဖြယ္ျဖစ္သြားေအာင္ အေထာက္အပံ့ေပးပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Earth Splitter",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/elder_titan_earth_splitter_hp1.png",
				"spell_overview":"Ultimate Earth Splitter ကေတာ့ AoE Nuke Slow Ability တစ္ခုျဖစ္ပါတယ္။ ထူးျခားခ်က္ကေတာ့ Damage ဘယ္ေလာက္ဆုိျပီး ပုံေသ ရွိမွာမဟုတ္ဘဲ Enemy ရဲ႕ Max Hp ပမာဏရဲ႕ 30%/ 40%/ 50% အတုိင္း Damage အတုိးအေလ်ာ့ရွိမွာျဖစ္ပါတယ္။ ဥပမာ ေနာက္ဆုံးအဆင့္မွာ Hp 3000 ရွိတဲ့ Pudge ကုိ 1500 Damage သတ္ေရာက္ေစႏုိင္မွာျဖစ္သလုိ တစ္ဖက္မွာ Hp 1000 ရွိတဲ့ Crystal Maiden ကုိ 500 Damage ပဲ သတ္ေရာက္ေစပါလိမ့္မယ္။ ေနာက္ထပ္ထူးျခားခ်က္တစ္ခုကေတာ့ အဆုိပါ သတ္ေရာက္မယ့္ 50% Damage ဟာ တစ္ဝက္ Magical Damage, တစ္ဝက္ Physical Damage ျဖစ္ပါတယ္။ ဆုိလုိတာက Enemy Hero ဟာ Magic Immune ျဖစ္ေနမယ္ဆုိရင္ 25% Magical Damage ကုိ ကာကြယ္ႏုိင္ေပမယ့္ 25% Physical Damage အျခမ္းကေန ေသြးေလ်ာ့ေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Elder Titan ရဲ႕ Earth Splitter Damage ကုိ အလုံးစုံ ေရွာင္ရွားဖုိ႔ မလြယတဲ့အျပင္ Earth Splitter ထိသြားတာနဲ႕ 30%/40%/50% MS Speed Slow ကုိ က်ိန္းေသေပါက္ သက္ေရာက္ေစေတာ့မွာျဖစ္ပါတယ္။ 2400 Range နဲ႕ 300 AoE ရွိတဲ့ ဒီ Ultimate ဟာ Active ျဖစ္ဖုိ႔ 3.14 Seconds ၾကာျမင့္မွာျဖစ္ပါတယ္။ Earth Splitter ကုိ အျပည့္အဝ ထိေစဖုိ႔ Astral Spirit နဲ႕ Echo Stomp Combo ကုိ ဦးစြာ အသုံးျပဳေပးဖုိ႔ လုိပါတယ္။ Aghanim’s Scepter ဆက္ခြင့္ရွိတဲ့ Earth Splitter ဟာ 4/5/6 seconds ၾကာျမင့္တဲ့ Disarm ကုို ျဖစ္ေပၚေစပါလိမ့္မယ္။"
			}
		]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/635415836609288",
		"hero_intellgience":"18 + 1.50",
		"hero_agility":"15 + 1.40",
		"hero_strength":"21 + 2.40",
		"hero_damage":"21 - 30",
		"hero_movement_speed":"300",
		"hero_armor":"1.1",
		"hero_name":"Huskar",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/huskar_vert.jpg",
		"hero_role":"Ranged - Carry - Durable - Initiator",
		"hero_detail":"Pub ျဖစ္ျဖစ္ Premium တန္း ျဖစ္ျဖစ္ Hero Pick တဲ့အခါမွာ အခ်ဴိ႕ေသာ Hero ဟာ ဘယ္ေလာက္ပဲ သုံးဖုိ႔သင့္ေတာ္ ေနပါေစ၊ Counter Pick ေတြကုိ ေရွာင္ျပီး ထုတ္ရေလ့ရွိပါတယ္။ ဒါေပမယ့္ ဒီ Hero တစ္ေကာင္ကုိေတာ့ ကစားသမား အမ်ားစုဟာ ဦးစားေပး Pick ထဲမွာ ထည့္သြင္းစဥ္းစားေလ့ မရွိေပမယ့္ Counter Pick အတြက္ ေရြးခ်ယ္တဲ့ စာရင္းမွာ ထိပ္ဆုံးက ထည့္သြင္းခံရတဲ့ Hero တစ္ေကာင္ရွိပါတယ္။ သူကေတာ့ Range Strength Hero တစ္ေကာင္လည္း ျဖစ္ျပီး Mid Lane နဲ႕ Safe Lane တုိ႔မွာ ျမင္ေတြ႕ရေလ့ရွိတဲ့ Strong Situational Hero ျဖစ္တဲ့ Huskar The Sacred Warrior ပဲျဖစ္ပါတယ္။ သူ႔ရဲ႕ Ability ဖြဲ႕စည္းပုံဟာ harass လုပ္ဖုိ႔ အားသာခ်က္ရွိရုံမကဘဲ Ganker, Carry တစ္ေကာင္အေနနဲ႕ ေဆာ့ဖုိ႔ အသင့္ေတာ္ဆုံးျဖစ္လုိ႔ သင္ ရင္းႏွီးကြ်မ္းဝင္ထားသင့္တဲ့ Hero တစ္ေကာင္ဆုိလည္း မမွားပါဘူး။",
		"hero_overview":"Huskar ဟာ Strength Grow အလြန္နည္းတဲ့ Strength Hero တစ္ေကာင္ျဖစ္ပါတယ္။ အေစာပုိင္းမွာ Hero Kill ႏုိင္ဖုိ႔အတြက္ သူ႔ရဲ႕ Burning Spear ကုိ မ်ားစြာ မွီခုိေနရတဲ့အတြက္ Damage Item ေတြအစား Regeneration နဲ႕ Hp အတြက္ အက်ဴိးရွိတဲ့ Item ေတြကုိ ဦးစြာဆက္ေလ့ရွိပါတယ္။ လက္ရွိမွာ Buff ေပးထားတဲ့ Item တစ္ခုျဖစ္တဲ့ Armlet ဟာ Huskar အတြက္ အေတြ႕ရအမ်ားဆုံး Item တစ္ခုျဖစ္ျပီး, Sange, Hood တုိ႔ကုိလည္း ေရြးခ်ယ္ေလ့ရွိတာကို ေတြ႕ရမွာပါ။ v6.81 က စလုိ႔ Burning Spear ကုိ Unique Attack Modifier ကေန ဖယ္ရွားေပးလုိက္လုိ႔ Lifesteal Item တစ္ခုျဖစ္တဲ့ Dominator ဟာ ပြဲေနာက္ပုိင္း Satanic ကုိ အဆင့္တင္ဖုိ႔အတြက္ အေစာပုိင္းေရြးခ်ယ္ႏုိင္တဲ့ Item တစ္ခုျဖစ္လာပါတယ္။ Sange ဟာ Hp Pool လုိအပ္တဲ့ Huskar အတြက္ အေစာပုိင္းေရြးခ်ယ္ႏုိင္ျပီး မိမိ Enemy ေပၚမူတည္ျပီးေတာ့ Sange and Yasha သုိ႔မဟုတ္ Heaven Halberd ကုိ အဆင့္ျမွင့္တင္ျပီး Mid Game အတြက္ ေရြးခ်ယ္ႏုိင္ပါတယ္။ Team Fight တစ္ခုအတြင္းမွာ Magic Resistance အတြက္ မပူရတဲ့ Hero ျဖစ္လုိ႔ Armor တက္ေစမယ့္၊ Hp Pool တက္ေစမယ့္ Item မ်ားဟာ Huskar ရဲ႕ Situational Item မ်ားပဲ ျဖစ္ပါတယ္။ Heart, Assault, Aghanim’s Scepter, Bkb တုိ႔ကို Mid Game ကေန စတင္၍ ေရြးခ်ယ္ႏုိင္ျပီး Damage Item အေနနဲ႕ကေတာ့ Range Hero ေတြ အတြက္ Bash Chance နည္းတဲ့ Abyssal Blade အစား Miss Chance ရွိတဲ့ Carry ေတြနဲ႕ ရင္ဆုိင္ဖုိ႔အျပင္ 35% Chance Bonus 100 Damage ေၾကာင့္ Inventory ထဲမွာ Damage Item တစ္ခုေလာက္နဲ႕ လုံေလာက္ေစမွာပါ။အဓိကအခ်က္တစ္ခုဟာ Huskar အေနနဲ႕ အျမဲတမ္း Hp နည္းေနဖုိ႔ လုိအပ္ပါတယ္။ Berserker’s Blood ေပၚမွီခုိေနရတဲ့ Huskar ဟာ Hp နည္းေနမွ Bonus Attack Speed, Bonus Resistance ကုိ ရရွိေစရုံမကဘဲ သူ႔ရဲ႕ Inner Vitality ကုိ ပုိျပီး အက်ဴိးသတ္ေရာက္ေစတဲ့အတြက္ပဲ ျဖစ္ပါတယ္။ ဒါေၾကာင့္ Team Fight တစ္ခု မစခင္ကတည္းက Life Break ကုိ နီးစပ္ရာ Creep ကုိ အသုံးျပဳျပီး ေသြးေလ်ာ့ထားတာမ်ဴိးကုိ Premium အဆင့္ ကစားပြဲေတြမွာ အျမဲ ျမင္ေနရျခင္းျဖစ္ပါတယ္။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Inner Vitality",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/huskar_inner_vitality_hp1.png",
				"spell_overview":"Huskar ရဲ႕ တစ္ခုတည္းေသာ Mana သုံးရတဲ့ Ability ျဖစ္တဲ့ Inner Vitality ကေတာ့ Huskar ရဲ႕ Healing Ability တစ္ခုျဖစ္ပါတယ္။ သူ႕ရဲ႕ က်န္တဲ့ Ability ၃ ခုအနက္ ၂ ခုဟာ Life Cost နဲ႕ အသုံးျပဳရတာျဖစ္လုိ႔ ဒီ Inner Vitality ဟာလည္း အေရးပါတဲ့ Ability တစ္ခုျဖစ္ပါတယ္။ မိမိကုိယ္ကုိ နဲ႕ Allied Hero ေတြေပၚကို အသုံးျပဳေပးလုိ႔ရျပီး 10 HP + အဆုိပါ Hero ရဲ႕ Main Attribute ပမာဏကုိမူတည္ျပီး 16 seconds Duration ရွိတဲ့ Regeneration ကုိရရွိေစမွာျဖစ္ပါတယ္။ ဥပမာ အသုံးျပဳေပးမယ့္ Hero က Intelligence စုစုေပါင္း 120 ရွိတဲ့ Storm Spirit ဆုိပါစုိ႔။ ေနာက္ဆုံးအဆင့္မွာ 20% Healing ကုိ ရရွိေနမွာျဖစ္လုိ႔ တစ္စကၠန္႔တုိင္းမွာ 120 ရဲ႕ 20% ျဖစ္တဲ့ 24 + 10 = 34 Hp ဟာ စုစုေပါင္းၾကာခ်ိန္ ၁၆ စကၠန္႔မွာ 544 Hp ကုိ Healing ျဖစ္ေစမွာျဖစ္ပါတယ္။ တကယ္လုိ႔ အဆုိပါ Storm Spirit ရဲ႕ Hp ဟာ 40% နဲ႕ေအာက္ကုိ က်ေရာက္ေနမယ္ဆုိရင္ Main Attribute ရဲ႕ 80% ႏႈန္း Healing ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ 120 intelligence ရွိတဲ့ SS ဟာ 34 Hp မဟုတ္ဘဲ 96 + 10 = 106 Hp per second ကို 40% ေသာ Hp အထိ ျပန္မေရာက္မခ်င္း Regeneration ရရွိေနမွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Burning Spear",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/huskar_burning_spear_hp1.png",
				"spell_overview":"Dps Hero တစ္ေကာင္ျဖစ္တဲ့ Huskar ရဲ႕ အဓိက Damage Out ကုိ Burning Spear ကေန ရရွိေစမွာျဖစ္ပါတယ္။ Burning Spear တစ္ေခ်ာင္း အသုံးျပဳဖုိ႔ Huskar ရဲ႕ 15 Hp ကုိ လက္ရွိ ံစ ကေန ဖယ္ရွားလုိက္မွာျဖစ္ျပီး 8 second ၾကာျမင့္တဲ့ Dps တစ္ခုကို အတုိက္ခုိက္ခံရတဲ့ Unit ေပၚ စြဲက်န္ေစပါလိမ့္မယ္။ 5/ 10/ 15/ 20 Dps ရရွိမယ့္အျပင္ Stackable Dps ျဖစ္လုိ႔ Lane Harass အျပင္ အေစာပုိင္း Team Fight ေတြမွာပါ အသုံးဝင္တဲ့ Ability ျဖစ္ပါတယ္။ Burning Spear ရဲ႕ Stack ျဖစ္ေနေသာ ပမာဏကုိ အတုိက္ခုိက္ခံရတဲ့ Enemy ရဲ႕ Status Bar ေပၚမွာ ျမင္ေတြ႕ႏုိင္မွာျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Berserker’s Blood",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/huskar_berserkers_blood_hp1.png",
				"spell_overview":"Passive Ability တစ္ခုျဖစ္တဲ့ Berserker’s Blood ကေတာ့ Huskar ကုိ Attack Speed နဲ႕ Magic Resistance ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ဒီလုိရရွိေနဖုိ႔ Huskar ဟာ Hp အျပည့္ျဖစ္ေနလုိ႔ မရပါဘူး။ Huskar ရဲ႕ ေလ်ာ့ေနတဲ့ Hp 10% တုိင္းအတြက္ 2%/ 3%/ 4%/ 5% Magic Resistance နဲ႕ 22/ 26/ 30/ 34 Attack Speed ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Huskar ရဲ႕ Hp ဟာ 10% ေအာက္ေရာက္ေနတဲ့ အခ်ိန္မွာ ဒီ Bonus ၂ ခုလုံးရဲ႕ Maximum အေျခအေနကုိ ရရွိေနမွာျဖစ္လုိ႔ 50% Bonus Magic Resistance နဲ႕ 340 Bonus Attack Speed ကို ရရွိေနပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Life Break",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/huskar_life_break_hp1.png",
				"spell_overview":"Cast Range 600 ရွိတဲ့ Ultimate Life Break ကေတာ့ Huskar ရဲ႕ Signature Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳဖုိ႔အတြက္ Huskar ရဲ႕ လက္ရွိ Hp 35% ကုိ Magic Damage အျဖစ္ မိမိဘာသာ ထိမွာျဖစ္ျပီး အသုံးျပဳခံရတဲ့ Unit ဟာလည္း ၄င္းရဲ႕ 35% ေသာ လက္ရွိ Hp ကို Magical Damage အျဖစ္ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ ဥပမာ - လက္ရွိ Hp 3000 ရွိတဲ့ Centaur Warrunner ကုိ လက္က်န္ Hp 1800 ရွိတဲ့ Huskar က Life Break အသုံးျပဳတယ္ဆုိပါစုိ႔။ 3000 Hp ရဲ႕ 35% = 1050 Magic Damage ဟာ Centaur Warrunner ကုိ သတ္ေရာက္ေစမွာျဖစ္ျပီး Huskar အတြက္ကေတာ့ 1800 Hp ရဲ႕ 35% = 630 Magic Damage ကုိ မိမိဘာသာ သက္ေရာက္ေစမွာျဖစ္ပါတယ္။ (တကယ္လုိ႔ Huskar ဟာ Bkb, Repel တုိ႔ေၾကာင့္ Magic Immune ျဖစ္ေနမယ္ဆုိရင္ေတာ့ မိမိဘာသာ 35% Self Lifebreak Damage ကုိ ထိမွာမဟုတ္ပါဘူး) ေနာက္ျပီး အသုံးျပဳခံရတဲ့ Unit ဟာ 4/ 5/ 6 seconds ၾကာျမင့္တဲ့ 40%/ 50%/ 60% MS Slow ကုိ ခံစားရဦးမွာျဖစ္ပါတယ္။"
			}
		]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/606005872883618",
		"hero_intellgience":"23 + 1.70",
		"hero_agility":"14 + 1.60",
		"hero_strength":"17 + 1.90",
		"hero_damage":"26 - 35",
		"hero_movement_speed":"295",
		"hero_armor":"-0.04",
		"hero_name":"IO",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/wisp_vert.jpg",
		"hero_role":"Ranged - Support - Escape - Nuker",
		"hero_detail":"Kunkka စတင္ပါဝင္လာခဲ့တဲ့ v6.55 ေနာက္ပုိင္းထြက္ Hero အသစ္ေတြအားလုံးဟာ လူၾကဳိက္မ်ားေလ့ရွိျပီး အရင္က Hero အေဟာင္းေတြထက္ ပုိျပီး အသုံးျပဳလုိ႔ေကာင္းတဲ့အတြက္ေၾကာင့္ ေနာက္ထြက္ Hero မ်ားဟာ Hero Pick Pool ထဲမွာ မ်ားျပားေလ့ရွိပါတယ္။ Hero အသစ္ျဖစ္ေပမယ့္ Pure Support Role ျဖစ္ေနတဲ့အတြက္ေၾကာင့္ Public Match Making ေတြမွာ ေတြ႕ရနည္းပါးေပမယ့္ Professional အဆင့္မွာေတာ့ ဝွက္ဖဲတစ္ခုအေနနဲ႕ အသုံးျပဳလွ်က္ရွိတဲ့ Hero တစ္ေကာင္ကေတာ့ Io The Guardian Wisp ပဲ ျဖစ္ပါတယ္။\nBackground Story\nျဖစ္တည္မႈတုိင္းမွာ Io ရွိပါတယ္။ ရန္သူမ်ားအတြက္ေတာ့ ဆုိးသြမ္းတဲ့အဖ်က္သမားလုိ႔ သမုတ္ခံရျပီး သူေကာင္းမ်ားအတြက္ေတာ့ အေလးျမတ္ထားရတဲ့ တန္ခုိးၾကီး မ်က္လုံးတစ္လုံး အျဖစ္ သတ္မွတ္ခံထားရတဲ့ Io ဟာ ရုပ္ပုိင္းဆုိင္ရာ ျဖစ္တည္မႈမ်ားျဖင့္ ဖြဲ႕စည္းထားတဲ့ စၾကာဝဠာအတြင္းက ကမာၻတစ္ခု၊ တစ္ခုစီတုိင္းကုိ လႊမ္းမုိးပုိင္ဆုိင္ထားသူဆုိလည္း မမွားပါဘူး။အလင္းေရာင္နဲ႕ အေမွာင္ထုတုိ႔ရဲ႕ ေမြးခ်င္းစီးနင္းသူ ႏွစ္ဦးတုိ႔ကဲ့သုိ႔ပင္ ျဖစ္တည္မႈတုိ႔ရဲ႕ အေစာပုိင္းကတည္းက ျဖစ္တည္ခဲ့တဲ့ ေရွးေဟာင္းခရီးသြားတစ္ဦး ရွိေနခဲ့ပါတယ္။ သူကေတာ့ အခ်ိန္ယႏ ၱရားထက္ပင္ ေစာစီးစြာ ျဖစ္ေပၚလာခဲ့တဲ့ Io The Guardian Wisp ပဲျဖစ္ပါတယ္။ Io ကုိ ရုိးရွင္းစြာ အဓိပါယ္ဖြင့္ဆုိရလွ်င္ အရာဝတၱဳတုိင္းမွာ ျဖစ္တည္ေနတဲ့ ဆြဲငင္အားႏွင့္ တြန္းကန္အားမ်ားကုိ စုေပါင္းထားျခင္းပင္ျဖစ္ျပီး ျမဴမႈန္တစ္မွ် ေသးငယ္ေသာ အရာဝတၱဳကေလးမ်ားကို တစ္ခုနဲ႕တစ္ခု ပူးကပ္ေနေအာင္ ခ်ဴပ္ေႏွာင္ေပးထားနုိင္ေသာ အားတစ္ခု အျဖစ္သတ္မွတ္ထားနုိင္ပါတယ္။ ရုပ္ဝတၱဳမ်ားနဲ႕ဖြဲ႕စည္းတည္ေဆာက္ထားတဲ့ ကမာၻေျမမ်ားေပၚမွာေတာ့ Io ဟာ ၄င္းတြန္းအား၊ ဆြဲအားမ်ားကုိ စိတ္တုိင္းက် ထိန္းေက်ာင္းနုိင္စြမ္းရွိတဲ့ တစ္ခုတည္းေသာ ျဖစ္တည္မႈတစ္ခုျဖစ္ပါတယ္။ ပ်က္သုန္းျခင္း၊ ေပါင္းစည္းျခင္း၊ တူညီျခင္းမရွိေတာ့ ရစ္ပတ္ခ်ည္ေႏွာင္မႈတုိ႔နဲ႕အတူ Io ဟာ မိမိရဲ႕ မိတ္ေဆြမ်ားရဲ႕ စြမ္းအားနဲ႕ ၾကံ႕ခုိင္မႈကုိ တိုးတက္ေစနုိင္စြမ္းရွိပါတယ္။ သူ႔မိတ္ေဆြရဲ႕ ေရြ႕လ်ားႏုိင္စြမ္းကုိ အႏႈိင္းမဲ့ေအာင္၊ ၾကံ႕ခုိင္မႈကုိ စိတ္ကူးမထားနုိင္ေလာက္ေအာင္ တုိးပြားေစကာ ကမာၻမ်ားအတြင္းမွာ စိတ္တုိင္းက်သြားလာေနတဲ့ Io ဟာ စၾကာဝဠာၾကီးရဲ႕ ျပီးျပည့္စုံေသာ ဆန္းၾကယ္မႈတုိ႔ကုိ စုေပါင္းျမင္ေတြ႕နုိင္မယ့္ ျဖစ္တည္မႈတစ္ခုပဲ ျဖစ္ပါေတာ့တယ္။",
		"hero_overview":"Io ဟာ စၾကာဝဠာရဲ႕ အေျခခံ အားၾကီး ၄ မ်ဴိးထဲက Electromagetic Force ကုိ ကုိယ္စားျပဳျပီး ဇာတ္ေၾကာင္းထဲက အလင္းနဲ႕အေမွာင္ စီးနင္းသူမ်ားဟာ Keeper of the Light နဲ႕ Chaos Knight တုိ႔ကို ကုိယ္စားျပဳပါတယ္။ Io ဟာ တစ္ကုိယ္တည္း ရပ္တည္ဖုိ႔ ခက္ခဲတဲ့ babysitter Hero တစ္ေကာင္ျဖစ္ပါတယ္။ သူ႕ရဲ႕ Ability အားလုံးဟာ အျခား Hero တစ္ေကာင္ကုိ အေထာက္အပံ့ေပးဖုိ႔အတြက္ ရည္ရြယ္ထားတာျဖစ္လုိ႔ လက္ရွိ Meta မွာေတာ့ Attack Speed သာ လုိအပ္တဲ့ Tiny နဲ႕ တြဲလုံးအထုတ္ဆုံး Hero တစ္ေကာင္ဆုိလည္း မမွားပါဘူး။ ဒါေပမယ့္ Armlet, Mask of Madness, Sange and Yasha က့ဲသုိ႔အတန္ငယ္ မာေက်ာျပီး Attack Speed လည္းရရွိမယ့္ Item ေတြကို ေရြးခ်ယ္ခ့ဲမယ္ဆုိရင္ေတာ့ ကုိယ္တုိင္တုိက္ခုိက္နုိင္စြမ္းရွိတဲ့ Range Hero တစ္ေကာင္ျဖစ္လာနုိင္စရာရွိပါတယ္။ ဒါေပမယ့္ မလြယ္ကူပါဘူး။ Io ဟာ Restore Share တဲ့ Support Hero တစ္ေကာင္ျဖစ္လုိ႔ Mekansm, Arcane Boots, Guardian Greaves, Urn of Shadow ကဲ့သုိ႔ Item မ်ားဟာ ေယဘုယ် လုိအပ္ခ်က္ျဖစ္ျပီး အျခား Support Item မ်ားျဖစ္တဲ့ Veil of Discord, Heaven Helbard, Solar Crest, Necronomicon, Force Staff တုိ႔ကုိသာ ေရြးခ်ယ္သြားသင့္တာျဖစ္ပါတယ္။Io (အုိင္အုိး) ဟာ ဂရိဒ႑ာရီထဲက Zeus နတ္ဘုရားသိမ္းပုိက္ခဲ့တဲ့ မိဘုရားေတြထဲက တစ္ေယာက္ျဖစ္တဲ့ Priestess of Hera နတ္ဘုရားမရဲ႕ အမည္ျဖစ္ပါတယ္။ ဒါ့အျပင္ Jupiter ျဂိဳလ္ရဲ႕ ျဂိဳလ္အရံလ ၄ လုံးထဲက တစ္လုံးရဲ႕ နာမည္ကုိလည္း Io လုိ႔ အမည္ေပးေခၚဆုိထားပါတယ္။မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Tether",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/wisp_tether_hp1.png",
				"spell_overview":"Io ရဲ႕ အေျခခံအက်ဆုံး Ability တစ္ခုျဖစ္ျပီး Ally Unit တစ္ခုခုနဲ႕ ခ်ိတ္ဆက္ သုံးေပးရမယ့္ Ability ျဖစ္ပါတယ္။ Tether အခ်ိတ္ခံရတဲ့ Unit နဲ႕ Io တုိ႔ဟာ 12 seconds Duration အတြင္းမွာ 14%/ 15%/ 16%/ 17% Movement Speed Bonus ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ 900 Range ထက္ပုိျပီး ေဝးခဲ့မယ္ဆုိရင္ေတာ့ Tether ျပတ္သြားမွာျဖစ္ျပီး Cast Range ကေတာ့ 1800 Range ရွိပါတယ္။ အဆုိပါ Tehter ၾကဳိးနဲ႕ ပြတ္တုိက္ခံရတဲ့ Unit ဟာ Attack Speed နဲ႕ Movement Speed 100% ဆီ ေလွ်ာ့ခ်ခံရမွာျဖစ္ပါတယ္။ မ်ားမ်ားယူေလ Slow Duration နဲ႕ Movement Speed Bonus Rate တုိးလာေလေလျဖစ္မယ့္ Tether မွာ အေရးအၾကီးဆုံး ထူးျခားခ်က္တစ္ခုရွိပါေသးတယ္။ အဲ့ဒါကေတာ့ Io မွာ ျဖစ္ေပၚေနတဲ့ Hp, Mp Regeneration အားလုံးရဲ႕ ၂ ဆ ေသာ ပမာဏဟာ အခ်ိတ္ခံရတဲ့ Unit ကုိ Restore ေစမွာျဖစ္ပါတယ္။ ဥပမာ Io မွာ 1 second ကုိ +3 Hp Regeneration နဲ႕ +4 Mana Regeneration ရရွိေနတယ္ဆုိရင္ Ally မွာေတာ့ +6Hp Regeneration နဲ႕ +8 Mana Regeneration ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ အေရးအၾကီးဆုံးအခ်က္ကေတာ့ Io မွာ Hp သုိ႔မဟုတ္ Mana ျပည့္ေနခဲ့မယ္ဆုိရင္ေတာ့ Io မွာ Regeneration မျဖစ္ေပၚနုိင္တဲ့အတြက္ Ally Unit မွာ Hp Mana Regeneration ကုိ ရရွိေနမွာမဟုတ္ပါဘူး။ မိမိမွာ Regeneration သတ္ေရာက္ေနမွ Ally ကုိ Share Healing ျဖစ္ေစမွာျဖစ္လုိ႔ Ally ကုိ Heal ေပးဖုိ႔အတြက္ Io မွာ Hp နဲ႕ mana ေလ်ာ့ေနဖုိ႔လုိပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Spirit",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/wisp_spirits_hp1.png",
				"spell_overview":"Io ရဲ႕ Damage Ability တစ္ခုအျဖစ္ အေနနဲ႕ေတာ့ ဒုတိယ Ability ျဖစ္တဲ့ Spirit ကုိ ျမင္ေတြ႕ရမွာျဖစ္ပါတယ္။ အသုံးျပဳလုိက္ခ်ိန္မွာ Io ရဲ႕ နံေဘးနားမွာ Spirit ၅ လုံးေပၚလာမွာျဖစ္ျပီး Enemy Unit မ်ားကုိ တုိက္ခုိက္မွာျဖစ္ပါတယ္။ Spirit နဲ႕ ထိေတြ႕မယ့္ Unit ဟာ Non-Hero Unit ျဖစ္ခဲ့မယ္ဆုိရင္ 8/ 14/ 20/ 26 Damage Per Second ျဖင့္ တုိက္ခုိက္ေစမွာျဖစ္ျပီး Hero Unit ျဖစ္ခဲ့မယ္ဆုိရင္ေတာ့ ထိသြားတဲ့ Enemy Hero ရဲ႕ 300 AoE အတြင္းမွာ 25/ 50/ 75/ 100 Damage သတ္ေရာက္ေစမွာျဖစ္ျပီး Spirit မ်ားလည္း ေပ်ာက္ကြယ္သြားမွာျဖစ္ပါတယ္။ Duration 19 Seconds နဲ႕ Cooldown 20/ 18/ 16/ 14 Seconds ရွိမွာျဖစ္လုိ႔ ေနာက္ပုိင္းအဆင့္ေတြမွာ Spirit ကုိ ၾကဳိထုတ္ထားျပီး Duration မကုန္ခင္ Spirits အသစ္ကုိ အသုံးျပဳျခင္းျဖင့္ Spirits မ်ားကုိ မိမိဘာသာ ေဖာက္ခြဲပစ္ႏုိင္မွာျဖစ္ပါတယ္။ Spirits ကုိ lvl တင္လုိက္တာနဲ႕ Spirit In, Spirit Out ဆုိတဲ့ Sub-Ability ၂ ခု ပါ တစ္ျပဳိင္နက္တည္း ရရွိမွာျဖစ္ပါတယ္။ Spirits ကုိ အသုံးျပဳျပီး တစ္မိနစ္မွာ Neutral Creep Camps ၂ အုတ္ကုိ ပြားနုိင္တဲ့ အားသာခ်က္တစ္ခုကုိ Io က ပုိင္ဆုိင္ထားပါတယ္။"
			},
			{
				"spell_name":"Overcharge",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/wisp_overcharge_hp1.png",
				"spell_overview":"Overcharge အသုံးျပဳထားတဲ့အခ်ိန္အတြင္းမွာ Io ရဲ႕ Hp နဲ႕ Mana ဟာ 4.5% စီ စကၠန္႔တုိင္းမွာ ေလ်ာ့ေနမွာျဖစ္ျပီး Attack Speed ကုိ 40/ 50/ 60/ 70 နဲ႕ Damage Reduction 5%/ 10%/ 15%/ 20% ဆီ တုိးေစမွာျဖစ္ပါတယ္။ ဒီ အားသာခ်က္ကုိ မိမိ Tehter အသုံးျပဳထားတဲ့ Unit ကလည္း အျပည့္အဝ ရရွိေနမွာျဖစ္ပါတယ္။ ေလ်ာ့ေနမယ့္ Hp နဲ႕ mana Drain ဟာ လက္က်န္ပမာဏေပၚမွာ မူတည္ျပီး တြက္ခ်က္မွာျဖစ္လုိ႔ ေသြးနည္းလာေလေလ ေလ်ာ့မယ့္ ပမာဏ နည္းပါးသြားေလျဖစ္ပါလိမ့္မယ္။ Io ဟာ Ally Hero ကုိ Babysit ေပးရတဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ Tehter အသုံးျပဳျပီး Heal ေပးတဲ့အခါမွာ Tether ရဲ႕ လုိအပ္ခ်က္အတုိင္း သူ႔မွာ ေသြးေလ်ာ့ေနဖုိ႔ လုိပါတယ္။ ဒါေၾကာင့္ Overcharge ကုိ အေစာပုိင္းမွာ တစ္ဆင့္ေလာက္ယူထားျပီး မိမိ Hp နဲ႕ Mana ကုိ မိမိ စိတ္တုိင္းက် ေလွ်ာ့ခ်နုိင္ပါတယ္။"
			},
			{
				"spell_name":"Relocate",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/wisp_relocate_hp1.png",
				"spell_overview":"Io ဟာ cast time 2.5/ 2.25/ 2 Seconds အတြင္းမွာ မိမိ နဲ႕ Tether ခ်ိတ္ထားတဲ့ Unit နဲ႕အတူ 12 seconds ၾကာျမင့္တဲ့ Global ခရီးသြားနုိင္စြမ္းကုိ ရရွိမယ့္ Relocate ဆုိတဲ့ Ultimate ကုိ ပုိင္ဆုိင္ထားပါတယ္။ ကစားပြဲတစ္ခုရဲ႕ အလွည့္အေျပာင္းမ်ားစြာကုိ ျဖစ္ေပၚေစနုိင္တဲ့ Ultimate တစ္ခုျဖစ္လုိ႔ Professional မ်ား ေၾကာက္ရြံ႕ရတဲ့ Ultimate ဆုိလည္း မမွားပါဘူး။ ေျမပုံတစ္ခုမွာ တုိေတာင္းတဲ့အခ်ိန္အတြင္း Hero ၂ ေကာင္ ရုတ္တရက္ေရာက္လာနုိင္တဲ့ Ability ျဖစ္လုိ႔ Ganking လုပ္ျခင္း၊ ေခ်ာင္းေျမာင္းသတ္ျဖတ္ျခင္း၊ စစ္ကူျဖည့္ေပးျခင္း စတဲဲ့ အေျခအေနတုိင္းအတြက္ အသုံးျပဳလုိ႔ေကာင္းျပီး မိမိရဲ႕ Ally Unit တစ္ခုခုကုိ ကယ္ေပးဖုိ႔အတြက္လည္း အသုံးျပဳနုိင္ပါတယ္။ ထုိသုိ႔အသုံးျပဳဖုိ႔အတြက္ Io ဟာ Relocate ကုိ Double Click ႏွိပ္ျပီး ၂ စကၠန္႔အတြင္းမွာ မိမိကယ္မယ့္ Ally Hero ကုိ ရုိးရွင္းစြာ Tether ခ်ိတ္ေပးလုိက္ရုံပါပဲ။ အဆုိပါ Relocate ေရာက္ရွိမယ့္ ေနရာမွာ Delay Time အတြင္း 300 AoE Flying Vision ကုိ ရရွိမွာျဖစ္ျပီး 300 AoE အတြင္းက သစ္ပင္မ်ားကုိေတာ့ ပ်က္စီးေစပါလိမ့္မယ္။"
			}
		]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/649947158489489",
		"hero_intellgience":"16 + 1.60",
		"hero_agility":"18 + 2.25",
		"hero_strength":"23 + 2.80",
		"hero_damage":"38 - 42",
		"hero_movement_speed":"295",
		"hero_armor":"5.52",
		"hero_name":"Nightstalker",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/night_stalker_vert.jpg",
		"hero_role":"Melee - Carry - Initiator - Durable - Disabler - Nuker",
		"hero_detail":"Patch Update အသစ္တစ္ခု ထြက္လာတုိင္းမွာ Hero အမ်ားစုက သိသာတဲ့ ကိန္းဂဏန္းေတြနဲ႕ ေျပာင္းလဲေနၾကေပမယ့္ တစ္ႏွစ္ခြဲေလာက္ၾကာခဲ့ျပီျဖစ္တဲ့ v6.83 Patch update ကေန ယခုအခ်ိန္ထိ ေထြေထြထူးထူး ထပ္မံေျပာင္းလဲျခင္း မရွိသည့္တုိင္ေအာင္ Premium အဆင့္ ကစားပြဲေတြအထိ Situational Hero တစ္ေကာင္အျဖစ္ ျမင္ေတြ႕ေနရေလ့ရွိတဲ့ Hero တစ္ေကာင္ကေတာ့ Balanar The Nightstalker ပဲျဖစ္ပါတယ္။ Strength Hero တစ္ေကာင္ျဖစ္ျပီး ကစားပြဲတစ္ပြဲရဲ႕ အခ်ိန္အပိုင္းအျခားေပၚလုိက္ကာ အသုံးဝင္မႈကုိ ေျပာင္းလဲေစတဲ့ Initiator, Ganker, Durable Hero ေကာင္းတစ္ေကာင္ျဖစ္ပါတယ္။ ကစားပြဲရဲ႕ ညဘက္အခ်ိန္ကုိ ေရာက္တုိင္း ၄င္းရဲ႕ နာမည္နဲ႕လုိက္ေအာင္ Basic Ability အားလုံးက Strong ျဖစ္လာတဲ့ Hero တစ္ေကာင္ျဖစ္ျပီး Ultimate ဟာလည္း Enemy Team တစ္ခုလုံးရဲ႕ Vision ကုိ အၾကီးအက်ယ္ ဒုကၡေပးမယ့္ Global Ability တစ္ခုျဖစ္ပါတယ္။ Nightstalker ဟာ Frozen Throne Dota ကတည္းက လူၾကဳိက္မ်ားခဲ့တဲ့ Hero ေကာင္းတစ္ေကာင္ ျဖစ္တဲ့ အခ်က္ကုိေတာ့ ျငင္းခ်က္ထုတ္လုိ႔မရပါဘူး",
		"hero_overview":"Nightstalker ဟာ Base Hp regen +2 ရွိတဲ့ Strength Hero တစ္ေကာင္ျဖစ္ပါတယ္။ အလယ္အလတ္ထက္ ပုိတဲ့ Strength Grow လည္းရွိျပီး Tanky လည္းျဖစ္တဲ့အတြက္ ပြဲအေျခအေနေပၚလုိက္ျပီး Durable, Ganker အျပင္ Carry အထိပါ တုိးျပီး ေဆာ့လုိ႔ရတဲ့ Hero ေကာင္းတစ္ေကာင္ျဖစ္ပါတယ္။ Void ဟာေန႔ဘက္မွာသုံးလည္း မ်ားျပားတဲ့ nuke Damage ကုိ သတ္ေရာက္ေစေသးတဲ့အတြက္ေၾကာင့္ အေစာဆုံး တင္သင့္ေပမယ့္ Crippling Fear ကေတာ့ ညဘက္ေရာက္မွ Duration တုိးမယ့္ အားသာခ်က္ရွိလုိ႔ Hunter in the Night Passive ကုိ ဒုတိယ ဦးစားေပးအေနနဲ႕ တင္သင့္ပါတယ္။ Dota ကစားပြဲတစ္ခုဟာ ေန႔ဘက္အတြက္ 240 seconds (4 minutes) နဲ႕ ညဘက္အတြက္ 240 seconds (4 minutes) ဆီ အလွည့္က် လာတာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Duration 50 seconds ကုိ ေန႔ဘက္ရဲ႕ ေနာက္ဆုံး မိနစ္ (ညေရာက္ဖုိ႔ စကၠန္႔ ၅ဝ အလုိေလာက္မွာ အသုံးျပဳ) ေပးျခင္းအားျဖင့္ ပုံမွန္ည မစခင္ Darkness ည ၁ မိနစ္၊ ပုံမွန္ည ျပီးျပီးျခင္း Darkness ည ၁ မိနစ္ ဆုိျပီး အသုံးျပဳႏုိင္မွာမုိ႔လို႔ ေန႔ခင္း ၄ မိနစ္နဲ႕ ည ၄ မိနစ္ အစား ေန႔ခင္း ၂ မိနစ္ နဲ႕ ည ၆ မိနစ္ဆုိတဲ့ ရွည္လ်ားတဲ့ ညတာကုိ ရရွိေစမွာျဖစ္ပါတယ္။Attack Speed အတြက္ မပူရတဲ့ Hunter In the Night ေၾကာင့္ Nightstalker ကုိ Power Tread အျပင္ Phase Buff ကုိ ေပးမယ့္ Damage ပါ တုိးမယ့္ Phase Boots ကုိ ပုိျပီး ေရြးခ်ယ္ေလ့ရွိပါတယ္။ ပြဲကစားခ်ိန္ ၂၅ မိနစ္ မတုိင္ခင္အထိဟာ Nightstalker ကုိ Aggressive Ganker တစ္ေကာင္အေနနဲ႕ အသုံးျပဳဖုိ႔ အသင့္ေတာ္ဆုံးအခ်ိန္ျဖစ္လုိ႔ Urn of Shadow လုိ Dmg, Healing အတြက္ အသုံးဝင္တဲ့ Base Item မ်ဴိး၊ Medallion, orb of venom, blight stone တုိ႔ကုိ ေရြးႏုိင္ျပီး Teamfight တစ္ခုမွာ Spell ထြက္ျပီးတာနဲ႕ တာဝန္ေက်တဲ့ Initiator မ်ဴိး မဟုတ္ဘဲ အသက္ရွင္ဖုိ႔ လုိအပ္တဲ့ Initiator မ်ဴိးျဖစ္လုိ႔ Sange and Yasha, Aghanim’s Scepter, Crimson Guard, Pipe, Armlet, Offering, bkb တုိ႔ကုိ ေရြးခ်ယ္သင့္ပါတယ္။ ၂၅ မိနစ္ထက္ ေက်ာ္လြန္လာခဲ့ရင္ေတာ့ Situational Item ေတြ ျဖစ္တဲ့ Lotus Orb, Linken Sphere, Silver Edge တုိ႔ကုိ ေရြးခ်ယ္ႏုိင္သလုိ ကုိယ္တုိင္ Carry လုပ္ျပီး ေဆာ့ရမယ့္ ကစားပြဲေတြ အတြက္ေတာ့ Desolator, Abyssal Blade, Satanic တုိ႔ကုိ အေျခအေနအရ ေရြးခ်ယ္သင့္ပါတယ္။Balanar Nightstalker ဟာ Flexible က်တဲ့ Ganker Carry တစ္ေကာင္ျဖစ္လုိ႔ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Void",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_void_hp1.png",
				"spell_overview":"Nightstalker ရဲ႕ တစ္ခုတည္းေသာ Nuke Ability ျဖစ္တဲ့ Void ဟာ Single Target Magic Damage Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳခံရတဲ့ Enemy ကုိ MS နဲ႕ AS ကုိ Slow ေစမွာျဖစ္ျပီး မ်ားမ်ားတင္ေလ Mana Cost တက္လာေလ ျဖစ္လာမွာပါ။ ေန႔ဘက္မွာ အသုံးျပဳတဲ့အခါ Slow Duration ဟာ ပုံေသ 2 seconds ပဲ ရွိမွာျဖစ္ေပမယ့္ ညဘက္ အသုံးျပဳတဲ့အခါတုိင္းမွာေတာ့ 2.5/ 3/ 3.5/ 4 seconds ဆုိျပီး ပုိၾကာမွာျဖစ္ပါတယ္။ Damage ဟာလည္း 90 ကေန စျပီး ေနာက္ဆုံးအဆင့္မွာ 335 Magical Damage ဆုိတဲ့ မ်ားျပားလွတဲ့ Magic Dmg ပမာဏကုိ ေပးမွာျဖစ္လုိ႔ ရုိးရွင္းစြာဘဲ lvl 7 မွာ အဆုံးထိ တင္ေလ့ ရွိတဲ့ Nuke Ability တစ္ခုျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Crippling Fear",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_crippling_fear_hp1.png",
				"spell_overview":"Crippling Fear ကေတာ့ Single Target Silence Ability တစ္ခုျဖစ္ပါတယ္။ ထုံးစံအတုိင္း ေန႔ဘက္မွာ သုံးတဲ့အခါ ပုံေသ 3 seconds Silence နဲ႕ Miss Chance 10% ရွိမွာျဖစ္ပါတယ္။ ညဘက္ အသုံးျပဳတဲ့အခါတုိင္းမွာမွ Silence Duration ဟာ 5/ 6/ 7/ 8 seconds ဆုိတဲ့ ၾကာျမင့္ေသာ Silence ကုိ ရရွိမွာျဖစ္ျပီး Miss Chance ဟာလည္း 50% အထိ သတ္ေရာက္မွာျဖစ္ပါတယ္။ Miss Chance ဟာ အသုံးျပဳခံရတဲ့ Enemy အေနနဲ႕ Physical Attack တစ္ခု ျပဳလုပ္လုိက္တုိင္း Miss ျဖစ္သြားမယ့္ ရာခုိင္နႈန္းကုိ ဆုိလုိျခင္းျဖစ္ပါတယ္။ ပုံေသ Mana Cost 50 နဲ႕ Cooldown 12 seconds ရွိလုိ႔ ၁ ဆင့္ေလာက္ တင္ထားရင္ အေစာပုိင္းမွာ လုံေလာက္တဲ့ Ability တစ္ခုျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Hunter in the Night",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_hunter_in_the_night_hp1.png",
				"spell_overview":"Nightstalker ကုိ ေၾကာက္မက္ဖြယ္ေကာင္းတဲ့ သတၱဝါၾကီး အျဖစ္ေျပာင္းလဲေစမယ့္ Passive Ability ကေတာ့ Hunter in the Night ပဲျဖစ္ပါတယ္။ ညအခ်ိန္ေရာက္တုိင္း Nightstalker ဟာ Hunter in the Night Ability ကုိ ယူထားတဲ့အဆင့္အလုိက္ Movement Speed နဲ႕ Attack Speed ေတြ တုိးေနေစမွာျဖစ္ပါတယ္။ ေနာက္ဆုံးအဆင့္မွာေတာ့ 35% MS Bonus နဲ႕ +90 Attack Speed ကုိ ရရွိေစမွာပါ။"
			},
			{
				"spell_name":"Darkness",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/night_stalker_darkness_hp1.png",
				"spell_overview":"Nightstalker ရဲ႕ Basic Ability အားလုံးဟာ ညဘက္ေရာက္မွ ပုိမုိအစြမ္းထက္တာျဖစ္ပါတယ္။ ဒါေၾကာင့္ Nightstalker အတြက္ ညအခ်ိန္ကို ဖန္တီးေပးဖုိ႔ Darkness ဟာ Ultimate Ability တစ္ခုအေနနဲ႕ ပါဝင္ေနပါတယ္။ Darkness အသုံးျပဳလုိက္တဲ့အခါ Nightstalker ရဲ႕ Ability မ်ားအားလုံးကုိ Strong ျဖစ္သြားေစမယ့္ အျပင္ အထိေရာက္ဆုံး အားသာခ်က္တစ္ခုကေတာ့ Enemy Hero တုိင္းရဲ႕ Vision ကုိ 675 အထိ ေလွ်ာ့ခ်ပစ္လုိက္မယ့္ အခ်က္ပဲျဖစ္ပါတယ္။ Hero အမ်ားစုဟာ Night Vision 1200 ခန္႔ ရွိၾကတာျဖစ္လုိ႔ Nightstalker ရဲ႕ Darkness ဟာ Enemy Hero တုိင္းကုိ အျမင္ အကြာအေဝးတစ္ဝက္ခန္႔ကုိ အေမွာင္ဖုန္းေပးလုိက္မယ့္ အားသာခ်က္ၾကီး ျဖစ္ေနပါတယ္။ ဒါ့အျပင္ ေန႔ဘက္ေရာ၊ ညဘက္မွာပါ Vision Range 1600 ခန္႔ရွိတဲ့ Observer Ward မ်ားကုိပါ Vision Range ကုိ 675 အထိ ေလွ်ာ့ခ်လုိက္ျခင္းေၾကာင္း Nightstalker ကုိ Ganker, Hunter ေကာင္းတစ္ေကာင္ျဖစ္မွာပါ။ သတိျပဳရမယ့္ တစခုကေတာ့ Darkness ကုိ ညဘက္အခါမွာ အသုံးျပဳရင္ Darkness Duration ဟာ ပုံမွန္အတုိင္း ကုန္ဆုံးေနမယ့္ အခ်က္ပဲျဖစ္ပါတယ္။Darkness ဟာ Aghanim’s Scepter ဆက္ခြင့္ရွိတဲ့ Ultimate တစ္ခုျဖစ္ျပီး Nightstalker ကုိ ညဘက္ေရာက္တုိင္း 1800 Flying Vision ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ Cooldown 160/ 120/ 80 seconds ရွိျပီး ပုံေသ Duration 50 seconds ရွိပါတယ္။"
			}
		]
 },

 {
		"share_hero":"https://web.facebook.com/yahooyeehadotasuggestion/posts/605244319626440",
		"hero_intellgience":"17 + 1.80",
		"hero_agility":"15 + 1.75",
		"hero_strength":"22 + 2.80",
		"hero_damage":"31 - 41",
		"hero_movement_speed":"305",
		"hero_armor":"5.1",
		"hero_name":"Omniknight",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/omniknight_vert.jpg",
		"hero_role":"Melee - Support - Durable - Nuker",
		"hero_detail":"Dota 2 Esports မွာ ကစားသမားတစ္ေယာက္ရဲ႕ ကြ်မ္းက်င္မႈအဆင့္ကုိ Match Making Ranking (MMR) ဆုိတဲ့ Points နဲ႕ ခြဲျခားသတ္မွတ္ျပလ်က္ ရွိပါတယ္။ ဒီလုိ MMR ဟာ Under 2k, 3k, 4k, 5k နဲ႕ 5k above ဆုိျပီး အပုိင္းအျခားအလုိက္ Hero Pick Rate, Win Rate, Popular ျဖစ္မႈေတြဟာ အပုိင္းအျခားအလုိက္ တူညီမႈ မရွိႏုိင္ပါဘူး။ ဥပမာ Io The Guardian Wisp လုိ႔ အမည္ရတဲ့ Support Hero ဟာ Under 2k မွာ 38% Win Rate ပဲ ရွိေပမယ့္ Above 5k မွာေတာ့ 51% အထိ ရွိေနပါတယ္။ ဒီလုိပါပဲ။ 5k Above မွာ Outworld Devourer ဟာ တတိယေျမာက္ Pick Rate အျမင့္ဆုံး Hero တစ္ေကာင္ျဖစ္ေပမယ့္ Under 2k မွာ (၁၇) ေကာင္ေျမာက္ Pick Rate အမ်ားဆုံး ရွိတာကို ေတြ႕ရပါတယ္။ ဒီလုိ MMR အပုိင္းအျခားအလုိက္ Hero တစ္ေကာင္ရဲ႕ Win Rate ဟာ မတူညီႏုိင္ေပမယ့္ ထူးထူးျခားျခား Hero တစ္ေကာင္ရွိပါတယ္။ သူဟာ 2k, 3k, 4k, 5k, 5k above မည္သည့္ MMR အပုိင္းအျခားမွာ မဆုိ Win Rate အေကာင္းဆုံး Hero တစ္ေကာင္ျဖစ္ေနပါတယ္။ သူကေတာ့ Frozen Throne Dota ရဲ႕ အေစာပုိင္း ကာလမ်ားကတည္းက ရွိခဲ့တဲ့ Senior Support Hero တစ္ေကာင္ျဖစ္တဲ့ Purist Thunderwrath, The Omniknight ပဲျဖစ္ပါတယ္။Omniknight ဟာ Melee Strength Support Hero တစ္ေကာင္ျဖစ္ျပီး သူ႔ရဲ႕ ရုိးရွင္းတဲ့ Ability ဖြဲ႕စည္းပုံဟာ ကစားပြဲတစ္ခုရဲ႕ ေနာက္ခ်န္ Support တစ္ေကာင္အျဖစ္ အသုံးဝင္စြာ ကစားႏုိင္ေလ့ရွိတာကို ေတြ႕ရပါတယ္။ Healing, Magic Immune, Area Slow နဲ႕ Physical Invulnerablity တုိ႔ကို ပုိင္ဆုိင္ထားတဲ့ Omniknight ဟာ Dota 2 သက္တမ္းတစ္ေလွ်ာက္ လက္ရွိအခ်ိန္အထိ မွတ္တမ္မ်ားအရ Professional ကစားပြဲေတြထက္ Pub Match ေတြမွာ ပုိမုိေအာင္ျမင္မႈ ရထားတာကို ေတြ႕ရပါတယ္။ ဒါေၾကာင့္ သင္က Support Player တစ္ေယာက္ျဖစ္ျပီး MMR အတြက္ မပ်င္းမရိ ေဆာ့ကစားႏုိင္ဖုိ႔ စဥ္းစားသင့္တဲ့ Hero ထဲမွာ ရုိးရွင္းျပီး ကုိင္တြယ္ရလြယ္ကူတဲ့ Omniknight ကုိ ထည့္သြင္းစဥ္းစားသင့္ပါတယ္။",
		"hero_overview":"တစ္ဖက္အသင္းက Spell Caster ေတြ အရမ္းမ်ားရင္ Repel ပါတဲ့ Omniknight ကုိ ေရြးခ်ယ္သင့္ျပီး Carry ေတြ အရမ္းမ်ားေနရင္လည္း Guardian Angel ပါတဲ့ Omniknight ကုိ ေရြးခ်ယ္တာ မမွားပါဘူး။ လက္ရွိ Meta ဟာ Aggressive Meta ျဖစ္ပါတယ္။ ကစားပြဲအစပုိင္းမွာ Spell Caster ေတြဟာ မ်ားစြာ အသုံးဝင္ပါတယ္။ အေၾကာင္းက ပြဲကစားခ်ိန္ ၁၅ မိနစ္ ဝန္းက်င္မွာ Hero တစ္ေကာင္ဟာ ေယဘုယ် Hp 1000 ဝန္းက်င္ခန္႔သာ ရွိပါတယ္။ Lvl 7 အေရာက္မွာ Standard Nuke Ability တစ္ခုရဲ႕ Damage ဟာ 300 Magic Damage ခန္႔ရွိပါတယ္။ တစ္ဖက္အသင္းက Ganker ေတြဟာ အထက္မွာေျပာခဲ့သလုိ Nuke Ability တစ္ေယာက္တစ္ခုႏႈန္းသုံးေပးလုိက္ရင္ေတာင္ Ability Click ၃ ခ်က္ေလာက္မွာ Damage Output 900 ခန္႔နဲ႕ Hero တစ္ေကာင္ကုိ မ်ားစြာ ဒုကၡေပးႏုိင္တယ္လုိ႔ အၾကမ္းဖ်ဥ္း တြက္ခ်က္ၾကည့္လုိ႔ရပါတယ္။ ဒီလုိ Aggressive ဆန္တဲ့ အေစာပုိင္း ဒုကၡေပးႏုိင္တဲ့ Ganker ေတြရဲ႕ Spell ရန္ကေန Click တစ္ခ်က္တည္းနဲ႕ ကာကြယ္ေပးႏုိင္တာ Omniknight တစ္ေကာင္သာ ရွိပါတယ္။ Carry Hero တုိင္းရဲ႕ အေျခခံလုိအပ္ခ်က္ျဖစ္တဲ့ Bkb လိုအပ္ခ်က္ကုိ အေစာပုိင္းကတည္းက ျဖည့္စည္းေပးႏုိင္တာ Omniknight တစ္ေကာင္သာ ရွိပါတယ္။ အလားတူ MMR အပုိင္းအျခားမေရြး၊ ကြ်မ္းက်င္မႈ မေရြးဘဲ MMR Push ႏုိင္တဲ့ Hero ဟာလည္း Omniknight တစ္ေကာင္သာရွိပါတယ္။MMR ကုိ အာရုံစုိက္မယ့္ Omniknight အတြက္ေတာ့ Soul Ring, Guardian Greaves ကို အေျခခံလုိအပ္ခ်က္အျဖစ္ ထည့္သြင္းစဥ္းစားေပးရမွာျဖစ္ျပီး တတိယ Item Slot ကုိေတာ့ Aghanim's Scepter ကုိသာ ထည့္သြင္းဖုိ႔ တုိက္တြန္းလုိပါတယ္။ Eul Staff, Drum, Offering ကဲ့သုိ႔ Item မ်ားကုိလည္း မိမိအသင္းအတြက္ လုိအပ္ခ်က္အရ ထည့္သြင္းေပးႏုိင္ေပမယ့္ Aghanim ကုိ ဦးစားေပး စဥ္းစားေစခ်င္တဲ့ အဓိက ရည္ရြယ္ခ်က္က သူ႔ရဲ႕ အဓိကအားနည္းခ်က္ျဖစ္တဲ့ ေနာက္ခ်န္ ကစားပုံေၾကာင့္ျဖစ္ပါတယ္။ Omniknight ဟာ Long Range, Disable, Ez Nuke, Ez Debuff Ability မရွိတဲ့ Hero ျဖစ္လုိ႔ Assist Gold ရဖုိ႔ အခက္အခဲဆုံး Hero တစ္ေကာင္ျဖစ္ပါတယ္။ ဒါေၾကာင့္ ပုိက္ဆံရဖုိ႔အတြက္ အျခား Hero ေတြထက္ ခဲခက္လုိ႔ အသင္းအတြက္ အေကာင္းဆုံး အက်ဴိးရွိမယ့္ Aghanim's Scepter ကုိ အခက္အခဲမ်ားၾကားက အတတ္ႏုိင္ဆုံး ေစာေစာရေစဖုိ႔ အၾကံျပဳရျခင္းျဖစ္ပါတယ္။ Item Build ကေတာ့ မိမိကြ်မ္းက်င္ရာ၊ လုိအပ္ရာအတုိင္း ေရြးခ်ယ္ဝယ္ႏုိင္တဲ့အတြက္ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံးျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Purification",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/omniknight_purification_hp1.png",
				"spell_overview":"ရုိးရွင္းတဲ့ Healing နဲ႕ AoE Nuke Ability ျဖစ္တဲ့ Purification ကေတာ့ ဘယ္လုိအေၾကာင္းျပခ်က္ေၾကာင့္ျဖစ္ျဖစ္ ကစားသမားအားလုံးနီးပါးက lvl 7 မွာ ဂိတ္ဆုံးယူေလ့ရွိတဲ့ Basic Healing Ability တစ္ခုျဖစ္ပါတယ္။ မိမိအသုံးျပဳလုိက္တဲ့ Target Unit ကုိ 90/ 180/ 270/ 360 Hp Heal ေစမွာျဖစ္ျပီး ၄င္း Target ရဲ႕ 260 AoE တစ္ဝုိက္မွာေတာ့ 90/ 180/ 270/ 360 Pure Damage ကုိ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ Dota 2 မွာ ရွားရွားပါးပါး Pure Damage Ability အမ်ဴိး (၃ဝ) သာရွိျပီး ၄င္းတုိ႔ထဲက တစ္ခုျဖစ္တဲ့ Purification ကုိ lvl 7 မွာ အဆုံးထိ ယူျခင္းက အသင့္ေတာ္ဆုံးနဲ႕ အေျခခံအက်ဆုံး ေရြးခ်ယ္မႈပဲျဖစ္ပါလိမ့္မယ္။ v6.84 အထိ Purification ရဲ႕ Cast Time ဟာ 0.5 second ရွိျပီး ယခု v6.85 အေရာက္မွာေတာ့ 0.25 second Cast Time အထိ က်ဆင္းသြားခဲ့ျပီျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Repel",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/omniknight_repel_hp1.png",
				"spell_overview":"3975 Gold ေပးမွ ရရွိမယ့္ Magic Immunity ကုိ Omniknight အေနနဲ႕ အကုန္အက် တစ္ျပားမွ မေပးရဘဲ ပုိင္ဆုိင္ထားပါတယ္။ Repel ဟာ နည္းပါးတဲ့ 14 seconds Cooldown, ရွည္ၾကာတဲ့ 12 seconds Duration အျပင္ မိမိတစ္ကုိယ္တည္းအတြက္မကဘဲ Support Hero ပီပီ မိမိ Allied Hero မ်ားအတြက္ပါ အသုံးျပဳေပးလုိ႔ရတဲ့ အထူးျခားဆုံး အားသာခ်က္ကုိ ပိုင္ဆုိင္ထားတာပဲျဖစ္ပါတယ္။ Omniknight ရဲ႕ Win Rate အမ်ားဆုံး ျဖစ္ေနရတဲ့ အဓိက အခ်က္က ၄င္း Repel ကေန ရရွိတဲ့ Dispel ေၾကာင့္ပဲျဖစ္ပါတယ္။ Magic Immune ျဖစ္ေစရုံသာမက အသုံးျပဳလုိက္တဲ့အခါမွာ မိမိ Allied Hero အေပၚမွာ သက္ေရာက္ဆဲျဖစ္တဲ့ Basic Debuff ေတြကုိ ပ်က္ျပယ္ေစတဲ့ Basic Dispel ကုိ သတ္ေရာက္ေစတဲ့အတြက္လည္းျဖစ္ပါတယ္။ Repel ကုိ လုံးဝဖ်က္ဆီးပစ္လုိက္လုိ႔ရတဲ့ Ability ဆုိလုိ႔ Dota 2 မွာ (၆) မ်ဴိးသာ ရွိပါတယ္။ ၄င္းတုိ႔ကေတာ့ Brewmaster Ultimate (Storm Panda - Dispel Magic), Diffusal Blade (Purge) နဲ႕ Neutral Creep (Satyr Banisher - Purge), Fortune End (Oracle), Doom (Doom), Demonic Purge (Shadow Demon) တုိ႔ပဲျဖစ္ပါတယ္။ Magic Immune ကို ေဖာက္ထြင္းသုံးလုိ႔ရတဲ့ Ability ေတြအေျမာက္အမ်ားရွိေပမယ့္ ၄င္းတုိ႔ဟာ Repel ကုိ ဖ်က္စီးပစ္ႏုိင္စြမ္းမရွိပါဘူး။ (စကားခ်က္ - Dispel ဟာ မ်ားစြာ အေရးပါပါတယ္။ ဒါေၾကာင့္ Strong Dispel (Aphotic Shield) ကို ပုိင္ဆုိင္ထားတဲ့ Abaddon ဟာလည္း အေအာင္ျမင္ဆုံး Hero ၃ ေကာင္ထဲက တစ္ေကာင္ျဖစ္ေနတာပါ။)"
			},
			{
				"spell_name":"Degen Aura",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/omniknight_degen_aura_hp1.png",
				"spell_overview":"Degen Aura ရဲ႕ AoE ကေတာ့ ၾကီးၾကီးမားမားမဟုတ္ေပမယ့္ 350 AoE အတြင္းက Non-Allied Unit အားလုံးဟာ Attack Speed ေရာ၊ Move Speed ပါ Slow ေစမွာျဖစ္ပါတယ္။ Slow Rate ဟာ 10%/ 18%/ 26%/ 34% ဆုိျပီးရွိတဲ့အတြက္ အခ်ဴိ႕ေသာ Carry Omniknight Player မ်ားက Sange Yasha ကဲ့သုိ႔ Slow Item မ်ားကုိ တြဲဖက္အသုံးျပဳရျခင္းျဖစ္ပါတယ္။ သင္က Hard Support တစ္ေကာင္လုိ ေဆာ့တဲ့အခါမွာ Lvl 10 ေလာက္ေရာက္တဲ့ အထိ အေမ့ခံထားလုိ႔ရတဲ့ Ability တစ္ခုျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Guardian Angel",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/omniknight_guardian_angel_hp1.png",
				"spell_overview":"600 AoE အတြင္းက Ally Unit ေတြအားလုံးကုိ +9999 Armor ေပါင္းသြားေစျပီး 99.999% Physical Damage Resistance ျဖစ္သြားေစမယ့္ Ultimate Ability ျဖစ္ပါတယ္။ Juggernaut, Ursa, Riki တုိ႔ကဲ့သုိ႔ Physical Damage နဲ႕ သိသိသာသာ ဒုကၡေပးတဲ့ Damage Dealer Carry မ်ားကုိ Counter Pick ဖုိ႔အတြက္ ထည့္သြင္းစဥ္းစားေလ့ ရွိပါတယ္။ အထူးသျဖင့္ Tower Defence လုပ္တဲ့အခါနဲ႕ Late Game Battle ေတြမွာ သိသိသာသာအသုံးျပဳေလ့ရွိျပီး Aghanim's Scepter ဆက္ဖုိ႔ အသင့္ေတာ္ဆံုး Ultimate တစ္ခုလည္းျဖစ္ပါတယ္။ Aghanim ေၾကာင့္ 600 AoE ကေန Global AoE ျဖစ္သြားျပီး Duration ကုိလည္း ယခင္ကထက္ 2 seconds ေတာင္ တုိးသြားေစဦးမွာျဖစ္ပါတယ္။ v6.78 Patch Update က စတင္၍ Aghanim ခြင့္ရခဲ့ျပီး ထုိစဥ္က Ultimate အသုံးျပဳထားခ်ိန္အတြင္းမွာ +25 Hp Regen ကုိပါ ရရွိေစခဲ့တဲ့အတြက္ Aghanim Guardian Angel ဟာ Tower ေတြကို အလြယ္တကူ Healing လုပ္လုိ႔ရခဲ့ပါတယ္။ ဒါေပမယ့္ v6.82c မွာ ဒီ +25 Hp Regen Buff ကုိ ပယ္ဖ်က္ေပးလုိက္ပါျပီ။ သုိ႔ေပမယ့္ ယခုအခ်ိန္ထိ Ultimate Guardian Angel ဟာ အသုံးဝင္ဆဲ Ability တစ္ခုဆုိတာေတာ့ ျငင္းလုိ႔မရပါဘူး။ အသင္းတစ္သင္းရဲ႕ 5 seconds Duration နဲ႕ 300 Seconds Cooldown ရွိတဲ့ Glyph of Fortification ကုိ Aghanim's Scepter ဆက္ထားတဲ့ Omniknight အသင္းဟာ 10 seconds Duration နဲ႕ 150 seconds Cooldown ရွိတဲ့ Glyph of Fortification ကုိ ပုိင္ဆုိင္ထားတာနဲ႕ တူညီပါေသးတယ္။"
			}
		]
 },

 {
		"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/594250537392485",
		"hero_intellgience":"14 + 1.80",
		"hero_agility":"17 + 1.70",
		"hero_strength":"29 + 2.40",
		"hero_damage":"31 - 41",
		"hero_movement_speed":"290",
		"hero_armor":"5.38",
		"hero_name":"Spirit Breaker",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/spirit_breaker_vert.jpg",
		"hero_role":"Melee - Carry - Initiator - Disabler - Durable - Escape",
		"hero_detail":"Solo Mmr 2000 ကေန 3000 အထိ Push တဲ့အခါမွာ မ်ားေသာအားျဖင့္ Aggressive Hero ေတြ အသုံးဝင္ပါတယ္။ ဒီအပုိင္းအျခားေလာက္အထိ ကစားသမားအမ်ားစုဟာ Carry Hero ေတြကုိသာ အကုိင္မ်ားေလ့ရွိဆဲ ျဖစ္ျပီး Farming ကုိ ဦးစားေပးတဲ့ Carry ေတြအေတြ႕ရမ်ားတတ္ပါတယ္။ Carry Hero အမ်ားစုရဲ႕ အဓိက အားနည္းခ်က္ကေတာ့ Disable Abiilty မရွိျခင္းျဖစ္ျပီး Disable Ability ကုိ အဓိက ေၾကာက္ရတဲ့ Hero ေတြအေနနဲ႕ Disable နည္းတဲ့ Mmr အပုိင္းအျခားမွာ အသုံးဝင္ေလ့ရွိပါတယ္။ ဒီလုိ Disable ကုိ ေၾကာက္ရတဲ့ Hero ေတြထဲမွာမွ Aggressive Play Style နဲ႕ အကုိက္ညီဆုံး Initiator Hero တစ္ေကာင္ကေတာ့ Barathrum The Spirit Breaker ပဲျဖစ္ပါတယ္။Solo mmr အတြက္ မဟုတ္ဘဲ တကယ္လုိ႔ သင္က Team တစ္ခုနဲ႕ ကစားျဖစ္ေနတဲ့ ကစားသမားတစ္ေယာက္ျဖစ္ေနမယ္ဆုိရင္ေတာင္ သင့္အသင္းအတြက္ လုိအပ္တဲ့ Vision, Initiation ကို အျပည့္အဝ ေပးႏုိင္မယ့္ Spirit Breaker ဟာ Professional ကစားပြဲေတြ အထိ အ Ban ခံ Hero တစ္ေကာင္ျဖစ္ေလာက္ေအာင္ အေႏွာင့္အယွက္ေပးႏုိင္တယ္ဆုိတဲ့အခ်က္ကုိ ေမ့မထားသင့္ပါဘူး။\nMovement Speed, Damage နဲ႕ Disable တုိ႔ အျပန္အလွန္ ခ်ိတ္ဆက္ေနတဲ့ Hero တစ္ေကာင္ျဖစ္တဲ့အတြက္ Barathrum ကုိ မ်ားစြာ Flexiable က်တဲ့ Hero တစ္ေကာင္အျဖစ္ သတ္မွတ္ႏုိင္ပါတယ္။ ကစားသမားေတြအတြက္ Hot Issue တစ္ခုလုိျဖစ္ေနတဲ့ သူ႔ရဲ႕ Greater Bash ဟာလည္း Pseudo Random Distrubution နဲ႕ တြက္ခ်က္လုိက္ျပီ ဆုိေပမယ့္ ေၾကာက္ဖုိ႔ေကာင္းေနဆဲ Passive Ability တစ္ခုျဖစ္ေနဆဲပါပဲ။ Spirit Breaker ဟာ သာမန္ Ganker Hero တစ္ေကာင္လုိ ကစားရတာျဖစ္ေပမယ့္ တျခား Ganker ေတြထက္ သတိပုိထားျပီး ေဆာ့ေပးဖုိ႔ လုိအပ္ပါတယ္။",
		"hero_overview":"MMr Push မယ့္ ကစားသမားတစ္ေယာက္အေနနဲ႕ တတ္နိုင္ရင္တတ္နုိင္သေလာက္ မိနစ္ ၂ဝ မတုိင္ခင္မွာ Charge ကုိ ဆက္တုိက္ အသုံးျပဳေပးတဲ့ ပုံကုိ ေဆာ့သင့္ပါတယ္။ လမ္းတစ္လမ္းမွာ အေျခခ်ထုိင္ျပီး Item Farm ေနတာထက္ စာရင္ လုိက္ Gank ေနတာက ပုိျပီး ထိေရာက္ေလ့ရွိပါတယ္။ တစ္ဖက္အသင္းရဲ႕ Mid Laner ကုိ အလြယ္ကူဆုံး Gank ေပးႏုိင္တဲ့ Hero ေတြထဲမွာ Bara လည္းထိပ္ဆုံးက ပါဝင္ပါတယ္။ Enemy Mid Laner က မိမိ Mid Lane ရဲ႕ High Ground ေပၚတက္မယ့္ အခ်ိန္ေလာက္မွာ ကြက္တိေရာက္ေအာင္ သြားႏုိင္ဖုိ႔အတြက္ ကစားပြဲမ်ားဖုိ႔ အေလ့အက်င့္လုိပါတယ္။ Nature Prophet ဟာလည္း ကစားပြဲ အေစာပုိင္း Team Fight တုိင္းကုိ အခ်ိန္မွီ သြားႏုိင္တဲ့ Hero တစ္ေကာင္ျဖစ္တယ္ဆုိေပမယ့္ Bara ဟာ ပုိျပီး Tanky ျဖစ္တဲ့အျပင္ Disable, Nuke အစုံအလင္ပါတဲ့ Hero တစ္ေကာင္ျဖစ္ေနလုိ႔ ကစားပြဲအေစာပုိင္း အရမ္းအားသာပါတယ္။ Carry မ်ားတဲ့ ကစားပြဲမွာ Aggressive ဆန္ဆန္ဝင္ေရာက္လာတဲ့ Bara ကုိ အျမန္ ေသြးေလွ်ာ့ဖုိ႔ Nuke, Disable, Slow, စတဲ့ Support Ability ေတြ ပ်က္လက္ေနျခင္းက Bara ကုိ Pick ဖုိ႔ အားသာခ်က္ရွိရျခင္း ျဖစ္ပါတယ္။\nအေစာပုိင္း ဖိႏွိပ္ထားႏုိင္ျခင္းက လမ္းျပန္တုိးဖုိ႔ စဥ္းစားေလ့မရွိတဲ့ 3k mmr မတုိင္ခင္မွာ အေကာင္းဆုံး ကစားကြက္တစ္ခုလုိ႔ ေျပာလုိ႔ရပါတယ္။ \nအေစာပုိင္း Aggressive ေဆာ့ဖုိ႔အတြက္ Mango, Clarity Potion, Faerie Fire တုိ႔ကုိ အလုံအေလာက္ ေဆာင္ထားသင့္ျပီး Boots of Speed နဲ႕ Urn of Shadow တုိ႔ဟာ အေျခခံအက်ဆုံး လုိအပ္ခ်က္မ်ားျဖစ္ပါတယ္။ Enemy Hero ကုိ အေစာပုိင္းသတ္ဖုိ႔အတြက္ \n150 Damage ဟာ လုံေလာက္တဲ့ ပမာဏ ျဖစ္သလုိ ကုိယ္တုိင္ Heal ဖုိ႔လည္း လုိအပ္တဲ့အတြက္ မျဖစ္မေန ေရြးခ်ယ္သင့္တဲ့ Basic Item တစ္ခုအျဖစ္ အၾကံျပဳရျခင္းျဖစ္ပါတယ္။ အထက္မွာ ေဖာ္ျပခဲ့သလုိ Attack Speed ဟာ အဓိက လုိအပ္တဲ့ အားသာခ်က္ျဖစ္တဲ့အတြက္ Madness, Sange and Yasha, Assault တုိ႔ကို ေရြးခ်ယ္နုိင္ေပမယ့္ ျဖစ္ႏုိင္ရင္ Aggressive Bara အတြက္ Boots of Speed ျပီးတာနဲ႕ Blade Mail ထည့္ျခင္းက ပုိထိေရာက္ပါလိမ့္မယ္။ မိမိရဲ႕ Charge Target ကုိ ေရာက္ခါနီးမွာ ဦးေအာင္ Blade Mail ဖြင့္ထားျခင္းက တစ္ဖက္က ကူညီတုိက္ခုိက္ေပးမယ့္ Spell Caster ေတြကို ဒုကၡေပးပါလိမ့္မယ္။ Bara ဟာ Battle Fury နဲ႕ မလုိက္ဖက္တဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ ေရရွည္ ကစားပြဲအတြက္ Mjollnir ကုိ ေရြးခ်ယ္ျခင္းက သူ႕ရဲ႕ Attack Speed လုိအပ္ခ်က္ကုိ ျဖည့္စည္းေပးျပီးသားျဖစ္ပါလိမ့္မယ္။\nကစားပြဲမွာရွိမယ့္ Enemy Team ေပၚမူတည္ျပီး Blade Mail ကုိ ေရြးခ်ယ္ခဲ့မယ္ဆုိရင္ Armlet, Lotus Orb, Crimson Guard, Bkb, Aghanim, Heart တုိ႔ကုိ ေနာက္ဆက္တြဲအျဖစ္ စဥ္းစားႏုိင္သလုိ မိမိအားသာလုိ႔ ဆက္တုိက္ Aggressive ဖုိ႔အတြက္ Madness, Sange and Yasha, Assault, Drum, Moonshard တုိ႔ကုိ လည္း စဥ္းစားႏုိင္ပါတယ္။ 3k mmr ကစားသမားမ်ားသာလွ်င္ အသုံးျပဳသင့္တယ္လုိ႔ အၾကံေပးတာ မဟုတ္တဲ့အတြက္ Barathrum ဟာ မည္သည့္ mmr နဲ႕ မဆုိ Aggressive ဆန္ဆန္ ကစားခ်င္တဲ့ ကစားသမားတုိင္းအတြက္ ျပီးျပည့္စုံတဲ့ Ability ေတြနဲ႕ ဖြဲ႕စည္းထားတဲ့ Hero တစ္ေကာင္ဆုိတာေတာ့ ျငင္းလုိ႔ မရပါဘူး။ မည္သုိ႔ပင္ ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မယ္။",
		"hero_spell":[
			{
				"spell_name":"Charge of Darkness",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_charge_of_darkness_hp1.png",
				"spell_overview":"Global Cast Range ရွိတဲ့ Charge of Darkness ဟာ Spirit Breaker ရဲ႕ Initiation Ability တစ္ခုျဖစ္ပါတယ္။ ေျမပုံေပၚက Ally မဟုတ္တဲ့ မည္သည့္ Unit ကုိ မဆုိ အသုံးျပဳႏုိင္ျပီး Cast Time 0.47 second အျပီးမွာ အဆုိပါ Unit ဆီသုိ႔ ဦးတည္ျပီး ထြက္ခြာသြားမွာျဖစ္ပါတယ္။ ထုိသုိ႔ သြားတဲ့အခါမွာ ပုံေသ 600/650/700/750 Movement Speed ရွိမွာျဖစ္ျပီး ပုိျမန္ေအာင္ Item အသုံးျပဳျခင္း၊ ပုိေႏွးသြားေအာင္ Slow ဆြဲျခင္းမ်ား လုပ္လုိ႔မရပါဘူး။ တကယ္လုိ႔ သင္က Greater Bash ကုိ အနည္းဆုံး တစ္ဆင့္ခန္႔ ယူထားမယ္ဆုိရင္ ထုိသုိ႔ သြားေနစဥ္တစ္ေလွ်ာက္လုံး Spirit Breaker ရဲ႕ 300 AoE အတြင္းက တုိက္မိသမွ် Unit အားလုံးကုိ Greater Bash ရဲ႕ လက္ရွိ အေျခအေနအတုိင္း သက္ေရာက္ေစဦးမွာ ျဖစ္ပါတယ္။ ဒါေၾကာင့္ မိမိယူထားတဲ့ အဆင့္အလုိက္ Disable မသက္ေရာက္ခင္မွာ Greater Bash တြန္းခံရတဲ့ Damage နဲ႕ Knockback ကုိ ဦးစြာ သက္ေရာက္ေစပါမယ္။ အားသာခ်က္အျဖစ္ အဆုိပါ Charge သြားေနစဥ္အတြင္း Mask of Madness, Bkb, Drum, Shadow Blade, Lotus Orb အစရွိတဲ့ Active Item ေတြ ကုိ စိတ္တုိင္းက် အသုံးျပဳရင္ေတာင္ Charge ကုိ မပ်က္ေစတဲ့ အခ်က္ျဖစ္ပါတယ္။ အားနည္းခ်က္ကေတာ့ Blink Ability ေတြကုိ ပိတ္ထားႏုိင္တဲ့ ပုိက္ကြန္ (Naga Ensnare, Meepo Earth Bind, Treant Overgrowth, etc..) စတဲ့ Root Ability မ်ားနဲ႕ ဖမ္းထားႏုိင္သလုိ ထုိကဲ့သုိ႔ Root ခံထားရခ်ိန္မွာ Charge of Darkness ကုိ အသုံးျပဳျပီး ထြက္ေျပးလုိ႔မရပါဘူး။"
			},
			{
				"spell_name":"Empowering Haste",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_empowering_haste_hp1.png",
				"spell_overview":"ေနာက္ဆုံး ဦးစားေပး ယူေလ့ရွိတဲ့ Empowering Haste ကေတာ့ AoE Movement Speed Aura Ability ျဖစ္ပါတယ္။ Bara ရဲ႕ 900 AoE အတြင္းက Ally Unit ေတြကုိ 6%/ 10%/ 14%/ 18% Movement Speed Bonus ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ ႏွိပ္သုံးခဲ့မယ္ဆုိရင္ ပထမ 6 seconds မွာ လက္ရွိ Aura ကုိ 50% တုိးသြားေစမွာျဖစ္ျပီး အဆုိပါ Duration အျပီး ေနာက္ထပ္ 6 seconds မွာ Aura ရဲ႕ 50% နည္းေနေစမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ ပုံမွန္အေျခအေနမွာ ႏွိပ္သုံးစရာ မလုိေပမယ့္ Battle တစ္ခု အစျပဳျပဳျခင္း ဒါမွမဟုတ္ Charge of Darkness ဝင္တိုက္တုိက္ျခင္းမွာ ႏွိပ္သုံးေပးဖုိ႔ လုိအပ္ပါတယ္။"
			},
			{
				"spell_name":"Greater Bash",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_greater_bash_hp1.png",
				"spell_overview":"Empowering Haste ကုိ ႏွိပ္သုံးေစရတဲ့ အဓိက ရည္ရြယ္ခ်က္က Greater Bash ေၾကာင့္ပဲျဖစ္ပါတယ္။ Greater Bash ဟာ Bara ရဲ႕ လက္ရွိ Movement Speed ပမာဏကုိ တြက္ခ်က္ျပီး Damage သတ္ေရာက္တာျဖစ္လုိ႔ MS မ်ားေလ Damage မ်ားေလ ျဖစ္ရျခင္းျဖစ္ပါတယ္။ ဒါေၾကာင့္ Yasha, Madness, Drum လုိ Item မ်ဴိးဟာ Bara အတြက္ အေရးၾကီး၊ အေရြးမ်ားတဲ့ Item မ်ားျဖစ္ေနရျခင္းျဖစ္ပါတယ္။ v6.85 က စျပီး 17% Bash Chance ဟာ Psuedo Random တြက္ခ်က္မႈျဖစ္လုိ႔ ျဖစ္ႏုိင္ေခ် ပုိနည္းသြားျပီဆုိေပမယ့္ Attack Speed Item ေတြနဲ႕ အသားက်ေနျပီျဖစ္တဲ့ Bara အေနနဲ႕ Attack Speed မ်ားမ်ား၊ Movement Speed မ်ားမ်ားရွိေနမယ္ဆုိရင္ Damage အတြက္ သီးသန္႔ ထပ္စဥ္းစားစရာ မလုိေအာင္ Greater Bash က ေထာက္ပံ့ေပးပါလိမ့္မယ္။ Bash ဝင္သြားတာနဲ႕ Bara ဟာ 3 seconds ၾကာျမင့္တဲ့ 15% Movements Speed Increase ကုိ ရရွိေစဦးမွာ ျဖစ္ပါတယ္။ ဒါေပမယ့္ Bash Chance ဟာ 1.5 seconds Cooldown ရွိတဲ့အျပင္ Magical Damage ဆုိတဲ့အခ်က္ကုိလည္း ေမ့မထားသင့္ပါဘူး။"
			},
			{
				"spell_name":"Nether Strike",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/spirit_breaker_nether_strike_hp1.png",
				"spell_overview":"Ultimate Nether Strike ကေတာ့ Finishing Ability တစ္ခုအေနနဲ႕ အသုံးျပဳေလ့ရွိသလုိ အေစာပုိင္းကတည္းက အားသာခ်က္ရရွိေအာင္ ဦးစြာ အသုံးျပဳေလ့ရွိတဲ့ Nuke Ability တစ္ခုျဖစ္ပါတယ္။ အသုံးျပဳလုိက္တဲ့အခါမွာ မိမိ Target ရဲ႕ ဆန္႔က်င္ဘက္ 54 Range အကြာကေန ေပၚထြက္လာမွာျဖစ္ျပီး အဆုိပါ Unit ကုိ 150/250/350 Damage နဲ႕အတူ လက္ရွိယူထားတဲ့ Greater Bash ရဲ႕ Knockback အကြာအေဝး၊ Damage တုိ႔ကုိပါ သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။ 1.2 seconds Cast Time နဲ႕ 700 Cast Range ရွိပါတယ္။ Aghanim's Scepter ဆက္ခြင့္ရွိတဲ့ Ultimate အမ်ဴိးအစားျဖစ္ျပီး စပ္လုိက္မယ္ဆုိရင္ 20 Seconds Cooldown, 850 Cast Range နဲ႕ Bara ေရာက္ရွိသြားမယ့္ ေနရာရဲ႕ 250 AoE အတြင္းမွာ Damage နဲ႕ Greater Bash ကုိလည္း သတ္ေရာက္ေစမွာျဖစ္ပါတယ္။"
			}
		]
 },

 {
	 	"share_hero":"https://www.facebook.com/yahooyeehadotasuggestion/posts/643270659157139",
	 	"hero_intellgience":"21 + 2.40",
	 	"hero_agility":"16 + 1.30",
	 	"hero_strength":"22 + 1.80",
	 	"hero_damage":"26 - 30",
	 	"hero_movement_speed":"290",
	 	"hero_armor":"0.24",
		"hero_name":"Timbersaw",
		"hero_image":"http://cdn.dota2.com/apps/dota2/images/heroes/shredder_vert.jpg",
		"hero_role":"Melee - Nuker - Durable - Escape",
		"hero_detail":"Patch Update တစ္ခုဟာ Hero တစ္ေကာင္ရဲ႕ အသုံးဝင္မႈကုိ မ်ားစြာ ေျပာင္းလဲသြားေစႏုိင္ပါတယ္။ v6.87 မွာေတာ့ သိသာလြန္းတဲ့ Buff ေပးမႈေတြေၾကာင့္ Hero တစ္ေကာင္ဟာ Role ေရာ၊ Play Style ပါ သိသိသာသာ ေျပာင္းလဲသြားခဲ့ရပါတယ္။ သူကေတာ့ Rizzrack The Timbersaw ပဲျဖစ္ပါတယ္။ Durable နဲ႕ Escape ပုံစံရွိတဲ့ Ability ေတြေၾကာင့္ သူ႔ကုိ စတင္တီထြင္ခဲ့တဲ့ v6.73 မွာကတည္းက Offlane ပုံစံ အျမင္ေတြ႕ရမ်ားခဲ့ေပမယ့္ v6.87 မွာ တုိးျမွင့္ေပးလုိက္တဲ့ Reactive Armor နဲ႕ Whirling Death တုိ႔ေၾကာင့္ Timbersaw ဟာ Mid Lane Hero တစ္ေကာင္အျဖစ္ပါ အသုံးျပဳလုိ႔ရေၾကာင္းကုိ Manila Major မွာ ေတြ႕ျမင္ခဲ့ရျပီးျဖစ္ပါတယ္။Timbersaw ဟာ အသုံးျပဳစရာ Ability ၃ ခု ပါဝင္ျပီး ၃ ခုစလုံးက Pure Damage ျဖစ္ေနျခင္းက Dota မွာ သူမတူတဲ့ အားသာခ်က္တစ္ခုလုိ႔ေျပာလုိ႔ရပါတယ္။ ကုိယ္တုိင္ Physical တုိက္ခုိက္ဖုိ႔ Dmg item ေတြ ထည့္လုိ႔မရေပမယ့္ Durable Item ေတြ ထည့္ရင္းနဲ႕ ျပီးျပည့္စုံတဲ့ Nuker တစ္ေကာင္ျဖစ္ေနတဲ့ Timbersaw ဟာ လာမယ့္ Patch အသစ္မွာ Nerf ခံရဖုိ႔ က်ိန္းေသသေလာက္ရွိတဲ့ Hero တစ္ေကာင္ျဖစ္လုိ႔ မည္သုိ႔ပင္ဆုိေစကာမူ မိမိႏွစ္သက္ေသာ ကစားကြက္သည္သာလွ်င္ မိမိအတြက္ အေကာင္းဆုံး ျဖစ္ပါလိမ့္မည္။",
		"hero_overview":"V6.87 မတုိင္ခင္က Timbersaw ကုိ Offlane Hero အျဖစ္အေဆာ့မ်ား ခဲ့ပါတယ္။ အဆုိပါ ကာလတုန္းက သူ႔ရဲ႕ Timber Chain ကုိ Lvl 7 မွာ ဆုံးေအာင္ ယူျပီး Aggressive Escape ပုံစံနဲ႕ေဆာ့ခဲ့ၾကပါတယ္။ v6.87 အေရာက္မွာေတာ့ Whirling Death ရဲ႕ Debuff Duration ေၾကာင့္ Timbersaw ဟာ Midlane ေနျပီး Whirling Death + Reactive Armor နဲ႕ ေဆာ့လုိ႔ ရသြားပါတယ္။ Reactive Armor ေၾကာင့္ Escape ပုံစံအစား Durable ပုံစံနဲ႕ေဆာ့လ်က္ရွိျပီး ပူစရာမလုိတဲ့ Hp Regen ကုိ ရရွိထားလုိ႔ Lvl သာတဲ့ Mid Lane မွာ ျမင္ေတြ႕ခြင့္ရခဲ့ျခင္းပဲ ျဖစ္ပါတယ္။ Aggressive Ganker Mid Hero ေတြ ဆက္ေလ့ရွိတဲ့အတုိင္း Bloodstone ဟာ Timbersaw လုိ Mana တရစက္ သုံးရတဲ့ Hero တစ္ေကာင္အတြက္ အေျခခံလုိအပ္တဲ့ Item တစ္ခုအျဖစ္ အမ်ားဆုံး ေရြးခ်ယ္လ်က္ရွိပါတယ္။ ဒါ့အျပင္ Item အသစ္တစ္ခုျဖစ္တဲ့ Octarine Core ဟာလည္း Damage Output Ability ၃ ခု ပါဝင္တဲ့ Timbersaw အတြက္ ပုိျပီး Durable ျဖစ္ေစမယ့္ Spell Healing ကုိ အေထာက္အကူ ေပးတဲ့အျပင္ Whirling Death ကုိ 4.5 secodns, Timber Chain ကုိ 3 seconds နဲ႕ Chakram ကုိ 6 seconds အထိ Cooldown မ်ား အသီးသီး က်ေစမွာျဖစ္လုိ႔ Mid Game ေလာက္ကတည္းက ေရြးခ်ယ္ဖုိ႔ အေကာင္းဆုံး Item အျဖစ္ ရပ္တည္လ်က္ရွိပါတယ္။ အဓိက Battle တစ္ခုကုိ စိတ္တုိင္းက် Initiate လုပ္ဖုိ႔အတြက္ Dagger လုိအပ္ျပီး၊ Shiva Guard, Crimson Guard, Pipe စတဲ့ Aura Item ေတြကုိလည္း ပြဲအေျခအေနအရ ေရြးခ်ယ္ႏုိင္ပါတယ္။ ပြဲၾကာလာေလေလ မရွိမျဖစ္လုိအပ္တဲ့ Item ေတြထဲမွာ Aghanim’s Scepter ဟာလည္း ထိပ္ဆုံးက ပါဝင္ေလာက္ေအာင္ ဝယ္ဖုိ႔ ထိုက္တန္တဲ့ ပစၥည္းတစ္ခုလည္းျဖစ္ပါတယ္။",
		"hero_spell":[
			{
				"spell_name":"Whirling Death",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shredder_whirling_death_hp1.png",
				"spell_overview":"V6.87 မွာ တုိးျမင့္ေပးလုိက္တဲ့ Whirling Death ရဲ႕ Debuff Duration ဟာ Timbersaw ကုိ Overpower Hero တစ္ေကာင္ျဖစ္ေစတဲ့ အဓိက Ability ပဲျဖစ္ပါတယ္။ AoE 300 နဲ႕ နည္းပါးလြန္းတဲ့ ပုံေသ 70 Mana Cost သာ ရွိတဲ့အျပင္ သူ႔ရဲ႕ Attribute Reduction ဟာ အထူးသျဖင့္ Enemy Tank Hero ေတြအားလုံးကုိ Counter လုပ္ႏုိင္မယ့္ Ability ျဖစ္ပါတယ္။ Debuff ရဲ႕ သတ္ေရာက္ပုံကေတာ့ Whirling Death ထိသြားတဲ့ Hero ဟာ Damage မသတ္ေရာက္ခင္ကတည္းက သူ႔ရဲ႕ Main Attribute ကုိ 15% ႏႈတ္ပစ္လုိက္မွာျဖစ္ပါတယ္။ ဥပမာ - Whirling Death နဲ႕ Base Strength 100 ရွိတဲ့ Centaur Warrunner ကုိ တုိက္ခုိက္မယ္ဆုိပါစုိ႔။ ပုံမွန္ 250 Magical Damage သာရွိမယ့္ Ability တစ္ခုနဲ႕တုိက္ခုိက္တဲ့အခါ Magic Resistance 25% ျပန္ႏႈတ္လုိက္ရင္ Centaur ဟာ 188 Hp သာ ေလ်ာ့ေစမွာျဖစ္ပါတယ္။ Whirling Death နဲ႕တုိက္ခုိက္တဲ့အခါ သူ႔ရဲ႕ Base Strength 15% ျဖစ္တဲ့ 15 Strength ကုိ ဦးစြာႏႈတ္လုိက္မွာျဖစ္လုိ႔ Hp 300 ဟာ ဦးစြာေလ်ာ့သြားမွာပါ။ ဒါဟာ Whirling Death ရဲ႕ 250 Damage နဲ႕ မသတ္ဆုိင္ေသးပါဘူး။ အဲ့ဒီ့ Debuff ေၾကာင့္ 300 Hp ေလ်ာ့ျပီးမွ က်န္တဲ့ Hp ကုိ 250 Magic Damage (188 Dmg After reduction) သတ္ေရာက္မွာမုိ႔လုိ႔ စုစုေပါင္း 488 Hp ခန္႔ကုိ ေလ်ာ့ေစမွာနဲ႕ ညီမွ်သြားပါလိမ့္မယ္။ ဒီ Debuff ဟာ Duration 14 seconds အတြင္းမွာ Stack ျဖစ္ႏုိင္တဲ့အတြက္ Debuff ဝင္ျပီးသား Hero ကုိ ေနာက္တစ္ေခါက္ တုိက္ခုိက္ျပီး က်န္ေနတဲ့ Base Attribute ကုိ ထက္ျပီး ေလ်ာ့ခ်ႏုိင္မွာျဖစ္ပါတယ္။ မိမိတုိက္ခုိက္တဲ့ Hero က Agility Hero ဆုိရင္ေတာ့ သူ႔ရဲ႕ Base Agility ကုိ ထိခုိက္လုိ႔ Armor နဲ႕ Attack Speed ကုိ ေလ်ာ့ေစမွာျဖစ္သလုိ Intelligence Hero ကုိ ဆုိရင္ေတာ့ Mana Regen နဲ႕ Mana Pool ကို ေလ်ာ့ေစမွာျဖစ္ပါတယ္။ အဓိက က်တဲ့ အားသာခ်က္တစ္ခုကေတာ့ Whirling Death ရဲ႕ 300 AoE အတြင္းမွာ အနည္းဆုံး သစ္ပင္တစ္ပင္ကုိ ခုတ္မိလ်က္သားျဖစ္ခဲ့ရင္ေတာ့ 250 Magic Damage ကေန 250 Pure Damage အျဖစ္ ေျပာင္းလဲ သတ္ေရာက္ေစမယ့္ အခ်က္ပဲျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Timber Chain",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shredder_timber_chain_hp1.png",
				"spell_overview":"Timbersaw ရဲ႕ Escape Ability တစ္ခုလုိ႔ လက္ခံထားတဲ့ Timber Chain ကေတာ့ မ်ားမ်ားယူေလ Damage နဲ႕ Cast Range တုိးလာေစမယ့္ Nuke Ability တစ္ခုျဖစ္ပါတယ္။ Mana Cost ဟာ 60/ 70/ 80/ 90 ဆုိျပီး တုိးလာမွာျဖစ္ေပမယ့္ Cooldown ကေတာ့ ပုံေသ 4 seconds ရွိပါလိမ့္မယ္။ သစ္ပင္တစ္ပင္ကုိ ခ်ိန္ျပီး အသုံးျပဳဖုိ႔လုိအပ္ျပီး အဆုိပါ သစ္ပင္ဆီသုိ႔ မိမိယူထားတဲ့အဆင့္အလုိက္ 1600/2000/2400/2800 Speed ႏႈန္းနဲ႕ ဒရြတ္ဆြဲသြားမွာ ျဖစ္ပါတယ္။ အဆုိပါ လမ္းေၾကာင္းတစ္ေလွ်ာက္ Timbersaw ရဲ႕ 225 AoE အတြင္းမွာ 100/ 140/ 180/ 220 Pure Damage ဟာ သတ္ေရာက္သြားမွာျဖစ္ပါတယ္။ Timbersaw ရဲ႕ ဒရြတ္ဆြဲသြားေနတဲ့ ကာလအတြင္းမွာ Disable လုပ္ခံရမယ္ဆုိရင္ေတာ့ ေနရာမွာ ရပ္တန္႔သြားပါလိမ့္မယ္။"
			},
			{
				"spell_name":"Reactive Armor",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shredder_reactive_armor_hp1.png",
				"spell_overview":"မိမိေပၚသုိ႔ Normal Attack တစ္ခုခုက်ေရာက္လာတုိင္း Hp Regen နဲ႕ Armor ကုိရရွိေစမယ့္ Passive Ability တစ္ခုျဖစ္တဲ့ Reactive Armor ကေတာ့ v6.87 မွာ အေကာင္းမြန္ဆုံး အေျခအေနထိ Buff ခံခဲ့ရပါတယ္။ ပထမတစ္ဆင့္တည္းသာ ယူထားခ်ိန္မွာေတာင္ Normal Attack တစ္ခုျဖင့္ တုိက္ခုိက္ခံရတုိင္း 14 seconds ၾကာျမင့္တဲ့ +1 Hp Regen နဲ႕ + 1 Armor ကုိ ရရွိေစမွာျဖစ္ပါတယ္။ အမ်ားဆုံး Stack ၅ ခုထိ လက္ခံႏုိင္တဲ့အတြက္ Timbersaw ဟာ Normal Attack ၅ ခါ အထိခံလုိက္ရတာနဲ႕ +5 Hp Regen (Total 70 Hp Heal) နဲ႕ +5 Armor ကုိ ရရွိေနမွာပါ။ ဒါေၾကာင့္ ေနာက္ဆုံးအဆင့္မွာ Stack ဟာ Normal Attack အခု ၂ဝ အထိ လက္ခံထားရတဲ့ Timbersaw ဟာ Duration 20 seconds အတြင္းမွာ 1 second ကုိ 32 Hp Regen နဲ႕ +32 Armor ကုိ ရရွိေနမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ ကစားပြဲအေစာပုိင္းမွာ Reactive Armor ကုိ မ်ားမ်ားတင္ထားျပီး Enemy Lane Creep ၾကားထဲဝင္၍ Aggressive ပုံစံ ကစားရဲျခင္းက Timbersaw ကုိ မ်ားျပားတဲ့ Hp Regen နဲ႕ Armor Amount ကုိ ျပန္ေပးမယ့္အတြက္ေၾကာင့္ပဲျဖစ္ပါတယ္။"
			},
			{
				"spell_name":"Ultimate Chakram",
				"spell_image":"http://cdn.dota2.com/apps/dota2/images/abilities/shredder_chakram_2_hp1.png",
				"spell_overview":"Cast Range 1200 ရွိေပမယ့္ ေသးငယ္ေသာ AoE 200 ခန္႔သာ ရွိေသာ Ultimate Chakram ကေတာ့ Timbersaw ရဲ႕ Dsp Nuke Ability တစ္ခုျဖစ္ပါတယ္။ Chakram ဟာ အထြက္မွာ Pure Damage တစ္ခါထိျပီး ျပန္အဝင္မွာ ေနာက္ထပ္ Pure Damage တစ္ခါ ထပ္ထိမွာျဖစ္ပါတယ္။ Chakram ကုိ ျပန္မသိမ္းပဲ ထားထားမယ္ဆုိရင္ အဆုိပါ 200 AoE အတြင္းမွာ 50/ 75/ 100 Magic Dps သတ္ေရာက္ေနမယ့္အျပင္ အသတ္ေရာက္ခံ Unit ရဲ႕ 5% lost တုိင္းအတြက္ 5% MS Slow ကုိ ထပ္မံ သတ္ေရာက္ေစဦးမွာျဖစ္ပါတယ္။ ဒါေၾကာင့္ 90% Hp လက္က်န္ရွိေသးတဲ့ Hero ကုိ 10% MS Slow ေစမွာျဖစ္ေပမယ့္ 20% Hp သာ က်န္ေတာ့တဲ့ Enemy Hero ဟာ 80% MS Slow ကုိ သတ္ေရာက္ေစမွာပါ။ ပုံေသ Cooldown 8 seconds ရွိတဲ့အတြက္ အမ်ားစုေသာ ကစားသမားေတြဟာ အသြား နဲ႕ အျပန္ Pure Damage ျဖင့္သာ တုိက္ခုိက္ေလ့ရွိပါတယ္။ Chakram ကုိ အသုံးျပဳဖုိ႔ 100/ 150/ 200 Mana Cost လုိအပ္မွာျဖစ္ျပီး Dps အတြက္ Chakram ကုိ ျပန္မသိမ္းဘဲထားမယ္ဆုိရင္ေတာ့ 20/ 25/ 30 Mana per seconds ကုန္က်မွာျဖစ္ပါတယ္။ Chakram ကုိသုံးထားခ်ိန္မွာ Timbersaw ဟာ Disarm ျဖစ္ေနမွာျဖစ္ျပီး Chakram နဲ႕ 2000 Range အကြာအေဝးကုိ ေရာက္သြားမယ္ဆုိရင္ေတာ့ Chakram က သိမ္းစရာမလိုဘဲ Timbersaw ဆီ ျပန္ဝင္သြားမွာျဖစ္ပါတယ္။ Aghanim’s Scepter ကုိ ေရြးခ်ယ္ခဲ့ရင္ေတာ့ ပုံစံတူ ဒုတိယေျမာက္ Chakram တစ္ခုကို ထပ္မံအသုံးျပဳခြင့္ ရရွိပါလိမ့္မယ္။"
			}
		]
  }
]